# -*- coding: utf-8 -*-
#Created on 2018-12-3 @author: 권달현

환율변동효과    ={
        "기업회계기준서 제1021호 ‘환율변동효과":{},
        "한국회계기준원 회계기준위원회":{},
        "의결 2015. 9. 25.":{},
        "기업회계기준서 제1021호 ‘환율변동효과’는 문단 1~62로 구성되어 있다. 모든 문단에는 동등한 권위가 부여되어 있다. 이 기준서는 이 기준서의 목적, 결론도출근거, ‘기업회계기준 전문’ 및 ‘재무보고를 위한 개념체계’를 배경으로 이해하여야 한다. 회계정책의 선택 및 적용에 대하여 명시적으로 규정하지 않은 경우에는 기업회계기준서 제1008호 ‘회계정책, 회계추정의 변경 및 오류’에 따른다.":{},
        "개요":{
                "제․개정 경과":{},
                "이 기준서의 주요 특징":{
                        "1.	기능통화에 의한 외화거래의 보고":{
                                "⑴	기능통화로 외화거래를 최초로 인식하는 경우에 거래일의 외화와 기능통화 사이의 현물환율을 외화금액에 적용하여 기록한다.":{},
                                "⑵	보고기간말의 외화환산방법은 다음과 같다.":{
                                        "㈎	화폐성 외화항목은 마감환율로 환산한다. ":{},
                                        "㈏	역사적원가로 측정하는 비화폐성 외화항목은 거래일의 환율로 환산한다.":{},
                                        "㈐	공정가치로 측정하는 비화폐성 외화항목은 공정가치가 측정된 날의 환율로 환산한다. ":{},
                                },
                                "⑶	화폐성항목의 결제시점에 생기는 외환차이와 화폐성항목의 환산에 사용한 환율이 회계기간 중 최초로 인식한 시점이나 전기의 재무제표 환산시점의 환율과 다르기 때문에 생기는 외환차이는 그 외환차이가 생기는 회계기간의 손익으로 인식한다. 다만, 기타포괄손익으로 분류하는 외환차이에는 이를 적용하지 아니한다.":{},
                                "⑷	비화폐성항목에서 생긴 손익을 기타포괄손익으로 인식하는 경우에 그 손익에 포함된 환율변동효과도 기타포괄손익으로 인식한다. 그러나 비화폐성항목에서 생긴 손익을 당기손익으로 인식하는 경우에는 그 손익에 포함된 환율변동효과도 당기손익으로 인식한다.":{},
                                "⑸	해외사업장에 대한 순투자의 일부인 화폐성항목에서 생기는 외환차이는 보고기업의 별도재무제표나 해외사업장의 개별재무제표에서 당기손익으로 적절하게 인식한다. 그러나 보고기업과 해외사업장을 포함하는 재무제표에서는 이러한 외환차이를 처음부터 기타포괄손익으로 인식하고 관련 순투자의 처분시점에 자본에서 당기손익으로 재분류한다.":{},
                                "⑹	기능통화가 변경되는 경우에는 새로운 기능통화에 의한 환산절차를 	변경한 날부터 전진적용한다.":{},
                        },
                        "2.	기능통화와 다른 표시통화의 사용":{
                              "⑴	기능통화가 초인플레이션 경제의 통화가 아닌 경우, 경영성과와 재무상태를 기능통화와 다른 표시통화로 환산하는 방법은 다음과 같다.":{
                                      "㈎	재무상태표의 자산과 부채는 해당 보고기간말의 마감환율로 환산한다. ":{},
                                      "㈏	포괄손익계산서의 수익과 비용은 해당 거래일의 환율로 환산한다.":{},
                                      "㈐	환산에서 생기는 외환차이는 기타포괄손익으로 인식한다.":{},
                              },
                                "⑵	기능통화가 초인플레이션 경제의 통화인 경우 경영성과와 재무상태를 기능통화와 다른 표시통화로 환산하는 방법은 다음과 같다.":{
                                        "㈎	모든 금액을 최근 재무상태표 일자의 마감환율로 환산한다. ":{},
                                        "㈏	다만, 금액을 초인플레이션이 아닌 경제의 통화로 환산하는 경우에 비교표시되는 금액은 전기에 보고한 재무제표의 금액으로 한다.":{},
                                },
                                "⑶	기능통화가 초인플레이션 경제의 통화인 경우, 기업회계기준서 제1029호 ‘초인플레이션 경제에서의 재무보고’에 따라 재무제표를 재작성한다. 다만, 초인플레이션이 아닌 경제의 통화로 환산하여 비교표시된 금액은 재작성하지 아니한다. 초인플레이션 상태에서 벗어나게 되어 기업회계기준서 제1029호에 따라 더 이상 재무제표를 재작성하지 않는 경우에는 재무제표의 재작성을 중지한 날의 물가수준으로 재작성한 금액을 표시통화로 환산하기 위한 역사적원가로 사용한다.":{},
                                "⑷	해외사업장의 취득으로 생기는 영업권과 자산․부채의 장부금액에 대한 공정가치 조정액은 해외사업장의 자산․부채로 본다. 따라서 이러한 영업권과 자산․부채의 장부금액에 대한 공정가치의 조정액은 해외사업장의 기능통화로 표시하고 마감환율로 환산한다.":{},
                                "⑸	해외사업장을 처분하는 경우에는 기타포괄손익과 별도의 자본항목으로 인식한 해외사업장관련 외환차이의 누계액은 해외사업장의 처분손익을 인식하는 시점에 (재분류조정으로) 자본에서 당기손익으로 재분류한다.":{},
                        },
                },
        },
        "국제회계기준과의 관계":{},
        "목적			1~2":{
                "1	기업은 외화거래나 해외사업장의 운영과 같은 방법으로 외화관련 활동을 수행할 수 있다. 또 기업은 재무제표를 외화로 표시하기도 한다. 이 기준서의 목적은 외화거래와 해외사업장의 운영을 재무제표에 반영하는 방법과 재무제표를 표시통화로 환산하는 방법을 정하는 데 있다.":{},
                "2	이 기준서는 외화환산에 사용하는 환율의 결정과 환율변동의 효과를 재무제표에 보고하는 방법을 다룬다.":{},
        },
        "적용			한3.1":{
                "한3.1	이 기준서는 ‘주식회사의 외부감사에 관한 법률’에서 정하는 한국채택국제회계기준 의무적용대상 주식회사의 회계처리에 적용한다. 또한 이 기준서는 재무제표의 작성과 표시를 위해 한국채택국제회계기준의 적용을 선택하거나 다른 법령 등에서 적용을 요구하는 기업의 회계처리에도 적용한다. ":{},
        },
        "적용범위		3~7":{
                "3	이 기준서는 다음의 경우에 적용한다.":{
                        "⑴	외화거래와 외화잔액의 회계처리(기업회계기준서 제1109호 ‘금융상품’의 적용범위에 속하는 외화파생상품 거래와 잔액 제외)":{},
                        "⑵	연결재무제표 또는 지분법을 적용하여 작성하는 재무제표에 포함되는 해외사업장의 경영성과와 재무상태의 환산 ":{},
                        "⑶	기업의 경영성과와 재무상태를 표시통화로 환산":{},
                },
                "4	기업회계기준서 제1109호는 많은 외화파생상품에 적용되므로 이러한 외화파생상품에는 이 기준서를 적용하지 아니한다. 그러나 기업회계기준서 제1109호를 적용하지 않는 외화파생상품(예: 기타 계약에 내재된 일부 외화파생상품)에는 이 기준서를 적용한다. 또 이 기준서는 파생상품과 관련된 금액을 기능통화에서 표시통화로 환산하는 경우에 적용한다.":{},
                "5	해외사업장에 대한 순투자의 위험회피 등과 같은 외화 항목에 대한 위험회피회계에는 이 기준서를 적용하지 아니하고 기업회계기준서 제1109호를 적용한다.":{},
                "6	이 기준서는 재무제표를 외화로 보고하는 경우에 적용하며 그에 따른 재무제표가 한국채택국제회계기준에 따라 작성되었다고 기재하기 위해 필요한 요건을 규정한다. 또 이 기준서는 재무정보를 외화로 환산함에 있어 이러한 요건을 충족하지 않는 경우에 공시하여야 하는 정보를 규정한다.":{},
                "7	이 기준서는 외화거래에서 생기는 현금흐름을 현금흐름표에 보고하거나 해외사업장의 현금흐름을 환산하는 경우에는 적용하지 아니한다(기업회계기준서 제1007호 ‘현금흐름표’ 참조).":{},
        },
        "용어의 정의  	8~16":{
                "8	이 기준서에서 사용하는 용어의 정의는 다음과 같다.":{
                        "공정가치: 측정일에 시장참여자 사이의 정상거래에서 자산을 매도할 때 수취하거나 부채를 이전할 때 지급하게 될 가격(기업회계기준서 제1113호 ‘공정가치 측정’ 참조)":{},
                        "기능통화: 영업활동이 이루어지는 주된 경제 환경의 통화":{},
                        "마감환율: 보고기간말의 현물환율":{},
                        "연결실체: 지배기업과 그 지배기업의 모든 종속기업":{},
                        "외화: 기능통화 이외의 다른 통화":{},
                        "외환차이: 특정 통화로 표시된 금액을 변동된 환율을 사용하여 다른 통화로 환산할 때 생기는 차이":{},
                        "표시통화: 재무제표를 표시할 때 사용하는 통화":{},
                        "해외사업장: 보고기업과 다른 국가에서 또는 다른 통화로 영업활동을 하는 종속기업, 관계기업, 공동약정이나 지점":{},
                        "해외사업장에 대한 순투자: 해외사업장의 순자산에 대한 보고기업의 지분 해당 금액":{},
                        "현물환율: 즉시 인도가 이루어지는 거래에서 사용하는 환율":{},
                        "화폐성항목: 보유하는 화폐단위들과 확정되었거나 결정가능한 화폐단위 수량으로 회수하거나 지급하는 자산·부채":{},
                        "환율: 두 통화 사이의 교환비율":{},
                },
        },
        "정의에 대한 자세한 설명	9~16":{
                "기능통화	9~14": {
                        "9	일반적으로 영업활동이 이루어지는 주된 경제 환경은 주로 현금을 창출하고 사용하는 환경을 말한다. 기능통화를 결정할 때는 다음의 사항을 고려한다.":{
                                "⑴	다음의 통화":{
                                        "㈎	재화와 용역의 공급가격에 주로 영향을 미치는 통화(흔히 재화와 용역의 공급가격을 표시하고 결제하는 통화)":{},
                                        "㈏	재화와 용역의 공급가격을 주로 결정하는 경쟁요인과 법규가 있는 국가의 통화":{},
                                },
                                "⑵	재화를 공급하거나 용역을 제공하는 데 드는 노무원가, 재료원가와 그 밖의 원가에 주로 영향을 미치는 통화(흔히 이러한 원가를 표시하고 결제하는 통화)":{},
                        },
                        "10	다음 사항도 기능통화의 증거가 될 수 있다.":{
                                "⑴	재무활동(즉, 채무상품이나 지분상품의 발행)으로 조달되는 통화":{},
                                "⑵	영업활동에서 유입되어 통상적으로 보유하는 통화":{},
                        },
                        "11	해외사업장의 기능통화를 결정할 때 그리고 이러한 해외사업장의 기능통화가 보고기업(여기서 보고기업은 종속기업, 지점, 관계기업, 공동약정 형태로 해외사업장을 갖고 있는 기업)의 기능통화와 같은지 판단할 때 다음 사항을 추가적으로 고려한다.":{
                                "⑴	해외사업장의 활동이 보고기업 활동의 일부로서 수행되는지 아니면 상당히 독자적으로 수행되는지":{
                                        "㈎	해외사업장이 보고기업에서 수입한 재화를 판매하고 그 판매대금을 보고기업으로 송금하는 역할만 한다면 해외사업장이 보고기업의 일부로서 활동하는 예에 해당한다.":{},
                                        "㈏	해외사업장이 대부분 현지통화로 현금 등의 화폐성항목을 축적하고 비용과 수익을 발생시키며 차입을 일으킨다면 해외사업장의 활동이 상당히 독자적으로 수행되는 예에 해당한다.":{},
                                },
                                "⑵	보고기업과의 거래가 해외사업장의 활동에서 차지하는 비중이 높은지 낮은지":{},
                                "⑶	해외사업장 활동에서의 현금흐름이 보고기업의 현금흐름에 직접 영향을 주고 보고기업으로 쉽게 송금될 수 있는지 ":{},
                                "⑷	보고기업의 자금 지원 없이 해외사업장 활동에서의 현금흐름만으로 현재의 채무나 통상적으로 예상되는 채무를 감당하기에 충분한지 ":{},
                        },
                        "12	문단 9~11의 지표들이 서로 다른 결과를 제시하여 기능통화가 분명하지 않은 경우에는 경영진이 판단하여 실제 거래, 사건과 상황의 경제적 효과를 가장 충실하게 표현하는 기능통화를 결정한다. 이 때 경영진은 기능통화를 결정하는 데 추가적인 보조 증거를 제공하는 문단 10과 11의 지표를 고려하기 전에 문단 9의 주요 지표를 우선하여 고려한다.":{},
                        "13	기능통화는 그와 관련된 실제 거래, 사건과 상황을 반영한다. 따라서 일단 기능통화를 결정하면 변경하지 아니한다. 다만 실제 거래, 사건과 상황에 변화가 있다면 그러하지 아니한다.":{},
                        "14	기능통화가 초인플레이션 경제의 통화일 경우에는 기업회계기준서 제1029호 ‘초인플레이션 경제에서의 재무보고’에 따라 재무제표를 재작성한다. 이 기준서에 따라 결정되는 기능통화 이외의 다른 통화(예: 지배기업의 기능통화)를 기능통화로 채택하는 방법 등으로 기업회계기준서 제1029호에 따라 재무제표를 재작성하는 의무를 회피하여서는 아니된다.":{},
                },
                "해외사업장에 대한 순투자	 15~15A": {
                        "15	기업이 해외사업장으로부터 수취하거나 해외사업장에 지급할 화폐성항목 중에서 예측할 수 있는 미래에 결제할 계획이 없고 결제될 가능성이 낮은 항목은 실질적으로 그 해외사업장에 대한 순투자의 일부로 문단 32와 33에 따라 회계처리한다. 이러한 화폐성항목에는 장기 채권이나 대여금은 포함될 수 있으나 매출채권과 매입채무는 포함되지 아니한다.":{},
                        "15A	문단 15에서 언급한 해외사업장으로부터 수취하거나 해외사업장에 지급할 화폐성항목을 보유하는 기업은 연결실체의 어떤 종속기업이든 가능하다. 예를 들어 종속기업 A와 B를 소유한 기업이 있으며 종속기업 B는 해외사업장이다. 종속기업 A가 종속기업 B에게 자금을 대여하였으나 이 대여금이 예측할 수 있는 미래에 결제할 계획이 없고 결제될 가능성이 낮다면, 종속기업 A의 대여금은 종속기업 B에 대한 순투자의 일부가 된다. 종속기업 A가 해외사업장인 경우에도 이러한 관계는 똑같이 성립한다.":{},
                },
                "화폐성항목	16": {
                        "16	화폐성항목의 본질적 특징은 확정되었거나 결정가능할 수 있는 화폐단위의 수량으로 받을 권리나 지급할 의무라는 것이다. 예를 들어, 현금으로 지급하는 연금과 그 밖의 종업원급여, 현금으로 상환하는 충당부채, 부채로 인식하는 현금배당 등이 화폐성항목에 속한다. 또 수량이 확정되지 않은 기업자신의 지분상품이나 금액이 확정되지 않은 자산을 받거나 주기로 한 계약의 공정가치가 화폐단위로 확정되었거나 결정가능할 수 있다면 이러한 계약도 화폐성항목에 속한다. 한편, 비화폐성항목의 본질적 특징은 확정되었거나 결정가능할 수 있는 화폐단위의 수량으로 받을 권리나 지급할 의무가 없다는 것이다. 예를 들어, 재화와 용역에 대한 선급금(예: 선급임차료), 영업권, 무형자산, 재고자산, 유형자산, 비화폐성 자산의 인도에 의해 상환되는 충당부채 등이 비화폐성항목에 속한다.":{},
                },
        },
        "환산방법의 요약	17~19":{
                "17	재무제표를 작성할 때 기업(해외사업장이 없는 기업, 지배기업과 같은 해외사업장이 있는 기업이나 종속기업이나 지점과 같은 해외사업장을 모두 포함)은 문단 9~14에 따라 기능통화를 결정한다. 문단 20~37과 문단 50에 따라 외화항목을 기능통화로 환산하고 그 환산효과를 보고한다.":{},
                "18	많은 보고기업이 다수의 개별기업으로 구성된다(예: 연결실체는 지배기업과 하나 이상의 종속기업으로 구성). 연결실체를 구성하는 기업이 아니더라도 관계기업, 공동약정이나 지점이 있을 수 있다. 이러한 보고기업에 속해 있는 개별기업의 경영성과와 재무상태는 보고기업이 재무제표를 보고하는 통화로 환산한다. 보고기업은 어떤 통화든지 표시통화로 사용할 수 있다. 보고기업에 속해 있는 각 기업의 기능통화가 보고기업의 표시통화와 다른 경우에는 그 경영성과와 재무상태를 문단 38~50에 따라 표시통화로 환산한다.":{},
                "19	재무제표를 작성하는 해외사업장이 없는 기업이나 기업회계기준서 제1027호 ‘별도재무제표’에 따라 별도재무제표를 작성하는 기업도 재무제표를 어떤 통화로도 표시할 수 있다. 이러한 기업의 표시통화와 기능통화가 다른 경우에는 경영성과와 재무상태를 문단 38~50에 따라 표시통화로 환산한다.":{},
        },
        "기능통화에 의한 외화거래의 보고	20~37":{
                "최초 인식		20~22": {
                        "20	외화거래는 외화로 표시되어 있거나 외화로 결제되어야 하는 거래로서 다음을 포함한다.":{
                                "⑴	외화로 가격이 표시되어 있는 재화나 용역의 매매":{},
                                "⑵	지급하거나 수취할 금액이 외화로 표시된 자금의 차입이나 대여":{},
                                "⑶	외화로 표시된 자산의 취득이나 처분, 외화로 표시된 부채의 발생이나 상환":{},
                        },
                        "21	기능통화로 외화거래를 최초로 인식하는 경우에 거래일의 외화와 기능통화 사이의 현물환율을 외화금액에 적용하여 기록한다.":{},
                        "22	거래일은 한국채택국제회계기준에 따라 거래의 인식요건을 최초로 충족하는 날이다. 실무적으로는 거래일의 실제 환율에 근접한 환율을 자주 사용한다. 예를 들어, 일주일이나 한 달 동안 발생하는 모든 외화거래에 대하여 해당 기간의 평균환율을 사용할 수 있다. 그러나 환율이 유의적으로 변동된 경우에 해당기간의 평균환율을 사용하는 것은 부적절하다.":{},
                },
                "후속 보고기간말의 보고	23~26": {
                        "23	매 보고기간말의 외화환산방법은 다음과 같다.":{
                                "⑴	화폐성 외화항목은 마감환율로 환산한다.":{},
                                "⑵	역사적원가로 측정하는 비화폐성 외화항목은 거래일의 환율로 환산한다.":{},
                                "⑶	공정가치로 측정하는 비화폐성 외화항목은 공정가치가 측정된 날의 환율로 환산한다.":{},
                        },
                        "24	장부금액은 이 기준서 이외의 관련된 다른 한국채택국제회계기준서를 함께 고려하여 결정한다. 예를 들어, 유형자산은 기업회계기준서 제1016호 ‘유형자산’에 따라 공정가치나 역사적원가로 측정할 수 있다. 공정가치를 기준으로 결정하든 역사적원가를 기준으로 결정하든 장부금액이 외화로 결정된다면 이 기준서에 따라 기능통화로 환산한다.":{},
                        "25	둘 이상의 금액을 비교하여 장부금액이 결정되는 항목이 있다. 예를 들어, 재고자산의 장부금액은 기업회계기준서 제1002호 ‘재고자산’에 따라 취득원가와 순실현가능가치 중에서 작은 금액으로 한다. 또 손상을 시사하는 징후가 있는 자산의 장부금액은 기업회계기준서 제1036호 ‘자산손상’에 따라 잠재적 손상차손을 고려하기 전 장부금액과 회수가능액 중 작은 금액으로 한다. 이러한 자산이 비화폐성항목이고 외화로 측정되는 경우에는 다음의 두 가지를 비교하여 장부금액을 결정한다.":{
                                "⑴	그 금액이 결정된 날의 환율(즉, 역사적원가로 측정한 항목의 경우 거래일의 환율)로 적절하게 환산한 취득원가나 장부금액":{},
                                "⑵	그 가치가 결정된 날의 환율(예: 보고기간말의 마감환율)로 적절하게 환산한 순실현가능가치나 회수가능액":{},
                                "위 ⑴과 ⑵를 비교하는 경우 기능통화를 기준으로 할 때는 손상차손을 인식하나 외화를 기준으로 할 때는 손상차손을 인식하지 않을 수 있으며 반대의 경우도 나타날 수 있다.":{},
                        },
                        "26	여러 가지 환율을 사용할 수 있는 경우에는 해당 거래나 잔액에 따른 미래현금흐름이 측정일에 발생하였다면 결제하였을 환율을 사용한다. 일시적으로 두 통화의 교환이 불가능한 경우에는 그 이후에 처음으로 교환이 이루어지는 때의 환율을 사용한다.":{},
                },
                "외환차이의 인식	27~34": {
                        "27	문단 3⑴과 5에서 언급하고 있는 바와 같이 외화항목에 대한 위험회피회계는 기업회계기준서 제1109호를 적용한다. 위험회피회계를 적용하는 외환차이는 이 기준서의 외환차이 규정과 다르게 회계처리한다. 예를 들어, 현금흐름위험회피수단의 요건을 갖춘 화폐성항목에 대한 외환차이 중 위험회피에 효과적인 부분은 기업회계기준서 제1109호에 따라 처음부터 기타포괄손익으로 보고한다.": {},
                        "28	화폐성항목의 결제시점에 생기는 외환차이 또는 화폐성항목의 환산에 사용한 환율이 회계기간 중 최초로 인식한 시점이나 전기의 재무제표 환산시점의 환율과 다르기 때문에 생기는 외환차이는 그 외환차이가 생기는 회계기간의 손익으로 인식한다. 다만 문단 32에서 설명하는 별도의 자본항목으로 분류하는 외환차이에는 이를 적용하지 아니한다.": {},
                        "29	외화거래에서 화폐성항목이 생기고 거래일과 결제일의 환율이 변동된 경우에 외환차이가 나타난다. 거래가 발생한 회계기간에 결제되는 경우에는 모든 외환차이를 그 회계기간에 인식한다. 그러나 거래가 후속 회계기간에 결제되는 경우에는 각 회계기간의 환율변동에 따른 외환차이를 결제일까지 각 회계기간에 인식한다.": {},
                        "30	비화폐성항목에서 생긴 손익을 기타포괄손익으로 인식하는 경우에 그 손익에 포함된 환율변동효과도 기타포괄손익으로 인식한다. 그러나 비화폐성항목에서 생긴 손익을 당기손익으로 인식하는 경우에는 그 손익에 포함된 환율변동효과도 당기손익으로 인식한다.": {},
                        "31	이 기준서 이외의 다른 한국채택국제회계기준서에서 손익을 기타포괄손익으로 인식하는 경우가 있다. 예를 들어, 유형자산의 재평가에서 생기는 평가손익은 기업회계기준서 제1016호에 따라 기타포괄손익으로 인식한다. 이러한 자산이 외화로 측정된다면 문단 23⑶에 따라 그 가치가 결정된 날의 환율로 재평가금액을 환산하며 이때 생기는 외환차이도 기타포괄손익으로 인식한다.": {},
                        "32	보고기업의 해외사업장에 대한 순투자의 일부인 화폐성항목에서 생기는 외환차이(문단 15 참조)는 보고기업의 별도재무제표나 해외사업장의 개별재무제표에서 당기손익으로 적절하게 인식한다. 그러나 보고기업과 해외사업장을 포함하는 재무제표(예: 해외사업장이 종속기업인 경우의 연결재무제표)에서는 이러한 외환차이를 처음부터 기타포괄손익으로 인식하고 문단 48에 따라 관련 순투자의 처분시점에 자본에서 당기손익으로 재분류한다.": {},
                        "33	보고기업의 해외사업장에 대한 순투자의 일부인 화폐성항목이 보고기업의 기능통화로 표시되는 경우, 문단 28에 따라 해외사업장의 개별재무제표에 외환차이가 생긴다. 이러한 화폐성항목이 해외사업장의 기능통화로 표시되는 경우에는 문단 28에 따라 보고기업의 별도재무제표에 외환차이가 생긴다. 이러한 화폐성항목이 보고기업이나 해외사업장의 기능통화 이외의 다른 통화로 표시되는 경우에는 문단 28에 따라 보고기업의 별도재무제표와 해외사업장의 개별재무제표에 외환차이가 생긴다. 이러한 외환차이는 보고기업과 해외사업장을 포함하는 재무제표(즉, 연결재무제표 또는 지분법을 적용하여 작성한 재무제표)에서는 기타포괄손익으로 인식한다.": {},
                        "34	기능통화 이외의 다른 통화로 장부를 기록하는 경우에는 재무제표를 작성할 때 모든 금액을 문단 20~26에 따라 기능통화로 환산한다. 이렇게 하면 처음부터 장부를 기능통화로 기록하여 재무제표를 작성한 것과 같은 결과가 된다. 예를 들어, 화폐성항목은 마감환율을 사용하여 기능통화로 환산하며 역사적원가기준으로 측정한 비화폐성항목은 그 항목을 인식한 거래일의 환율을 사용하여 환산한다.": {},
                },
                "기능통화의 변경	35~37": {
                        "35	기능통화가 변경되는 경우에는 새로운 기능통화에 의한 환산절차를 변경한 날부터 전진적용한다.": {},
                        "36	문단 13에 언급하고 있는 바와 같이 기능통화는 기업과 관련된 실제 거래, 사건과 상황을 반영한다. 따라서 일단 기능통화가 결정되면 이러한 실제 거래, 사건과 상황에 변화가 일어난 경우에만 기능통화를 변경할 수 있다. 예를 들어, 재화나 용역의 공급가격에 주로 영향을 미치는 통화의 변경은 기능통화의 변경을 초래할 수 있다.": {},
                        "37	기능통화의 변경에 따른 효과는 전진적용하여 회계처리한다. 즉, 기능통화가 변경된 날의 환율을 사용하여 모든 항목을 새로운 기능통화로 환산한다. 비화폐성항목의 경우에는 새로운 기능통화로 환산한 금액이 역사적원가가 된다. 문단 32와 39⑶에 따라 이전에 기타포괄손익으로 인식한 해외사업장의 환산에서 생긴 외환차이는 해외사업장을 처분할 때 자본에서 당기손익으로 재분류한다.": {},
                },
        },
        "기능통화가 아닌 표시통화의 사용	38~49":{
                "표시통화로의 환산	38~43": {
                        "38	재무제표는 어떠한 통화로도 보고할 수 있다. 표시통화와 기능통화가 다른 경우에는 경영성과와 재무상태를 표시통화로 환산한다. 예를 들어, 서로 다른 기능통화를 사용하는 개별기업으로 구성되는 연결실체는 연결재무제표를 작성하기 위하여 각 기업의 경영성과와 재무상태를 같은 통화로 표시한다.": {},
                        "39	기능통화가 초인플레이션 경제의 통화가 아닌 경우 경영성과와 재무상태를 기능통화와 다른 표시통화로 환산하는 방법은 다음과 같다. ": {
                                "⑴	재무상태표(비교표시하는 재무상태표 포함)의 자산과 부채는 해당 보고기간말의 마감환율로 환산한다. ": {},
                                "⑵	포괄손익계산서(비교표시하는 포괄손익계산서 포함)의 수익과 비용은 해당 거래일의 환율로 환산한다.": {},
                                "⑶	위 ⑴과 ⑵의 환산에서 생기는 외환차이는 기타포괄손익으로 인식한다.": {},
                        },
                        "40	실무적으로 수익과 비용항목을 환산할 때 거래일의 환율에 근접한 환율(예: 해당 기간의 평균환율)을 자주 사용한다. 그러나 환율이 유의적으로 변동한 경우에는 일정기간의 평균환율을 사용하는 것은 부적절하다.": {},
                        "41	문단 39⑶에서 언급한 외환차이의 발생원인은 다음과 같다.": {
                                "⑴	수익과 비용은 해당 거래일의 환율로 환산하고 자산과 부채는 마감환율로 환산한다.": {},
                                "⑵	순자산의 기초 잔액을 전기의 마감환율과 다른 마감환율로 환산한다.": {},
                                "	이 환율의 변동은 현재와 미래의 영업현금흐름에 직접적으로 영향을 미치지 않거나 거의 미치지 않으므로 이러한 외환차이는 당기손익으로 인식하지 아니한다. 외환차이의 누계액은 해외사업장이 처분될 때까지 자본의 별도 항목으로 표시한다. 보고기업이 지분을 전부 소유하고 있지는 않지만 연결실체에 포함되는 해외사업장과 관련된 외환차이 중 비지배지분으로 인해 발생하는 외환차이의 누계액은 연결재무상태표의 비지배지분으로 배분하여 인식한다.":{},
                        },
                        "42	기능통화가 초인플레이션 경제의 통화인 경우 경영성과와 재무상태를 기능통화와 다른 표시통화로 환산하는 방법은 다음과 같다.": {
                                "⑴	모든 금액(즉, 자산, 부채, 자본항목, 수익과 비용. 비교표시되는 금액 포함)을 최근 재무상태표 일자의 마감환율로 환산한다.":{},
                                "⑵	다만, 금액을 초인플레이션이 아닌 경제의 통화로 환산하는 경우에 비교표시되는 금액은 전기에 보고한 재무제표의 금액(즉, 전기 이후의 물가수준변동효과나 환율변동효과를 반영하지 않은 금액)으로 한다.":{},
                        },
                        "43	기능통화가 초인플레이션 경제의 통화인 경우 문단 42의 환산방법을 적용하기 전에 기업회계기준서 제1029호에 따라 재무제표를 재작성한다. 다만, 초인플레이션이 아닌 경제의 통화로 환산하여 비교표시된 금액은 재작성하지 아니한다(문단 42⑵ 참조). 초인플레이션 상태에서 벗어나게 되어 기업회계기준서 제1029호에 따라 더 이상 재무제표를 재작성하지 않는 경우에는 재무제표의 재작성을 중지한 날의 물가수준으로 재작성한 금액을 표시통화로 환산하기 위한 역사적원가로 사용한다.": {},
                },
                "해외사업장의 환산	44~47": {
                        "44	해외사업을 연결 또는 지분법을 적용하여 보고기업의 재무제표에 포함되도록 하기 위하여 해외사업장의 경영성과와 재무상태를 표시통화로 환산하는 경우에는 문단 38~43과 문단 45~47을 적용한다.": {},
                        "45	보고기업과 해외사업장의 경영성과와 재무상태를 연결하는 경우 연결실체내 잔액 제거와 종속기업의 연결실체내 내부거래제거와 같은 정상적인 연결절차를 수행한다(기업회계기준서 제1110호 ‘연결재무제표’ 참조). 그러나 내부거래에서 생긴 화폐성자산(또는 화폐성부채)은 장단기 여부에 관계없이, 대응하는 화폐성부채(또는 화폐성자산)와 상계하더라도 관련된 환율변동효과는 연결재무제표에 나타나게 된다. 내부거래에서 생긴 화폐성항목도 특정 통화를 다른 통화로 교환하는 과정이 따르므로 환율변동으로 보고기업의 손익이 영향을 받기 때문이다. 따라서 이러한 외환차이는 연결재무제표에서 당기손익으로 인식한다. 다만, 문단 32의 상황에서 생기는 외환차이는 해외사업장이 처분될 때까지 기타포괄손익으로 인식하고 별도의 자본항목으로 누계한다.": {},
                        "46	해외사업장과 보고기업의 보고기간말이 다른 경우, 보고기업의 보고기간말 현재로 해외사업장의 재무제표를 추가로 작성하기도 한다. 그러나 기업회계기준서 제1110호에 따라 보고기간말의 차이가 3개월 이내이고 그 기간동안 있었던 유의적인 거래나 기타 사건의 영향을 반영한 경우에는 보고기업의 보고기간말이 아닌 해외사업장 보고기간말 현재의 재무제표를 사용할 수 있다. 이 경우 해외사업장의 자산과 부채는 해외사업장의 보고기간말 현재의 환율로 환산한다. 그리고 보고기업의 보고기간말까지 환율이 유의적으로 변동한 경우에는 기업회계기준서 제1110호에 따라 그 영향을 반영한다. 기업회계기준서 제1028호(2011년 개정)에 따라 관계기업이나 공동기업에 대하여 지분법을 적용하는 경우에도 같은 방법을 사용한다.": {},
                        "47	해외사업장의 취득으로 생기는 영업권과 자산․부채의 장부금액에 대한 공정가치 조정액은 해외사업장의 자산․부채로 본다. 따라서 이러한 영업권과 자산․부채의 장부금액에 대한 공정가치 조정액은 해외사업장의 기능통화로 표시하고 문단 39와 42에 따라 마감환율로 환산한다.": {},
                },
        },
        "해외사업장의 처분 또는 일부 처분	48~49":{
                "48	해외사업장을 처분하는 경우에는 기타포괄손익과 별도의 자본항목으로 인식한 해외사업장관련 외환차이의 누계액은 해외사업장의 처분손익을 인식하는 시점에 (재분류조정으로) 자본에서 당기손익으로 재분류한다(기업회계기준서 제1001호 ‘재무제표 표시’ 참조).": {},
                "48A	해외사업장에 대한 기업의 전체지분의 처분뿐만 아니라 다음의 부분적 처분의 경우에도 처분으로 회계처리한다. ": {
                        "⑴ 부분적 처분 후에도 이전 종속기업에 대한 비지배지분을 유지하는지에 상관없이, 부분적 처분으로 해외사업장을 포함한 종속기업에 대한 지배력을 상실하는 경우":{},
                        "⑵ 공동약정의 지분의 부분적 처분이나 해외사업장을 포함한 관계기업에 대한 지분의 부분적 처분 이후 보유하는 지분이 해외사업장을 포함하는 금융자산의 경우":{},
                },
                "48B	해외사업장을 포함한 종속기업의 처분시 비지배지분에 귀속되는 그 해외사업장과 관련된 외환차이의 누계액은 제거하지만, 당기손익으로 재분류하지는 않는다.": {},
                "48C	해외사업장을 포함한 종속기업을 일부 처분시 기타포괄손익에 인식된 외환차이의 누계액 중 비례적 지분을 그 해외사업장의 비지배지분으로 재귀속시킨다. 이 외의 경우에는 해외사업장을 일부 처분한 때에 기타포괄손익에 인식된 외환차이의 누계액 중 비례적 지분만을 당기손익으로 재분류한다.": {},
                "48D	해외사업장에 대한 지분의 일부 처분은, 처분으로 회계처리하는 문단 48A의 소유지분의 감소를 제외한, 해외사업장에 대한 소유지분의 모든 감소를 말한다.": {},
                "49	해외사업장의 매각, 청산, 자본의 환급 또는 해외사업장 전체나 일부를 포기하는 등의 방법으로 해외사업장에 대한 지분 전체나 일부를 처분할 수 있다. 해외사업장의 손실 또는 투자자가 인식한 손상으로 인한 해외사업장의 장부금액에 대한 감액의 인식은, 해외사업장의 일부를 처분하는 경우에는 해당하지 않는다. 따라서 기타포괄손익으로 인식된 외환손익은 감액을 인식한 시점에 손익으로 재분류하지 아니한다.": {},
        },
        "외환차이로 인한 법인세효과	50":{
                "50	외화거래에 따른 손익과 기업(해외사업장 포함)의 경영성과와 재무상태를 다른 통화로 환산함에 따라 생기는 외환차이로 법인세효과가 발생할 수 있다. 이러한 법인세효과는 기업회계기준서 제1012호 ‘법인세’를 적용한다.": {},
        },
        "공시			51~57":{
                "51	연결실체의 경우, 문단 53과 문단 55~57에서의 ‘기능통화’는 지배기업의 기능통화를 의미한다.": {},
                "52	다음 사항을 공시한다. ": {
                        "⑴	당기손익으로 인식한 외환차이 금액. 다만, 기업회계기준서 제1109호에 따라 당기손익-공정가치 측정 금융상품에서 생기는 외환차이는 제외한다.":{},
                        "⑵	기타포괄손익으로 인식하고 별도의 자본항목에 누계한 순외환차이, 기초와 기말 금액 및 그 변동 내역":{},
                },
                "53	표시통화와 기능통화가 다른 경우에는 그 사실을 기능통화의 명칭과 기능통화와 다른 표시통화를 사용하는 이유와 함께 공시한다.": {},
                "54	보고기업이나 유의적인 해외사업장의 기능통화가 변경된 경우에는 그 사실과 기능통화가 변경되는 이유를 공시한다.": {},
                "55	기능통화가 아닌 통화로 재무제표를 보고하는 경우에는 문단 39와 42의 환산방법을 포함하여 관련된 한국채택국제회계기준서 및 해석서의 요구사항을 모두 따른 경우에 한하여 한국채택국제회계기준에 따라 재무제표를 작성하였다는 사실을 기재한다.": {},
                "56	문단 55의 요구사항을 충족하지 않고 기능통화가 아닌 통화로 재무제표나 그 밖의 재무정보를 보고하는 경우가 있다. 예를 들어, 재무제표의 일부 항목만을 기능통화가 아닌 통화로 환산하거나 기능통화가 초인플레이션 경제의 통화가 아닌 기업이 재무제표의 모든 항목을 다른 통화의 최근의 마감환율로 환산할 수 있다. 그러나 이는 한국채택국제회계기준에 따른 환산이 아니므로 문단 57의 사항을 공시하여야 한다.": {},
                "57	재무제표나 그 밖의 재무정보를 기능통화나 표시통화와 다른 통화로 표시하고 문단 55의 요구사항을 충족하지 못하는 경우에는 다음의 사항을 공시한다.": {
                        "⑴	한국채택국제회계기준에 따른 정보와 구별되도록 해당 정보가 보충정보임을 명확하게 표시":{},
                        "⑵	보충정보를 표시하는 통화":{},
                        "⑶	기능통화의 명칭과 보충정보를 결정할 때 사용하는 환산방법":{},
                },
        },
        "시행일과 경과규정	58~60J":{
                "": {},
                "": {},
                "": {},
                "": {},
                "": {},
                "": {},
                "": {},
                "": {},
                "": {},
                "": {},
        },
        "기준서 등의 대체	61~62":{
                "": {},
                "": {},
        },
        "기업회계기준서 제1021호의 제정에 대한 회계기준위원회의 의결":{
                "": {},
        },
        "결론도출근거":{
                "": {},
                "": {},
                "": {},
        },
}