# -*- coding: utf-8 -*-
#Created on 2018-12-24 @author: 권달현
법인세추계결정_임대보증금={'...':{},}
법인세부동산임대주업법인차입금과다법인_임대보증금={

                "부동산임대업을 주업으로 하는 법인으로서 차입금이 일정기준을 초과하는 법인이 부동산 또는 부동산상의 권리를 대여하고 보증금을 받은 경우": {},
                "당해 보증금에 정기예금이자율(1.8%)을 곱한 금액이 임대사업 부문에서 발생한 수입이자 및 배당금 등의 합계액을 초과하는 경우에는 그 초과금액을 익금에 산입합니다. ": {},
                "※ 다만, 주택과 주택의 연면적, 주택정착면적의 5배(도시지역 밖의 토지는 10배) 중 넓은 면적 이내의 부속토지는 간주익금 계산대상에서 제외합니다. ": {},
                "조정에 필요한 내용 ": {},
                "(1) 간주익금의 계산대상법인": {

                    "① 부동산임대업을 주업으로 하는 법인(비영리법인 제외)일 것 ": {

                        "  법인의 사업연도 종료일 현재 자산총액중 임대사업에 사용된 자산가액이 50% 이상인 법인 중 - 임대사업에 사용된 자산중에는 주택임대에 공하는 자산가액을 포함합니다(법인 46012-2896, 1996.10.18.).": {},
                        "- 자산가액은 소득세법§99의 규정에 의한 기준시가에 의합니다.": {},
                        " 일부를 임대하고 있는 경우 ": {},
                        "= ": {},
                        "일부를 임대사업에 사용 하고 있는 자산의 가액 ": {},
                        "Ⅲ ": {},
                        "× ": {},
                        "임대사업에 사용하고 있는 부분의 면적 당해 건물의 연면적 ": {},
                        "☞ 자산의 일부를 임대사업에 사용하는 경우 임대부동산의 건설비상당액은 건설비총액을 임대면적 비율로 안분한 금액으로 합니다. ": {},

                        "－ ": {},
                    },
                    "② 차입금이 자기자본의 2배(적수기준)를 초과하는 법인일 것 ": {

                        "  사업연도 중 합병 분할, 증자 감자 등에 따라 자기자본의 변동이 있는 경우 당해 사업연도 개시일부터 자기자본 변동일 전일까지의 기간과 변동일부터 당해사업연도 종료일까지의 기간으로 나누어 계산한 자기자본의 적수를 합한 금액을 자기자본의 적수로 합니다. ": {},

                    },
                },
                "(2) 간주익금의 계산방법 ": {},
                "  임대보증금 등의 간주익금은 다음 산식에 의하여 계산하며 - 익금에 가산할 금액이 “0”보다 적은 때에는 이를 없는 것으로 봅니다. 이 경우 적수는 매월말 현재의 잔액에 경과일수를 곱하여 계산할 수 있습니다. ": {},
                "[ 당해 사업연도의 보증금 등의 적수 ": {},
                "임대용부동산의 건설비상당액의 적수 ": {},
                "] × ": {},
                "정기예금이자율 에서 365(윤년 366) ": {},
                "당해 사업연도의 임대사업부분에서 발생한 수입이자와 할인료 배당금 신주인수권처분익 및 유가증권처분익의 합계액 ": {},
                "을 차감한 금액 ": {},
                "  위 산식에서 “당해 사업연도의 보증금 등의 적수”는 - 당해 사업연도의 부동산 또는 부동산상의 권리를 대여하고 받는 보증금, 전세금 또는 이와 유사한 성질의 금액의 적수를 말하며, 부동산을 임차하여 전대하는 경우에 보증금 등의 적수는 전대보증금 등의 적수에서 임차보증금 등의 적수를 차감하여 계산합니다(조특규칙§59③).": {},
                "  간주익금에서 차감하는 수입이자에는 기간경과 미수이자도 포함됩니다.": {},
                "  “임대용부동산의 건설비상당액”이란 - 건축물의 취득가액(자본적지출액을 포함, 재평가차액 및 토지취득가액을 제외)으로 하고, 그 적수는 다음 산식에 의하여 계산합니다.": {},
                "㉠ 지하도를 건설하여 국유재산법 기타 법령에 의하여 국가 또는 지방자치단체에 기부채납하고 지하도로 점용허가(1차 무상점용허가기간에 한함)를 받아 이를 임대하는 경우 ": {

                    "지하도의 건설비 적수 총계 × ": {},
                    "임대면적의 적수 임대가능면적의 적수 ": {},
                },
                "㉡ “㉠” 이외의 임대부동산 ": {

                    "임대용 부동산의 건설비 적수 총계 × ": {},
                    "임대면적의 적수 건물연면적의 적수 ": {},
                    "Ⅲ ": {},
                    "☞ 1991.1.1 이후에 개시하는 사업연도 이전에 취득 건설한 임대용부동산은 다음  ⅰ,  ⅱ중 큰금액을 건설비상당액으로 합니다(일부 임대시는 임대면적비율로 안분함).": {},
                    " ⅰ 건축물의 취득가액(불분명한 경우는 기준시가에 의함)  ⅱ 건축물 연면적에 1990.12.31이 속하는 사업연도 종료일 현재의 단위면적당 임대보증금 (보증금÷임대면적)을 곱한 금액 ": {},
                    "  “유가증권처분익”이란(조특규칙§59 ⑤) - 유가증권의 매각익에서 매각손을 차감한 금액을 말하며, - 유가증권처분익의 합계액이 부수(－)인 때에는 “0”으로 합니다.": {},
                    "  정기예금이자율 ": {},
                    "’09 ’10 ’11 ’12 ’13 ’14 ’15 ’16 ’17 ": {},
                    "5% 4.3% 3.7% 4.0% 3.4% 2.9% 2.5% 1.8% 1.6% * ": {},
                    "* 2017.1.1. 이후 최초로 개시하는 사업연도분부터 적용 ": {},
                },
}
법인세={
        "법인세추계결정_임대보증금":법인세추계결정_임대보증금,
        "법인세부동산임대주업법인차입금과다법인_임대보증금(조특법§138) ":법인세부동산임대주업법인차입금과다법인_임대보증금,
}
#___________________________________________________
제목='간주익금'
_={
    #"지방소득세_법인세분 가산세": 지방소득세_법인세분,
    #"기업회계":기업회계,
    "법인세":법인세,
    #"조세특례제한법":조세특례제한법,
    #"증여세":증여세,
    #"상속세":상속세,
    #"양도소득세":양도소득세,
    #"농어촌특별세":{},
}
tax=_
import wx
class MyFrame(wx.Frame):
    def __init__(self):
        wx.Frame.__init__(self,parent=None,title=제목)
        self.SetSize(420,320*2)
        self.mainPanel=wx.Panel(self)
        self.expandButton=wx.Button(self.mainPanel,label='펼침')
        self.tree=wx.TreeCtrl(self.mainPanel)
        root=self.tree.AddRoot(제목)
        for i in tax:
            ii=self.tree.AppendItem(root,i)
            for j in tax[i]:
                jj=self.tree.AppendItem(ii,j)
                for k in tax[i][j]:
                    kk=self.tree.AppendItem(jj,k)
                    for m in tax[i][j][k]:
                        mm=self.tree.AppendItem(kk,m)
                        for n in tax[i][j][k][m]:
                            nn=self.tree.AppendItem(mm,n)
                            for p in tax[i][j][k][m][n]:
                                pp=self.tree.AppendItem(nn,p)
                                for q in tax[i][j][k][m][n][p]:
                                    qq=self.tree.AppendItem(pp,q)
                                    for r in tax[i][j][k][m][n][p][q]:
                                        rr=self.tree.AppendItem(qq,r)
        self.staticText =wx.TextCtrl(self.mainPanel,style=wx.TE_MULTILINE)

        self.vtBoxSizer=wx.BoxSizer(wx.VERTICAL)
        self.vtBoxSizer.Add(self.expandButton,0,wx.EXPAND|wx.ALL,5)
        self.vtBoxSizer.Add(self.tree        ,5,wx.EXPAND|wx.ALL,5)
        self.vtBoxSizer.Add(self.staticText  ,0,wx.EXPAND|wx.ALL,5)
        self.mainPanel.SetSizer(self.vtBoxSizer)
        self.Bind(wx.EVT_BUTTON          ,self.OnExpandButton,self.expandButton)
        self.Bind(wx.EVT_TREE_SEL_CHANGED,self.OnNodeSelected,self.tree)
    def OnExpandButton(self,e):
        self.tree.ExpandAll()
    def OnNodeSelected(self,e):
        selected=self.tree.GetSelection()
        self.staticText.SetLabel(self.tree.GetItemText(selected))
        #self.
        self.mainPanel.Layout()
if __name__=='__main__':
    app=wx.App()
    frame=MyFrame()
    frame.Show()
    app.MainLoop()
#___________________________________________________