# -*- coding: utf-8 -*-
#Created on 2018-11-8 @author: 권달현

양도소득세_2018년={
    '조정대상지역의 주택 거주기간 요건 추가':{},
    '양도소득세의 최고세율 조정': {},
    '지정(투기)지역의 주택중과': {},
    '조정대상지역의 다주택자 중과 세율 신설': {},
    '조정대상지역의 다주택자 장기보유특별공제 배제 확대': {},
    '조정대상지역의 주택분양권 세율 신설': {},
    '비사업용 토지의 최고세율 조정': {},
    '지정(투기)지역의 비사업용 토지 중과 세율 인상': {},
    '장기보유툭별공제액 연간 공제율 하향조정 및 적용기한 연장': {},
    '건물을 신축하여 환산취득가액 적용시 가산세 신설': {},# 10
    '명도비용의 필요경비 인정': {},
    '자본적 지출액 및 양도비의 증빙요건 합리화': {},
    '사전 증여주택에 대한 비과세 특례 적용 배제 신설': {},
    '동거봉양 합가시 비과세 특례 적용기간 확대': {},
    '1세대1주택 판정시 가정어립이집을 보유주택수에서 제외': {},
    '양도소득세 동일한 과세기간중 둘 이상의 자산을 양도하는 경우의 산출세액 계산방식 보완': {},
    '토지거래허가구역 해제 관련 신고기한 보완': {},
    '수용보상금 증액에 따른 추가신고나부의무 규정': {},
    '대주주 주식 양도소득세율 인상': {},
    '주식 대주주의 범위 확대': {}, # 20
    '소액주주의 주식교환,이전,주식매수청구권 행사시 양도소득세 비과세 신설': {},
    '협회장외시장을 통한 소액주주의 양도소득세 비과세 신설': {},
    '비상장주식 기준시가 평가방법 보완': {},
    '국외전출세 납부유예 규정 보완': {},
    '준공임대주택 양도소득세 감면 적용기한 연장': {},
    '영농자녀 증여세 감면 특례대상 확대 및 적용기한 연장': {},
    '자영한 어업용 토지 등에 대한 양도소득세 감면 신설': {},
    '자경산지에 대한 양도소득세의 감면 신설': {},
    '축사용지에대한 양도소득세 감면 합리화 및 적용기한 연장': {},
    '양도소득세 감면한도 일원화': {}, # 30
    '국가에 양도하는 산지에 대한 양도소득세 감면 적용기한 연장': {},
    '농어촌,고향주택에 대한 과세특례 적요기한 연장': {},
    '개발제한구역내 토지 등의 감면 적용기한 연장': {},
    '벤처기업 등 출자에 대한 과세특례 적용기한 연장': {},
    '임대주택 부동산투자회사에 대한 과세특례 적용기한 종료': {},
    '기업간 주식교환에 대한 과세특례 적용기한 종료': {},
    '주택임대소득 사업자 감면요건 완화': {},
    '중소기업 최대주주 등 주식의 할증평가 배제 적용기한 연장': {},
    '거주자 판정 기준 합리화': {},
    '공유물 양도시 납세의무자 명확화': {}, # 40
    '상속세,증여세 신고세액공제 축소': {},
    '가업상속공제 요건(공제한도 조정) 등 보완': {},
    '하나의 감정기관 감정가액 인정': {},
    '법인세 최고 과표구간 신설 및 세율 환원': {},
    '부동산 임대보증금의 이자율': {},
    '부동산 임대소득의 부당행위계산부인': {},
    '상속증여세의 연부연납가산금 1.8%로': {},
}
양도소득세={
    '2018년':양도소득세_2018년,
            }
부가가치세_2018년={}
부가가치세={
    '부가가치세개정세법 2018년':부가가치세_2018년,
}