# -*- coding: utf-8 -*-
#Created on 2018-12-24 @author: 권달현
기업회계={
        "의의":{},
        "차입원가 자본화 처리방법":{},
        "차입원가 자본화 계산대상":{},
        "차입원가 자본화 기간":{},
        "자본화대상 차입원가":{},
        "차입원가 자본화 계산방법":{},
        }
법인세={
        "건설자금이자의 자본화":{
                "특정차입금의 지급이자 등은 자본화 강제":{},
                "일반차입금의 지급이자 등은 자본화 선택":{},
                },
        "건설자금이자의 계산대상":{},
        "건설자금이자의 계산기간":{},
        "건설자금이자 계산 대상 차입금 등":{},
        "건설자금이자의 세무조정":{
                "건설자금이자 과소계상액의 세무조정":{},
                "건설자금이자 과대계상액의 세무조정":{},
                },
        }