# -*- coding: utf-8 -*-
# 2018-12-24 권달현
법인세={
    '계산서 교부의무 면제':{},
    '계산서 교부 및 합계표 미제출 관련 주요 사례':{
        '계산서 교부 관련':{},
        '매출매입처별 계산서합계표 제출 관련':{},
    },
    "국세청":{
            "  법인이 재화 또는 용역을 공급하는 경우에는 계산서를 작성하여 공급받는 자에게 교부하여야 하고(법법§121)": {},
            "- 법인이 사업연도 중 교부하였거나 교부받은 매출 매입처별계산서 합계표를 다음연도 2월 10일까지 제출하여야 함(법령§164). ": {},
            "☞ 2012.2.2. 이후 제출분부터는 2.10까지 제출": {},
            "* 부가가치세법에 의한 세금계산서 및 세금계산서합계표를 작성, 제출한 경우 계산서 및계산서합계표를 작성, 제출한 것으로 봄(법법§121⑥). ": {},
            "  한편, 농 축 수산물 및 임산물의 위탁판매 또는 대리인에 의한 판매의 경우에는 수탁자 또는 대리인이 계산서의 교부의무를 지게 됩니다.": {},
            "  수입재화에 대하여는 세관장이 계산서를 교부하여야 합니다.": {},
            "  법인이 계산서를 교부하지 않거나 매출 매입처별 계산서 합계표를 제출하지 아니한 경우에는 - 계산서 미발급, 가공 및 위장 수수한 경우 2%, 그 외는 공급가액의 1%(합계표의 경우 제출기한 경과 후 1월 이내 제출시에는 0.5%)를 가산세로서 납부하여야 합니다. ": {},
            "* 법인세 산출세액이 없는 경우에도 적용됨.": {},
            "* 세관장으로부터 계산서를 교부받은 법인은 2006.1.1.이후 개시사업연도분부터 매입처별계산서 합계표 제출의무 없음. ": {},
            "  법인사업자 및 개인사업자는 ’15.7.1. 이후 재화 용역 공급분(가산세는 ’16.1.1.": {},
            "이후 재화 용역 공급분부터 적용)부터 전자계산서 발급을 의무화(법법§76⑨, §121)": {},
            "- (대상자) 법인사업자 및 개인사업자 중 연간 공급가액 3억원 이상자로서 면세사업 겸업자, 직전 직전연도 수입금액이 일정금액(예：10억원) 이상인 자 ": {},
            "- (가산세)  전자계산서 미발급 가산세：공급가액의 2% 다만, (종이)계산서를 발급한 경우는 공급가액의 1%  지연(미)전송 가산세：공급가액 × 가산세율 ": {},
            "가산세율(%) ’16 ’17 ’18 ’19 ": {},
            "지연 전송 ": {},
            "법인, 개인겸업자 0.1 0.5 0.5 0.5": {},
            "일정규모 이상 개인 - 0.1 0.1 0.5 ": {},
            "미전송 ": {},
            "법인, 개인겸업자 0.3 1 1 1": {},
            "일정규모 이상 개인 - 0.3 0.3 1 ": {},
            "가. 계산서 교부의무 면제 (소득세법시행령§211②) ": {
                "  부동산(토지 및 건축물)을 공급하는 경우": {},
                "  부가가치세법시행령§79의2 제1항 및 제2항 규정에 의한 영수증 교부대상으로 규정된 사업": {},
                "  주로 사업자가 아닌 소비자에게 재화 또는 용역을 공급하는 다음의 사업(소법규칙§96의2) - 금융 및 보험업, 사업시설관리 및 사업지원서비스업, 교육서비스업 - 보건업 및 사회복지서비스업, 예술 스포츠 및 여가 관련 서비스업 - 협회 및 단체, 수리 및 기타 개인서비스업, 가구내 고용활동에서 발생하는 소득 - 위와 유사한 사업으로서 계산서 발급이 불가능하거나 현저히 곤란한 사업 ": {},
                "* 계산서 교부의무가 면제되어 영수증을 교부할 수 있는 경우에도 공급받는 자가 사업자등록증을 제시하고 계산서 교부를 요구하는 경우에는 계산서를 교부하여야 함. ": {},
            },
            "나. 계산서 교부 및 합계표 미제출 관련 주요 사례 ": {
                "(1) 계산서 교부 관련 ": {
                    "  다음에 해당하는 재화 또는 용역의 공급에 대하여는 법§121의 규정에 의한 계산서 교부의무 없음(통칙76-120…4).": {},
                    "- 법인의 본지점간 재화의 이동 - 사업을 포괄적으로 양도하는 경우 - 상품권 등 유가증권을 매매하는 경우(상품권 매매업자 포함)": {},
                    "  지점에서 공급받은 재화를 본점에서 계약체결 및 대금지급하는 경우 본점과 지점 등 2 이상의 사업장이 있는 사업자가 계약 발주 대금지급 등의 거래는 당해 본점에서 이루어지고 용역은 지점에서 공급받는 경우 세금계산서는 본점 또는 지점 어느 쪽에서도 교부받을 수 있는 것임(법인세과-1574, 2008.07.15.)(서면3팀-71, 2005.01.14.).": {},
                    "  국외에서 인도하는 재화의 공급거래분 계산서 교부 국내사업자(A)가 국외사업자(Z)에게 공급할 목적으로 국내사업자(B)와의 계약에 의거 물품을 공급받기로 하고 “B”는 당해 물품을 국외사업자 (Y)로부터 구매하여 국내에 반입하지 아니하고 “A”가 지정하는 “Z”에게 인도하는 경우로서 “B”가 국외에서 인도하는 재화의 공급거래에 대하여  소득세법  제163조 및 같은 법 시행령 제211조에 따라 계산서를 작성 교부하여야 하는 것임 (서면1팀-528, 2008.04.15.).": {},
                    "  토지 등의 계산서 교부 제외대상 토지 및 건축물은 고정자산 뿐만 아니라 재고자산도 포함되는 것이며, 부가가치세법 시행령 제21조 제1항 제4호에 의한 중간지급조건부로 토지 등을 공급하는 경우에는 2002.1.1 이후 대가의 각 부분을 받기로 한 때가 도래하는 분부터 계산서교부대상에서 제외됨(법인46012-475, 2002.8.29.). ": {},
                },
                "(2) 매출   매입처별 계산서합계표 제출 관련 ": {},
                "  가공계산서를 수수하고 합계표를 제출한 경우 - 재화의 공급 없이 가공으로 계산서를 교부하고 매출처별 합계표를 작성하여 제출한 경우에는 매출처별합계표 기재 불성실 가산세가 부과되며 - 당해 계산서를 교부받은 후 매입처별계산서합계표를 기재하여 제출한 법인에 대하여도 동일하게 적용됨(통칙 76-120…1).": {},
                "  재화 또는 용역을 공급받고 계산서를 교부받지 못한 경우 법인이 재화 또는 용역을 공급받고 계산서를 교부받지 못하여 매입처별 계산서 합계표를 제출하지 아니한 경우 합계표 미제출 가산세 적용대상 아님(통칙76-120…3).": {},
                "  지점 수수분 계산서를 본점 사업자등록번호로 일괄 제출한 경우 지점에서 교부하였거나 교부받은 계산서에 대하여 본점 사업자 등록번호로 매출 매입처별 계산서 합계표를 합산하여 일괄 제출한 경우에도 적정한 합계표 제출로 보아 가산세를 부과하지 아니함(재경부 법인46012-181, 2001.10.17.)": {},
                "  세금계산서 교부대상을 계산서로 교부한 경우 부가가치세 과세대상 재화를 공급하면서 착오로 세금계산서를 교부하지 않고 계산서를 교부한 경우 부가가치세법에 의하여 세금계산서 불성실 가산세가 부과되는 부분에 대하여는 계산서 기재 불성실 가산세를 적용하지 않으나그 계산서를 교부받은 자가 합계표를 제출하지 아니한 경우에는 계산서합계표 미제출 가산세가 적용됨(통칙76-120…2).": {},
                "  계산서 교부대상을 세금계산서로 교부한 경우 법인이 부가가치세가 면제되는 용역을 공급하면서 계산서를 교부하여야 하나 착오로 세금계산서를 교부한 경우에는  법인세법  제76조 제9항의 규정에 의한 가산세가 적용되는 것임(법인세과-303, 2009.3.20.). ": {},
            },
        },
}


#___________________________________________________
제목='계산서교부및계산서합계표제출'
_={
    #"지방소득세_법인세분 가산세": 지방소득세_법인세분,
    #"기업회계":기업회계,
    "법인세":법인세,
    #"조세특례제한법":조세특례제한법,
    #"증여세":증여세,
    #"상속세":상속세,
    #"양도소득세":양도소득세,
    #"농어촌특별세":{},
}
tax=_
import wx
class MyFrame(wx.Frame):
    def __init__(self):
        wx.Frame.__init__(self,parent=None,title=제목)
        self.SetSize(420,320*2)
        self.mainPanel=wx.Panel(self)
        self.expandButton=wx.Button(self.mainPanel,label='펼침')
        self.tree=wx.TreeCtrl(self.mainPanel)
        root=self.tree.AddRoot(제목)
        for i in tax:
            ii=self.tree.AppendItem(root,i)
            for j in tax[i]:
                jj=self.tree.AppendItem(ii,j)
                for k in tax[i][j]:
                    kk=self.tree.AppendItem(jj,k)
                    for m in tax[i][j][k]:
                        mm=self.tree.AppendItem(kk,m)
                        for n in tax[i][j][k][m]:
                            nn=self.tree.AppendItem(mm,n)
                            for p in tax[i][j][k][m][n]:
                                pp=self.tree.AppendItem(nn,p)
                                for q in tax[i][j][k][m][n][p]:
                                    qq=self.tree.AppendItem(pp,q)
                                    for r in tax[i][j][k][m][n][p][q]:
                                        rr=self.tree.AppendItem(qq,r)
        self.staticText =wx.TextCtrl(self.mainPanel,style=wx.TE_MULTILINE)

        self.vtBoxSizer=wx.BoxSizer(wx.VERTICAL)
        self.vtBoxSizer.Add(self.expandButton,0,wx.EXPAND|wx.ALL,5)
        self.vtBoxSizer.Add(self.tree        ,5,wx.EXPAND|wx.ALL,5)
        self.vtBoxSizer.Add(self.staticText  ,0,wx.EXPAND|wx.ALL,5)
        self.mainPanel.SetSizer(self.vtBoxSizer)
        self.Bind(wx.EVT_BUTTON          ,self.OnExpandButton,self.expandButton)
        self.Bind(wx.EVT_TREE_SEL_CHANGED,self.OnNodeSelected,self.tree)
    def OnExpandButton(self,e):
        self.tree.ExpandAll()
    def OnNodeSelected(self,e):
        selected=self.tree.GetSelection()
        self.staticText.SetLabel(self.tree.GetItemText(selected))
        #self.
        self.mainPanel.Layout()
if __name__=='__main__':
    app=wx.App()
    frame=MyFrame()
    frame.Show()
    app.MainLoop()
#___________________________________________________