# -*- coding: utf-8 -*-
#Created on 2019년 @author: 권달현
from 공인회계사법 import *
import 공인회계사법시행령,공인회계사법시행규칙

공인회계사법시행령.제1조["    공인회계사법시행규칙 "+공인회계사법시행규칙.제1조_]=공인회계사법시행규칙.제1조
공인회계사법시행령.제7조["    공인회계사법시행규칙 "+공인회계사법시행규칙.제2조_]=공인회계사법시행규칙.제2조
공인회계사법시행령.제2_02조3항["    공인회계사법시행규칙 "+공인회계사법시행규칙.제2_02조_]=공인회계사법시행규칙.제2_02조
공인회계사법시행령.제10조1항["    공인회계사법시행규칙 "+공인회계사법시행규칙.제5조_]=공인회계사법시행규칙.제5조
공인회계사법시행령.제10조2항["    공인회계사법시행규칙 "+공인회계사법시행규칙.제6조_]=공인회계사법시행규칙.제6조
공인회계사법시행령.제10조2항["    공인회계사법시행규칙 "+공인회계사법시행규칙.제7조_]=공인회계사법시행규칙.제7조
공인회계사법시행령.제10조3항["    공인회계사법시행규칙 "+공인회계사법시행규칙.제8조_]=공인회계사법시행규칙.제8조
공인회계사법시행령.제11조2항["    공인회계사법시행규칙 "+공인회계사법시행규칙.제9조_]=공인회계사법시행규칙.제9조
제26조4항["    공인회계사법시행규칙 "+공인회계사법시행규칙.제11조_]=공인회계사법시행규칙.제11조
공인회계사법시행령.제15조1항["    공인회계사법시행규칙 "+공인회계사법시행규칙.제12조_]=공인회계사법시행규칙.제12조
공인회계사법시행령.제15조2항["    공인회계사법시행규칙 "+공인회계사법시행규칙.제13조_]=공인회계사법시행규칙.제13조
제37조2항["    공인회계사법시행규칙 "+공인회계사법시행규칙.제14조_]=공인회계사법시행규칙.제14조
제38조["    공인회계사법시행규칙 "+공인회계사법시행규칙.제14조_]=공인회계사법시행규칙.제14조
공인회계사법시행령.제33조1항["    공인회계사법시행규칙 "+공인회계사법시행규칙.제15조_]=공인회계사법시행규칙.제15조
공인회계사법시행령.제37조1항["    공인회계사법시행규칙 "+공인회계사법시행규칙.제16조_]=공인회계사법시행규칙.제16조
공인회계사법시행령.제23_02조1항["    공인회계사법시행규칙 "+공인회계사법시행규칙.제16_02조_]=공인회계사법시행규칙.제16_02조
제40_04조3항["    공인회계사법시행규칙 "+공인회계사법시행규칙.제16_03조_]=공인회계사법시행규칙.제16_03조
제40_04조3항["    공인회계사법시행규칙 "+공인회계사법시행규칙.제16_04조_]=공인회계사법시행규칙.제16_04조
공인회계사법시행령.제23_03조["    공인회계사법시행규칙 "+공인회계사법시행규칙.제16_05조_]=공인회계사법시행규칙.제16_05조
공인회계사법시행령.제23_02조2항["    공인회계사법시행규칙 "+공인회계사법시행규칙.제16_06조_]=공인회계사법시행규칙.제16_06조
공인회계사법시행령.제23_04조["    공인회계사법시행규칙 "+공인회계사법시행규칙.제16_07조_]=공인회계사법시행규칙.제16_07조
제40_07조3항["    공인회계사법시행규칙 "+공인회계사법시행규칙.제16_08조_]=공인회계사법시행규칙.제16_08조
제40_07조3항["    공인회계사법시행규칙 "+공인회계사법시행규칙.제16_09조_]=공인회계사법시행규칙.제16_09조
제40_13조1항["    공인회계사법시행규칙 "+공인회계사법시행규칙.제16_08조_]=공인회계사법시행규칙.제16_10조
공인회계사법시행령.제40조3항["    공인회계사법시행규칙 "+공인회계사법시행규칙.제17조_]=공인회계사법시행규칙.제17조




제1조["  공인회계사법시행령 "+공인회계사법시행령.제1조_]=공인회계사법시행령.제1조
제5조2항["  공인회계사법시행령 "+공인회계사법시행령.제2조_]=공인회계사법시행령.제2조
제5조4항["  공인회계사법시행령 "+공인회계사법시행령.제2_02조1항_]=공인회계사법시행령.제2_02조
제5조4항["  공인회계사법시행령 "+공인회계사법시행령.제2_02조2항_]=공인회계사법시행령.제2_02조
제5조["  공인회계사법시행령 "+공인회계사법시행령.제2조_]=공인회계사법시행령.제2조
제5조["  공인회계사법시행령 "+공인회계사법시행령.제2_02조_]=공인회계사법시행령.제2_02조
제5조["  공인회계사법시행령 "+공인회계사법시행령.제3조_]=공인회계사법시행령.제3조
제5조["  공인회계사법시행령 "+공인회계사법시행령.제5조_]=공인회계사법시행령.제5조
제5조["  공인회계사법시행령 "+공인회계사법시행령.제6조_]=공인회계사법시행령.제6조
제5조["  공인회계사법시행령 "+공인회계사법시행령.제6_02조_]=공인회계사법시행령.제6_02조
제5조["  공인회계사법시행령 "+공인회계사법시행령.제7조_]=공인회계사법시행령.제7조
제5조["  공인회계사법시행령 "+공인회계사법시행령.제8조_]=공인회계사법시행령.제8조
제5조["    공인회계사법시행규칙 "+공인회계사법시행규칙.제2조_]=공인회계사법시행규칙.제2조
제5조["    공인회계사법시행규칙 "+공인회계사법시행규칙.제3조_]=공인회계사법시행규칙.제3조
제5조["    공인회계사법시행규칙 "+공인회계사법시행규칙.제4조_]=공인회계사법시행규칙.제4조

제6조1항3호["  공인회계사법시행령 "+공인회계사법시행령.제4조1항_]=공인회계사법시행령.제4조1항
제6조1항3호["  공인회계사법시행령 "+공인회계사법시행령.제4조2항_]=공인회계사법시행령.제4조2항
제6조1항5호["  공인회계사법시행령 "+공인회계사법시행령.제4조4항_]=공인회계사법시행령.제4조4항
제6조["  공인회계사법시행령 "+공인회계사법시행령.제4조_]=공인회계사법시행령.제4조
제6_02조["  공인회계사법시행령 "+공인회계사법시행령.제9_02조_]=공인회계사법시행령.제9_02조
제6_02조["  공인회계사법시행령 "+공인회계사법시행령.제9_03조_]=공인회계사법시행령.제9_03조
제7조1항["  공인회계사법시행령 "+공인회계사법시행령.제10조_]=공인회계사법시행령.제10조
제7조4항["  공인회계사법시행령 "+공인회계사법시행령.제11조_]=공인회계사법시행령.제11조
제7조1항["  공인회계사법시행령 "+공인회계사법시행령.제12조_]=공인회계사법시행령.제12조
제7조["  공인회계사법시행령 "+공인회계사법시행령.제13조_]=공인회계사법시행령.제13조
제21조1항3호["  공인회계사법시행령 "+공인회계사법시행령.제14조1항_]=공인회계사법시행령.제14조1항
제21조3항["  공인회계사법시행령 "+공인회계사법시행령.제14조4항_]=공인회계사법시행령.제14조4항
제21조["  공인회계사법시행령 "+공인회계사법시행령.제14조_]=공인회계사법시행령.제14조
제24조1항["  공인회계사법시행령 "+공인회계사법시행령.제15조_]=공인회계사법시행령.제15조
제33조1항3호["  공인회계사법시행령 "+공인회계사법시행령.제15_02조1항_]=공인회계사법시행령.제15_02조1항
공인회계사법시행령.제15_02조["  공인회계사법시행령 "+공인회계사법시행령.제14조_]=공인회계사법시행령.제14조
제33조["  공인회계사법시행령 "+공인회계사법시행령.제15_02조_]=공인회계사법시행령.제15_02조
제27조2항["  공인회계사법시행령 "+공인회계사법시행령.제19조_]=공인회계사법시행령.제19조
제28조1항["  공인회계사법시행령 "+공인회계사법시행령.제20조_]=공인회계사법시행령.제20조
제29조1항["  공인회계사법시행령 "+공인회계사법시행령.제21조_]=공인회계사법시행령.제21조
제32조1항["  공인회계사법시행령 "+공인회계사법시행령.제22조_]=공인회계사법시행령.제22조
제37조3항["  공인회계사법시행령 "+공인회계사법시행령.제23조_]=공인회계사법시행령.제23조
제40_04조1항["  공인회계사법시행령 "+공인회계사법시행령.제23_02조_]=공인회계사법시행령.제23_02조
제40_04조5항["  공인회계사법시행령 "+공인회계사법시행령.제23_03조_]=공인회계사법시행령.제23_03조
제40_07조1항["  공인회계사법시행령 "+공인회계사법시행령.제23_04조_]=공인회계사법시행령.제23_04조
제41조["  공인회계사법시행령 "+공인회계사법시행령.제24조_]=공인회계사법시행령.제24조
제41조["  공인회계사법시행령 "+공인회계사법시행령.제25조_]=공인회계사법시행령.제25조
제41조["  공인회계사법시행령 "+공인회계사법시행령.제26조_]=공인회계사법시행령.제26조
제45조2항["  공인회계사법시행령 "+공인회계사법시행령.제27조_]=공인회계사법시행령.제27조
제45조1항["  공인회계사법시행령 "+공인회계사법시행령.제28조_]=공인회계사법시행령.제28조
제45조1항["  공인회계사법시행령 "+공인회계사법시행령.제29조_]=공인회계사법시행령.제29조
제48조["  공인회계사법시행령 "+공인회계사법시행령.제30조_]=공인회계사법시행령.제30조
제48조["  공인회계사법시행령 "+공인회계사법시행령.제31조_]=공인회계사법시행령.제31조
제48조["  공인회계사법시행령 "+공인회계사법시행령.제32조_]=공인회계사법시행령.제32조
제48조["  공인회계사법시행령 "+공인회계사법시행령.제33조_]=공인회계사법시행령.제33조
제48조["  공인회계사법시행령 "+공인회계사법시행령.제34조_]=공인회계사법시행령.제34조
제48조["  공인회계사법시행령 "+공인회계사법시행령.제35조_]=공인회계사법시행령.제35조
제48조["  공인회계사법시행령 "+공인회계사법시행령.제36조_]=공인회계사법시행령.제36조
제48조["  공인회계사법시행령 "+공인회계사법시행령.제37조_]=공인회계사법시행령.제37조
제48_02조1항["  공인회계사법시행령 "+공인회계사법시행령.제37_02조_]=공인회계사법시행령.제37_02조
제48_02조3항["  공인회계사법시행령 "+공인회계사법시행령.제37_03조_]=공인회계사법시행령.제37_03조
제52조1항["  공인회계사법시행령 "+공인회계사법시행령.제38조_]=공인회계사법시행령.제38조
제52_02조["  공인회계사법시행령 "+공인회계사법시행령.제39조_]=공인회계사법시행령.제39조
제52_04조["  공인회계사법시행령 "+공인회계사법시행령.제40조_]=공인회계사법시행령.제40조
제52_05조1항["  공인회계사법시행령 "+공인회계사법시행령.제41조_]=공인회계사법시행령.제41조
제52_05조2항["  공인회계사법시행령 "+공인회계사법시행령.제42조_]=공인회계사법시행령.제42조
제52_05조3항["  공인회계사법시행령 "+공인회계사법시행령.제43조_]=공인회계사법시행령.제43조



import wx
class MyFrame(wx.Frame):
    def __init__(self):
        wx.Frame.__init__(self, parent=None, title=bubname)
        self.SetSize(620, 520)
        self.mainPanel = wx.Panel(self)
        self.expandButton = wx.Button(self.mainPanel, label=bubname)
        self.tree = wx.TreeCtrl(self.mainPanel)
        root = self.tree.AddRoot(bubname)
        for i in bub:
            ii = self.tree.AppendItem(root, i)
            for j in bub[i]:
                jj = self.tree.AppendItem(ii, j)
                for k in bub[i][j]:
                    kk = self.tree.AppendItem(jj, k)
                    for m in bub[i][j][k]:
                        mm = self.tree.AppendItem(kk, m)
                        for n in bub[i][j][k][m]:
                            nn = self.tree.AppendItem(mm, n)
                            for p in bub[i][j][k][m][n]:
                                pp = self.tree.AppendItem(nn, p)
                                for q in bub[i][j][k][m][n][p]:
                                    qq = self.tree.AppendItem(pp, q)
                                    for r in bub[i][j][k][m][n][p][q]:
                                        rr = self.tree.AppendItem(qq, r)
                                        for s in bub[i][j][k][m][n][p][q][r]:
                                            ss = self.tree.AppendItem(rr, s)
                                            for t in bub[i][j][k][m][n][p][q][r][s]:
                                                tt = self.tree.AppendItem(ss, t)
                                                for u in bub[i][j][k][m][n][p][q][r][s][t]:
                                                    uu = self.tree.AppendItem(tt, u)
                                                    for v in bub[i][j][k][m][n][p][q][r][s][t][u]:
                                                        vv = self.tree.AppendItem(uu, v)
        self.staticText = wx.TextCtrl(self.mainPanel, style=wx.TE_MULTILINE)
        self.vtBoxSizer = wx.BoxSizer(wx.VERTICAL)
        self.vtBoxSizer.Add(self.expandButton, 0, wx.EXPAND | wx.ALL, 5)
        self.vtBoxSizer.Add(self.tree, 5, wx.EXPAND | wx.ALL, 5)
        self.vtBoxSizer.Add(self.staticText, 0, wx.EXPAND | wx.ALL, 5)
        self.mainPanel.SetSizer(self.vtBoxSizer)
        self.Bind(wx.EVT_BUTTON, self.OnExpandButton, self.expandButton)
        self.Bind(wx.EVT_TREE_SEL_CHANGED, self.OnNodeSelected, self.tree)
        self.Bind(wx.EVT_CLOSE, self.OnClose)

    def OnExpandButton(self, e):
        self.tree.ExpandAll()

    def __del__(self):
        print('소멸합니다.')

    def OnClose(self, event):
        frame.Destroy()

    def OnNodeSelected(self, e):
        selected = self.tree.GetSelection()
        self.staticText.SetLabel(self.tree.GetItemText(selected))
        self.mainPanel.Layout()
if __name__ == '__main__':
    app = wx.App(redirect=True)
    frame = MyFrame()
    wnd = wx.Frame(None, wx.ID_ANY, "")
    wnd.CenterOnScreen()
    app.SetTopWindow(wnd)
    frame.Show()
    app.MainLoop()
