# -*- coding: utf-8 -*-
#Created on 2019년 @author: 권달현
조={};서문={};조문={};부칙 = {};bubname='공인회계사법시행규칙'
편=장=절=관=항=조={} 
서문['']={}
서문['공인회계사법 시행규']={}
서문['[시행 2016. 4. 18] [총리령 제1269호, 2016. 4. 18, 일부개정']={}
서문['금융위원회(공정시장과) 02-2100-268']={}
제1조_=' 제1조 (목적) '
제1조={}
제1조['공인회계사법시행규칙 제1조 (목적)']={}
조문['제1조 (목적)']=제1조
조['제1조 (목적)']=제1조
제1조1항_='이 규칙은 「공인회계사법」 및 「공인회계사법 시행령」에서 위임된 사항과 그 시행에 관하여 필요한 사항을 규정함을 목적으로 한다. <개정 2006. 3. 10.>'
제1조1항={}
제1조[제1조1항_]=제1조1항
제2조_=' 제2조 (응시원서 및 응시수수료) '
제2조={}
제2조['공인회계사법시행규칙 제2조 (응시원서 및 응시수수료)']={}
조문['제2조 (응시원서 및 응시수수료)']=제2조
조['제2조 (응시원서 및 응시수수료)']=제2조
제2조1항_='①「공인회계사법」(이하 "법"이라 한다) 제5조의 규정에 의한 공인회계사시험에 응시하고자 하는 자(이하 "응시자"라 한다)는 「공인회계사법 시행령」(이하 "영"이라 한다) 제6조의 규정에 의한 시험위원회(이하 "시험위원회"라 한다)의 위원장(이하 "위원장"이라 한다)이 정하는 응시원서와 다음 각 호의 서류를 위원장에게 제출하여야 한다. <개정 2004. 4. 1., 2006. 3. 10.>'
제2조1항={}
제2조[제2조1항_]=제2조1항
제2조1항1호_='1. 영 제2조제4항의 규정에 의한 성적표 1부(제1차시험에 한한다. 이하 같다)'
제2조1항1호={}
제2조1항[제2조1항1호_]=제2조1항1호
제2조1항2호_='2. 영 제2조의2제4항의 규정에 의한 응시자격을 소명하는 서류 1부'
제2조1항2호={}
제2조1항[제2조1항2호_]=제2조1항2호
제2조2항_='②법 제6조제1항의 규정에 따라 제1차시험을 면제받고자 하는 자는 다음 각 호의 서류를 위원장에게 제출하여야 한다. <신설 2004. 4. 1., 2006. 3. 10.>'
제2조2항={}
제2조[제2조2항_]=제2조2항
제2조2항1호_='1. 경력증명서 1부'
제2조2항1호={}
제2조2항[제2조2항1호_]=제2조2항1호
제2조2항2호_='2. 소속기관의 직제 및 사무분장규정 1부'
제2조2항2호={}
제2조2항[제2조2항2호_]=제2조2항2호
제2조3항_='③응시자는 시험위원회의 심의를 거쳐 위원장이 공고하는 바에 따라 제1항 및 제2항의 규정에 따른 서류를 제출하여야 하며, 응시자가 제출한 서류는 반환하지 아니한다. <개정 2006. 3. 10.>'
제2조3항={}
제2조[제2조3항_]=제2조3항
제2조4항_='④영 제7조제1항에서 "총리령이 정하는 금액"이라 함은 5만원을 말한다. <개정 2001. 8. 31., 2004. 4. 1., 2008. 3. 3.>'
제2조4항={}
제2조[제2조4항_]=제2조4항
제2_02조_=' 제2조의2(학점취득증명서) '
제2_02조={}
제2_02조['공인회계사법시행규칙 제2조의2(학점취득증명서)']={}
조문['제2조의2(학점취득증명서)']=제2_02조
조['제2조의2(학점취득증명서)']=제2_02조
제2_02조1항_='영 제2조의2제3항의 규정에 의한 학점취득증명서는 별지 제19호서식과 같다.'
제2_02조1항={}
제2_02조[제2_02조1항_]=제2_02조1항
제2_02조['[본조신설 2004. 4. 1.]']={}
제3조_=' 제3조 (응시표) '
제3조={}
제3조['공인회계사법시행규칙 제3조 (응시표)']={}
조문['제3조 (응시표)']=제3조
조['제3조 (응시표)']=제3조
제3조1항_='위원장은 제2조제1항의 규정에 의한 응시원서를 접수한 때에는 별지 제1호서식의 접수부에 해당사항을 기재하고 응시자에게 응시표를 교부한다.'
제3조1항={}
제3조[제3조1항_]=제3조1항
제4조_=' 제4조 (합격증서 및 합격증서교부연명부) '
제4조={}
제4조['공인회계사법시행규칙 제4조 (합격증서 및 합격증서교부연명부)']={}
조문['제4조 (합격증서 및 합격증서교부연명부)']=제4조
조['제4조 (합격증서 및 합격증서교부연명부)']=제4조
제4조1항_='금융위원회는 공인회계사시험 제2차시험의 합격자에게 별지 제2호서식의 합격증서를 교부하고 그 사실을 별지 제3호서식의 합격증서교부연명부에 기재하여야 한다. <개정 2001. 8. 31., 2008. 3. 3.>'
제4조1항={}
제4조[제4조1항_]=제4조1항
제5조_=' 제5조 (등록신청서) '
제5조={}
제5조['공인회계사법시행규칙 제5조 (등록신청서)']={}
조문['제5조 (등록신청서)']=제5조
조['제5조 (등록신청서)']=제5조
제5조1항_='법 제7조제1항에 따라 공인회계사 등록을 하려는 사람은 별지 제4호서식의 공인회계사 등록신청서에 다음 각 호의 서류를 첨부하여 한국공인회계사회에 제출하여야 한다. <개정 2001. 8. 31., 2008. 3. 3., 2014. 8. 8.>'
제5조1항={}
제5조[제5조1항_]=제5조1항
제5조1항1호_='1. 합격증서 사본 1부'
제5조1항1호={}
제5조1항[제5조1항1호_]=제5조1항1호
제5조1항2호_='2. 실무수습의 종료를 증명하는 서류 1부(법 제6조제1항 각호의 1에 해당하는 자를 제외한다)'
제5조1항2호={}
제5조1항[제5조1항2호_]=제5조1항2호
제5조1항3호_='3. 이력서 1부'
제5조1항3호={}
제5조1항[제5조1항3호_]=제5조1항3호
제5조1항4호_='4. 사진(반명함판) 3매'
제5조1항4호={}
제5조1항[제5조1항4호_]=제5조1항4호
제6조_=' 제6조 (공인회계사등록부) '
제6조={}
제6조['공인회계사법시행규칙 제6조 (공인회계사등록부)']={}
조문['제6조 (공인회계사등록부)']=제6조
조['제6조 (공인회계사등록부)']=제6조
제6조1항_='영 제10조제2항의 규정에 의한 공인회계사등록부는 별지 제5호서식과 같다.'
제6조1항={}
제6조[제6조1항_]=제6조1항
제7조_=' 제7조 (등록증) '
제7조={}
제7조['공인회계사법시행규칙 제7조 (등록증)']={}
조문['제7조 (등록증)']=제7조
조['제7조 (등록증)']=제7조
제7조1항_='영 제10조제2항의 규정에 의한 등록증은 별지 제6호서식과 같다.'
제7조1항={}
제7조[제7조1항_]=제7조1항
제8조_=' 제8조 (등록사항의 변경신고) '
제8조={}
제8조['공인회계사법시행규칙 제8조 (등록사항의 변경신고)']={}
조문['제8조 (등록사항의 변경신고)']=제8조
조['제8조 (등록사항의 변경신고)']=제8조
제8조1항_='영 제10조제3항의 규정에 의한 변경신고는 별지 제7호서식의 신고서에 의하되, 변경내용을 증명하는 서류를 첨부하여야 한다.'
제8조1항={}
제8조[제8조1항_]=제8조1항
제9조_=' 제9조 (등록갱신의 신청) '
제9조={}
제9조['공인회계사법시행규칙 제9조 (등록갱신의 신청)']={}
조문['제9조 (등록갱신의 신청)']=제9조
조['제9조 (등록갱신의 신청)']=제9조
제9조1항_='영 제11조제2항의 규정에 의한 공인회계사등록갱신신청은 별지 제8호 서식의 신청서에 의하되, 다음 각호의 서류를 첨부하여야 한다.'
제9조1항={}
제9조[제9조1항_]=제9조1항
제9조1항1호_='1. 이력서 1부'
제9조1항1호={}
제9조1항[제9조1항1호_]=제9조1항1호
제9조1항2호_='2. 반명함판 사진 2매'
제9조1항2호={}
제9조1항[제9조1항2호_]=제9조1항2호
제9조['[전문개정 2001. 8. 31.]']={}
제10조_=' 제10조 삭제  '
제10조={}
제10조['공인회계사법시행규칙 제10조 삭제 ']={}
조문['제10조 삭제 ']=제10조
조['제10조 삭제 ']=제10조
제11조_=' 제11조 (회계법인의 대표이사) '
제11조={}
제11조['공인회계사법시행규칙 제11조 (회계법인의 대표이사)']={}
조문['제11조 (회계법인의 대표이사)']=제11조
조['제11조 (회계법인의 대표이사)']=제11조
제11조1항_='법 제26조제4항의 규정에 의하여 회계법인에는 3인 이내의 대표이사를 두어야 한다.'
제11조1항={}
제11조[제11조1항_]=제11조1항
제11조['[전문개정 2001. 8. 31.]']={}
제12조_=' 제12조 (회계법인등록신청서) '
제12조={}
제12조['공인회계사법시행규칙 제12조 (회계법인등록신청서)']={}
조문['제12조 (회계법인등록신청서)']=제12조
조['제12조 (회계법인등록신청서)']=제12조
제12조1항_='영 제15조제1항 본문의 규정에 의한 회계법인등록신청서는 별지 제10호서식과 같다.'
제12조1항={}
제12조[제12조1항_]=제12조1항
제12조['[제목개정 2001. 8. 31.]']={}
제13조_=' 제13조 (회계법인의 등록증 등) '
제13조={}
제13조['공인회계사법시행규칙 제13조 (회계법인의 등록증 등)']={}
조문['제13조 (회계법인의 등록증 등)']=제13조
조['제13조 (회계법인의 등록증 등)']=제13조
제13조1항_='①영 제15조제2항의 규정에 의한 회계법인등록증은 별지 제11호서식과 같다. <개정 2001. 8. 31.>'
제13조1항={}
제13조[제13조1항_]=제13조1항
제13조2항_='②금융위원회는 회계법인이 등록한 때에는 별지 제12호 서식의 회계법인등록부에 그 등록에 관한 사항을 기재하여야 한다. <개정 2001. 8. 31., 2008. 3. 3.>'
제13조2항={}
제13조[제13조2항_]=제13조2항
제13조['[제목개정 2001. 8. 31.]']={}
제14조_=' 제14조 (회계법인 해산사유의 통보 등) '
제14조={}
제14조['공인회계사법시행규칙 제14조 (회계법인 해산사유의 통보 등)']={}
조문['제14조 (회계법인 해산사유의 통보 등)']=제14조
조['제14조 (회계법인 해산사유의 통보 등)']=제14조
제14조1항_='①법 제37조제2항의 규정에 의하여 해산사유 발생사실을 통보하고자 하는 회계법인은 별지 제13호 서식의 통보서에 다음 각호의 서류를 첨부하여 이를 금융위원회에 제출하여야 한다. <개정 2001. 8. 31., 2008. 3. 3.>'
제14조1항={}
제14조[제14조1항_]=제14조1항
제14조1항1호_='1. 삭제 <2001. 8. 31.>'
제14조1항1호={}
제14조1항[제14조1항1호_]=제14조1항1호
제14조1항2호_='2. 사원총회의사록 사본 1부'
제14조1항2호={}
제14조1항[제14조1항2호_]=제14조1항2호
제14조1항3호_='3. 한국공인회계사회에 손해배상준비금을 예치한 사실을 증명하는 서류 1부(합병의 사유로 해산하는 경우를 제외한다)'
제14조1항3호={}
제14조1항[제14조1항3호_]=제14조1항3호
제14조2항_='② 삭제 <2001. 8. 31.>'
제14조2항={}
제14조[제14조2항_]=제14조2항
제14조3항_='③법 제38조의 규정에 의하여 회계법인의 정관변경을 신고하고자 하는 자는 별지 제15호서식의 신고서에 다음 각호의 서류를 첨부하여 금융위원회에 제출하여야 한다. 이 경우 금융위원회는 「전자정부 구현을 위한 행정업무 등의 전자화 촉진에 관한 법률」 제21조제1항에 따른 행정정보의 공동이용을 통하여 신고인의 법인등기부 등본을 확인하여야 하며, 신고인이 확인에 동의하지 아니하는 경우에는 그 서류를 첨부하도록 하여야 한다. <개정 2001. 8. 31., 2006. 7. 5., 2008. 3. 3.>'
제14조3항={}
제14조[제14조3항_]=제14조3항
제14조3항1호_='1. 신ㆍ구정관 각1부'
제14조3항1호={}
제14조3항[제14조3항1호_]=제14조3항1호
제14조3항2호_='2. 삭제 <2006. 7. 5.>'
제14조3항2호={}
제14조3항[제14조3항2호_]=제14조3항2호
제14조3항3호_='3. 사원총회의사록 사본 1부'
제14조3항3호={}
제14조3항[제14조3항3호_]=제14조3항3호
제14조4항_='④ 삭제 <2006. 7. 5.>'
제14조4항={}
제14조[제14조4항_]=제14조4항
제14조['[제목개정 2001. 8. 31.]']={}
제15조_=' 제15조 (징계의결의 요구) '
제15조={}
제15조['공인회계사법시행규칙 제15조 (징계의결의 요구)']={}
조문['제15조 (징계의결의 요구)']=제15조
조['제15조 (징계의결의 요구)']=제15조
제15조1항_='영 제33조제1항의 규정에 의한 징계의결의 요구는 별지 제16호서식의 요구서에 의한다.'
제15조1항={}
제15조[제15조1항_]=제15조1항
제15조['[제목개정 2001. 8. 31.]']={}
제16조_=' 제16조 (징계의결의 통보) '
제16조={}
제16조['공인회계사법시행규칙 제16조 (징계의결의 통보)']={}
조문['제16조 (징계의결의 통보)']=제16조
조['제16조 (징계의결의 통보)']=제16조
제16조1항_='영 제37조제1항의 규정에 의한 징계의결의 통보는 별지 제17호서식의 통보서에 의한다. <개정 2001. 8. 31.>'
제16조1항={}
제16조[제16조1항_]=제16조1항
제16_02조_=' 제16조의2(외국공인회계사등록신청서) '
제16_02조={}
제16_02조['공인회계사법시행규칙 제16조의2(외국공인회계사등록신청서)']={}
조문['제16조의2(외국공인회계사등록신청서)']=제16_02조
조['제16조의2(외국공인회계사등록신청서)']=제16_02조
제16_02조1항_='영 제23조의2제1항에 따른 외국공인회계사등록신청서는 별지 제20호서식과 같다.'
제16_02조1항={}
제16_02조[제16_02조1항_]=제16_02조1항
제16_02조['[본조신설 2011. 6. 30.]']={}
제16_03조_=' 제16조의3(외국공인회계사등록부) '
제16_03조={}
제16_03조['공인회계사법시행규칙 제16조의3(외국공인회계사등록부)']={}
조문['제16조의3(외국공인회계사등록부)']=제16_03조
조['제16조의3(외국공인회계사등록부)']=제16_03조
제16_03조1항_='법 제40조의4제3항에 따른 외국공인회계사등록부는 별지 제21호서식과 같다.'
제16_03조1항={}
제16_03조[제16_03조1항_]=제16_03조1항
제16_03조['[본조신설 2011. 6. 30.]']={}
제16_04조_=' 제16조의4(외국공인회계사등록증) '
제16_04조={}
제16_04조['공인회계사법시행규칙 제16조의4(외국공인회계사등록증)']={}
조문['제16조의4(외국공인회계사등록증)']=제16_04조
조['제16조의4(외국공인회계사등록증)']=제16_04조
제16_04조1항_='법 제40조의4제3항에 따른 외국공인회계사등록증은 별지 제22호서식과 같다.'
제16_04조1항={}
제16_04조[제16_04조1항_]=제16_04조1항
제16_04조['[본조신설 2011. 6. 30.]']={}
제16_05조_=' 제16조의5(외국공인회계사등록갱신신청서) '
제16_05조={}
제16_05조['공인회계사법시행규칙 제16조의5(외국공인회계사등록갱신신청서)']={}
조문['제16조의5(외국공인회계사등록갱신신청서)']=제16_05조
조['제16조의5(외국공인회계사등록갱신신청서)']=제16_05조
제16_05조1항_='영 제23조의3에 따른 외국공인회계사등록갱신신청서는 별지 제23호서식과 같다.'
제16_05조1항={}
제16_05조[제16_05조1항_]=제16_05조1항
제16_05조['[본조신설 2011. 6. 30.]']={}
제16_06조_=' 제16조의6(외국공인회계사등록사항변경신고서) '
제16_06조={}
제16_06조['공인회계사법시행규칙 제16조의6(외국공인회계사등록사항변경신고서)']={}
조문['제16조의6(외국공인회계사등록사항변경신고서)']=제16_06조
조['제16조의6(외국공인회계사등록사항변경신고서)']=제16_06조
제16_06조1항_='영 제23조의2제2항에 따른 외국공인회계사등록사항변경신고서는 별지 제24호서식과 같다.'
제16_06조1항={}
제16_06조[제16_06조1항_]=제16_06조1항
제16_06조['[본조신설 2011. 6. 30.]']={}
제16_07조_=' 제16조의7(외국회계법인등록신청서) '
제16_07조={}
제16_07조['공인회계사법시행규칙 제16조의7(외국회계법인등록신청서)']={}
조문['제16조의7(외국회계법인등록신청서)']=제16_07조
조['제16조의7(외국회계법인등록신청서)']=제16_07조
제16_07조1항_='영 제23조의4에 따른 외국회계법인등록신청서는 별지 제25호서식과 같다.'
제16_07조1항={}
제16_07조[제16_07조1항_]=제16_07조1항
제16_07조['[본조신설 2011. 6. 30.]']={}
제16_08조_=' 제16조의8(외국회계법인등록부) '
제16_08조={}
제16_08조['공인회계사법시행규칙 제16조의8(외국회계법인등록부)']={}
조문['제16조의8(외국회계법인등록부)']=제16_08조
조['제16조의8(외국회계법인등록부)']=제16_08조
제16_08조1항_='법 제40조의7제3항에 따른 외국회계법인등록부는 별지 제26호서식과 같다.'
제16_08조1항={}
제16_08조[제16_08조1항_]=제16_08조1항
제16_08조['[본조신설 2011. 6. 30.]']={}
제16_09조_=' 제16조의9(외국회계법인등록증) '
제16_09조={}
제16_09조['공인회계사법시행규칙 제16조의9(외국회계법인등록증)']={}
조문['제16조의9(외국회계법인등록증)']=제16_09조
조['제16조의9(외국회계법인등록증)']=제16_09조
제16_09조1항_='법 제40조의7제3항에 따른 외국회계법인등록증은 별지 제27호서식과 같다.'
제16_09조1항={}
제16_09조[제16_09조1항_]=제16_09조1항
제16_09조['[본조신설 2011. 6. 30.]']={}
제16_10조_=' 제16조의10(영업보고서의 제출 등) '
제16_10조={}
제16_10조['공인회계사법시행규칙 제16조의10(영업보고서의 제출 등)']={}
조문['제16조의10(영업보고서의 제출 등)']=제16_10조
조['제16조의10(영업보고서의 제출 등)']=제16_10조
제16_10조1항_='① 외국공인회계사 및 외국회계법인은 법 제40조의13제1항에 따른 영업보고서에 다음 각 호의 사항을 기재하여 제출하여야 한다.'
제16_10조1항={}
제16_10조[제16_10조1항_]=제16_10조1항
제16_10조1항1호_='1. 외국회계사무소의 주소 및 상호 등의 개요'
제16_10조1항1호={}
제16_10조1항[제16_10조1항1호_]=제16_10조1항1호
제16_10조1항2호_='2. 외국회계사무소의 대표자, 소속 외국공인회계사 및 사무직원 현황'
제16_10조1항2호={}
제16_10조1항[제16_10조1항2호_]=제16_10조1항2호
제16_10조1항3호_='3. 외국회계사무소의 재무제표와 그 부속명세서'
제16_10조1항3호={}
제16_10조1항[제16_10조1항3호_]=제16_10조1항3호
제16_10조1항4호_='4. 외국회계사무소의 최근 3개 사업연도 업무별 보수총액'
제16_10조1항4호={}
제16_10조1항[제16_10조1항4호_]=제16_10조1항4호
제16_10조1항5호_='5. 최근 3년간 원자격국 감독기관에 의한 외국공인회계사에 대한 징계 등 신분상의 조치사실 및 해당 외국회계법인에 대한 영업정지 등 조치사실'
제16_10조1항5호={}
제16_10조1항[제16_10조1항5호_]=제16_10조1항5호
제16_10조1항6호_='6. 외국회계법인(소속 외국공인회계사를 포함한다)의 최근 3년간 업무와 관련된 소송현황'
제16_10조1항6호={}
제16_10조1항[제16_10조1항6호_]=제16_10조1항6호
제16_10조1항7호_='7. 외국회계사무소의 대표자 및 소속 외국공인회계사의 국내 체류기간'
제16_10조1항7호={}
제16_10조1항[제16_10조1항7호_]=제16_10조1항7호
제16_10조2항_='② 제1항에 따른 영업보고서의 서식은 한국공인회계사회에서 정한다.'
제16_10조2항={}
제16_10조[제16_10조2항_]=제16_10조2항
제16_10조3항_='③ 외국회계법인 및 외국공인회계사는 제1항에 따른 영업보고서를 전자문서로 제출할 수 있다.'
제16_10조3항={}
제16_10조[제16_10조3항_]=제16_10조3항
제16_10조['[본조신설 2011. 6. 30.]']={}
제17조_=' 제17조 (과징금의 납부기한 연장 등) '
제17조={}
제17조['공인회계사법시행규칙 제17조 (과징금의 납부기한 연장 등)']={}
조문['제17조 (과징금의 납부기한 연장 등)']=제17조
조['제17조 (과징금의 납부기한 연장 등)']=제17조
제17조1항_='영 제40조제3항의 규정에 의하여 과징금의 납부기한을 연장하거나 분할납부하고자 하는 자는 별지 제18호 서식의 신청서에 과징금의 납부기한 연장 또는 분할납부를 신청하는 사유를 입증하는 서류를 첨부하여 금융위원회에 제출하여야 한다. <개정 2008. 3. 3.>'
제17조1항={}
제17조[제17조1항_]=제17조1항
제17조['[본조신설 2001. 8. 31.]']={}
부칙['부칙  <제1269호, 2016. 4. 18.']={}
부칙['이 규칙은 공포한 날부터 시행한다']={}
bub={'서문':서문,'조문':조문,'조별':조,'부칙':부칙}
    
import wx
class MyFrame(wx.Frame):
    def __init__(self):
        wx.Frame.__init__(self, parent=None, title=bubname)
        self.SetSize(620, 520)
        self.mainPanel = wx.Panel(self)
        self.expandButton = wx.Button(self.mainPanel, label=bubname)
        self.tree = wx.TreeCtrl(self.mainPanel)
        root = self.tree.AddRoot(bubname)
        for i in bub:
            ii = self.tree.AppendItem(root, i)
            for j in bub[i]:
                jj = self.tree.AppendItem(ii, j)
                for k in bub[i][j]:
                    kk = self.tree.AppendItem(jj, k)
                    for m in bub[i][j][k]:
                        mm = self.tree.AppendItem(kk, m)
                        for n in bub[i][j][k][m]:
                            nn = self.tree.AppendItem(mm, n)
                            for p in bub[i][j][k][m][n]:
                                pp = self.tree.AppendItem(nn, p)
                                for q in bub[i][j][k][m][n][p]:
                                    qq=self.tree.AppendItem(pp,q)
                                    for r in bub[i][j][k][m][n][p][q]:
                                        rr=self.tree.AppendItem(qq,r)
                                        for s in bub[i][j][k][m][n][p][q][r]:
                                            ss = self.tree.AppendItem(rr, s)
                                            for t in bub[i][j][k][m][n][p][q][r][s]:
                                                tt = self.tree.AppendItem(ss, t)
                                                for u in bub[i][j][k][m][n][p][q][r][s][t]:
                                                    uu = self.tree.AppendItem(tt, u)
                                                    for v in bub[i][j][k][m][n][p][q][r][s][t][u]:
                                                        vv = self.tree.AppendItem(uu, v)
        self.staticText = wx.TextCtrl(self.mainPanel, style=wx.TE_MULTILINE)
        self.vtBoxSizer = wx.BoxSizer(wx.VERTICAL)
        self.vtBoxSizer.Add(self.expandButton, 0, wx.EXPAND | wx.ALL, 5)
        self.vtBoxSizer.Add(self.tree, 5, wx.EXPAND | wx.ALL, 5)
        self.vtBoxSizer.Add(self.staticText, 0, wx.EXPAND | wx.ALL, 5)
        self.mainPanel.SetSizer(self.vtBoxSizer)
        self.Bind(wx.EVT_BUTTON, self.OnExpandButton, self.expandButton)
        self.Bind(wx.EVT_TREE_SEL_CHANGED, self.OnNodeSelected, self.tree)
        self.Bind(wx.EVT_CLOSE, self.OnClose)

    def OnExpandButton(self, e):
        self.tree.ExpandAll()

    def __del__(self):
        print('소멸합니다.')

    def OnClose(self, event):
        frame.Destroy()

    def OnNodeSelected(self, e):
        selected = self.tree.GetSelection()
        self.staticText.SetLabel(self.tree.GetItemText(selected))
        self.mainPanel.Layout()
if __name__ == '__main__':
    app = wx.App(redirect=True)
    frame = MyFrame()
    wnd = wx.Frame(None, wx.ID_ANY, "")
    wnd.CenterOnScreen()
    app.SetTopWindow(wnd)
    frame.Show()
    app.MainLoop()
    