# -*- coding: utf-8 -*-
#Created on 2018-12-24 @author: 권달현
법인세={
        '국외지배주주':{},
        '손금불산입되는 배당간주이자의 계산':{
                '차입금의 범위':{},
                '이자 및 할인료':{},
                '국외지배주주의 할인금액':{},
                },
        '세무조정':{},
        '배당간주이자의 손금불산입 적용순서':{},
        '배당간주이자 손금불산입 규정의 적용제외 등':{
                '통상적 조건에의한 차입금에 대한 배당간주이자 손금불산입 규정의 적용제외':{},
                '원천징수세액에대한 상계조정':{},
                },
        '제출서류':{},
        '===================================================':{},
        '배당으로 간주된 이자의 손금불산입':{},
        '손금불산입액의 계산방법':{
            '국외지배주주의 정의':{},
            '국외지배주주의 범위':{},
            '차입금의 범위':{},
            '손금불산입 지급이자의 계산':{},
            '손금불산입된 이자의 소득처분':{},
            '통상적인 조건에 의한 차입금':{},
            '제3자 개입 차입 거래':{},
            '원천징수세액의 조정방법':{},
            '지급이자의 손금불산입 적용순서':{},
            '서식제출':{},
            },
        '계산사례':{
            '사례 1':{
                '상황':{},
                '계산':{},
                },
            '사례 2':{
                '상황':{},
                '계산':{},
                },
            },
        }