# -*- coding: utf-8 -*-
#Created on Sun Dec 23 17:28:44 2018@author: 권달현
조={};조문 = {};
제1조_='제1조(납세의무자)'
제1조={}
제1조1항_='「교육세법」(이하 "법"이라 한다) 별표 제6호에서 "대통령령으로 정하는 외국보험회사"란 「보험업법」에 따른 외국보험회사로서 국내에서 내국인과 외국인을 대상으로 보험사업을 영위하는 자를 말하며, 국내에서 외국인만을 대상으로 보험사업을 영위하는 외국보험회사는 제외한다.'
제1조1항={}
제1조501항_='[전문개정 2017.2.7.]'
제1조501항={}
제2조_='제2조(과세표준의 계산)'
제2조={}
제2조1항_='①개별소비세액ㆍ교통ㆍ에너지ㆍ환경세액 또는 주세액에 부과되는 교육세는 「개별소비세법」ㆍ「교통ㆍ에너지ㆍ환경세법」 또는 「주세법」상의 과세표준에 산입하지 아니한다. <개정 1996.5.4., 2006.2.9., 2007.2.28., 2007.12.31.>'
제2조1항={}
제2조2항_='②교육세를 납부하여야 할 자가 교육세의 과세표준이 되는 세액을 납부하지 아니함으로써 당해 세액에 가산세가 가산된 때에는 그 가산세액은 교육세의 과세표준에 산입하지 아니한다.'
제2조2항={}
제2조3항_='③법 제5조제1항제2호 내지 제4호의 과세표준을 계산함에 있어서 교육세가 부과되는 물품을 원료로 하여 제조ㆍ가공한 물품에 대하여는 그 제조ㆍ가공한 물품의 개별소비세산출세액ㆍ교통ㆍ에너지ㆍ환경세산출세액 또는 주세산출세액에서 그 원료에 대하여 납부한 개별소비세액ㆍ교통ㆍ에너지ㆍ환경세액 또는 주세액을 공제한 것을 과세표준으로 한다. <개정 1996.5.4., 2007.2.28., 2007.12.31.>'
제2조3항={}
제3조_='제3조(스와프거래에 대한 교육세 과세한도)'
제3조={}
제3조1항_='법 제5조제1항 단서의 규정에 의한 스와프거래와 관련하여 발생하는 수익금액에 대한 교육세액의 한도는 제1호의 금액에서 제2호의 금액을 차감한 금액으로 한다.'
제3조1항={}
제3조1항1호_='1. 외화자금의 매각으로 획득한 원화자금의 총운용수익 및 외화자금의 환매로 인하여 발생한 각종 보전수익의 합계액'
제3조1항1호={}
제3조1항2호_='2. 외화자금차입에 따른 총지급이자ㆍ각종수수료 및 외화자금의 환매시 한국은행이 환수하는 국내ㆍ국외금리차와 환율변동에 따른 이익의 합계액'
제3조1항2호={}
제4조_='제4조(금융보험업의 수익금액)'
제4조={}
제4조1항_='①법 제5조제3항에서 "대통령령으로 정하는 금액"이란 다음 각 호의 금액을 말한다. <개정 2000.12.29., 2004.12.31., 2007.2.28., 2009.2.4., 2010.2.18., 2010.12.30., 2011.7.14., 2014.2.21., 2015.2.3.>'
제4조1항={}
제4조1항1호_='1. 수입할인료'
제4조1항1호={}
제4조1항2호_='2. 위탁자보수 및 이익분배금'
제4조1항2호={}
제4조1항3호_='3. 신탁보수'
제4조1항3호={}
제4조1항4호_='4. 대여료'
제4조1항4호={}
제4조1항5호_='5. 다음 각 목의 금액을 합산한 후의 순이익'
제4조1항5호={}
제4조1항5호가목_='가. 「자본시장과 금융투자업에 관한 법률」 제4조제7항에 따른 파생결합증권, 같은 항 제1호에 따른 증권 및 같은 법 제5조제1항에 따른 파생상품(이하 이 호에서 "파생상품등"이라 한다) 거래의 손익을 통산(通算)한 순손익(「법인세법 시행령」 제76조제1항에 따른 통화선도등의 평가손익 및 같은 조 제2항에 따른 환위험회피용통화선도등의 평가손익을 포함한다)'
제4조1항5호가목={}
제4조1항5호나목_='나. 외환(파생상품등은 제외한다)매매손익'
제4조1항5호나목={}
제4조1항5_2호_='5의2. 삭제 <2011.7.14.>'
제4조1항5_2호={}
제4조1항5_3호_='5의3. 삭제 <2011.7.14.>'
제4조1항5_3호={}
제4조1항6호_='6. 수입임대료'
제4조1항6호={}
제4조1항7호_='7. 고정자산처분익'
제4조1항7호={}
제4조1항8호_='8. 기타영업수익 및 영업외수익'
제4조1항8호={}
제4조2항_='②다음의 금액은 법 제5조제1항제1호의 과세표준이 되는 수익금액에 이를 산입하지 아니한다. <개정 2006.2.9., 2009.2.4., 2010.2.18., 2010.12.30., 2015.2.3., 2016.9.22.>'
제4조2항={}
제4조2항1호_='1. 국외의 사업장에서 발생한 수익금액'
제4조2항1호={}
제4조2항2호_='2. 자산ㆍ부채의 평가 또는 수익ㆍ비용의 귀속시기 차이 등에 따라 발생하는 수익으로서 다음 각 목에 해당하는 것'
제4조2항2호={}
제4조2항2호가목_='가. 「법인세법」 제42조에 따라 익금으로 보지 아니하는 자산 및 부채의 평가익'
제4조2항2호가목={}
제4조2항2호나목_='나. 과세표준에서 차감되지 아니하는 비용의 환입에 따라 발생하는 수익'
제4조2항2호나목={}
제4조2항2호다목_='다. 채권의 매각익 또는 상환익 중 해당 채권의 대손금 및 대손충당금에 상당하는 금액'
제4조2항2호다목={}
제4조2항2호라목_='라. 그 밖에 대외거래와 관계없이 내부적ㆍ일시적으로 인식하는 수익'
제4조2항2호라목={}
제4조2항3호_='3. 국고보조금ㆍ보험차익ㆍ채무면제익 및 자산수증익'
제4조2항3호={}
제4조2항3_2호_='3의2. 「서민의 금융생활 지원에 관한 법률」 제2조제3호에 따른 휴면예금의 소멸시효완성익'
제4조2항3_2호={}
제4조2항4호_='4. 부가가치세가 과세되는 재화 또는 용역의 가액'
제4조2항4호={}
제4조2항5호_='5. 국외의 보험회사가 인수한 보험으로서 재보험계약에 의하여 국내에 수입된 보험료'
제4조2항5호={}
제4조2항6호_='6. 보험회사가 재보험에 가입함으로써 재보험회사로부터 받은 출재보험수수료ㆍ출재이익수수료ㆍ이재조사비'
제4조2항6호={}
제4조2항7호_='7. 법 별표 제4호ㆍ제9호ㆍ제10호 및 제12호의 금융ㆍ보험업자가 영위하는 투자자문업 및 투자일임업에서 발생하는 수수료'
제4조2항7호={}
제4조2항8호_='8. 법 별표 제12호의 금융ㆍ보험업자가 금융투자상품의 중개를 다른 회사와 공동으로 수행하고 자신의 수수료와 다른 회사에 분배될 수수료를 함께 수령한 경우, 그 다른 회사에 분배될 수수료'
제4조2항8호={}
제4조2항9호_='9. 법 별표 제12호의 금융ㆍ보험업자가 국외에서 수행한 투자중개업무에 대한 수수료'
제4조2항9호={}
제4조2항10호_='10. 「여신전문금융업법」 제2조제2호의 신용카드 발행업무를 행하는 신용카드업자(이하 "신용카드 발행자"라 한다)와 신용카드 가맹점의 모집 및 관리업무를 행하는 신용카드업자(이하 "가맹점 모집 및 관리자"라 한다)가 다른 경우 가맹점 모집 및 관리자가 신용카드 등의 거래로 인하여 신용카드 가맹점으로부터 지급받은 가맹점수수료 중 신용카드 발행자에게 지급하는 수수료'
제4조2항10호={}
제4조2항11호_='11. 법 별표 제14호의 금융ㆍ보험업자가 수입한 다음 각 목의 수익금액'
제4조2항11호={}
제4조2항11호가목_='가. 보증료'
제4조2항11호가목={}
제4조2항11호나목_='나. 무역어음 재할인으로 인하여 발생한 이자'
제4조2항11호나목={}
제4조2항11호다목_='다. 비거주자로부터 수입한 이자 및 수수료'
제4조2항11호다목={}
제4조2항12호_='12. 「한국산업은행법」에 따라 설립된 한국산업은행(이하 이 호에서 "한국산업은행"이라 한다)이 수입한 다음 각 목의 수익금액'
제4조2항12호={}
제4조2항12호가목_='가. 법률 제12633호 한국산업은행법 전부개정법률 부칙 제6조에 따라 한국산업은행이 「한국정책금융공사법」(법률 제12633호 한국산업은행법 전부개정법률 부칙 제2조에 따라 폐지되기 전의 것을 말한다. 이하 이 호에서 같다)에 따른 한국정책금융공사(이하 이 호에서 "한국정책금융공사"라 한다)로부터 승계한 대출채권(법률 제12633호 한국산업은행법 전부개정법률 부칙 제4조제6항에 따른 합병의 등기를 한 날 이전에 한국정책금융공사가 대출계약을 체결한 것을 포함한다)으로부터 발생하는 이자 및 수수료 등의 수익금액'
제4조2항12호가목={}
제4조2항12호나목_='나. 법률 제12633호 한국산업은행법 전부개정법률 부칙 제7조에 따라 한국산업은행이 한국정책금융공사로부터 승계한 업무로서 「한국정책금융공사법」 제21조제1항제1호에 따른 중소기업의 육성 분야에 자금을 공급하는 업무를 같은 조 제3항 각 호의 방법에 따라 금융ㆍ보험업자에게 대출ㆍ투자 또는 보증한 채권으로부터 발생하는 이자 및 수수료 등의 수익금액'
제4조2항12호나목={}
제4조3항_='③ 삭제 <2010.12.30.>'
제4조3항={}
제4조4항_='④ 「자본시장과 금융투자업에 관한 법률」에 따른 종합금융회사의 수익금액은 「법인세법 시행령」 제24조제5항에 따른 금융리스 외의 리스로 인한 리스료 중 취득가액에 상당하는 금액(이하 "운용리스 원금"이라 한다) 외의 수익금액의 합계액으로 한다. <개정 2009.2.4.>'
제4조4항={}
제4조5항_='⑤전당포영업자의 수익금액은 수입이자ㆍ수입할인료 및 유질물처분익의 합계액으로 한다. <개정 1999.4.30., 2004.12.31.>'
제4조5항={}
제4조6항_='⑥「외국환거래법」에 의한 환전영업자의 수익금액은 외국환매매익 및 수입수수료의 합계액으로 한다. <개정 2000.12.29., 2004.12.31., 2006.2.9.>'
제4조6항={}
제4조7항_='⑦금전대부업자의 수익금액은 수입이자ㆍ수입할인료ㆍ수입수수료 및 수입대여료의 합계액으로 한다. <개정 2004.12.31.>'
제4조7항={}
제4조8항_='⑧ 「여신전문금융업법」에 따른 여신전문금융회사의 수익금액은 다음 각 호 외의 수익금액의 합계액으로 한다. <신설 2009.2.4., 2010.2.18.>'
제4조8항={}
제4조8항1호_='1. 운용리스 원금'
제4조8항1호={}
제4조8항2호_='2. 「여신전문금융업법」 제41조제1항에 따른 업무와 같은 법 제46조제1항제7호에 따라 금융위원회가 신기술사업금융업자만 영위할 수 있도록 정한 업무를 함으로써 발생하는 수익금액'
제4조8항2호={}
제5조_='제5조(보험료수익금액의 계산)'
제5조={}
제5조1항_='법 제5조제3항에 따른 보험료(책임준비금 및 비상위험준비금으로 적립되는 금액과 재보험료를 공제한다)는 제1호의 금액에서 제2호의 금액을 공제한 금액으로 한다. <개정 1998.12.31., 2000.12.29., 2006.2.9., 2009.2.4., 2010.2.18.>'
제5조1항={}
제5조1항1호_='1. 보험료ㆍ수재보험료ㆍ전기말 현재의 책임준비금과 비상위험준비금(「법인세법」 제30조제1항의 금액을 말한다. 이하 같다) 및 재보험회사로부터 받은 해약환급금(중도해약으로 인하여 지급받은 금액중 미경과보험료에 해당하는 금액을 말한다)의 합계액'
제5조1항1호={}
제5조1항2호_='2. 당기말 현재의 책임준비금과 비상위험준비금ㆍ해약환급금(중도해약으로 인하여 지급한 금액중 미경과보험료에 해당하는 금액을 말한다)ㆍ출재보험료(제4조제2항제5호의 규정에 의한 보험료에 관계되는 출재보험료를 제외한다)의 합계액. 다만, 당기 중에 다음 각 목에 해당하는 금액이 발생한 경우에는 해당 금액을 당기에 한정하여 당기말 책임준비금에 가산한다.'
제5조1항2호={}
제5조1항2호가목_='가. 만기ㆍ사망ㆍ해약 등으로 소멸된 책임준비금 해당액'
제5조1항2호가목={}
제5조1항2호나목_='나. 사고 등에 따라 지급된 보험금으로서 보험료 산출기초에 이자율을 적용하지 아니하고 순보험료가 위험보험료로만 구성된 보험계약에 따라 지급된 보험금'
제5조1항2호나목={}
제6조_='제6조(금융ㆍ보험업자의 사업장 소재지)'
제6조={}
제6조1항_='① 법 제6조제1항 단서에 따라 납세지로 할 수 있는 각 사업장 소재지는 법 제3조제1호에 따른 금융ㆍ보험업자(이하 "금융ㆍ보험업자"라 한다)가 본점 외에 지점을 독립채산제 방식으로 운영하고 있는 경우의 그 본점 및 지점의 사업장 소재지로 한다. <개정 2011.7.14., 2016.3.31.>'
제6조1항={}
제6조2항_='②금융ㆍ보험업자가 그 납세지를 본점 또는 주사무소의 소재지에서 각 사업장의 소재지로 변경하거나 각 사업장의 소재지에서 본점 또는 주사무소의 소재지로 변경하고자 하는 경우에는 당해 과세기간의 종료일까지 사업자의 인적사항, 변경전ㆍ후의 납세지 및 변경사유를 기재한 납세지변경신고서를 변경후의 납세지소관세무서장에게 제출하여야 한다. <신설 1993.12.31.>'
제6조2항={}
제6조3항_='③제2항의 규정에 의한 신고를 받은 세무서장은 지체없이 변경전의 납세지소관세무서장에게 신고받은 사실을 통보하여야 한다. <신설 1993.12.31.>'
제6조3항={}
제6_2조_='제6조의2(중간예납)'
제6_2조={}
제6_2조1항_='① 금융ㆍ보험업자는 법 제8조의2제1항에 따른 중간예납세액(이하 "중간예납세액"이라 한다)을 납부할 때에는 별지 제1호서식의 교육세중간예납계산서를 납세지 관할 세무서장에게 제출하여야 한다.'
제6_2조1항={}
제6_2조2항_='② 제1항에도 불구하고 제6조의3제3호의 경우에는 별지 제2호서식의 교육세과세표준신고서를 납세지 관할 세무서장에게 제출하여야 한다.'
제6_2조2항={}
제6_2조3항_='③ 중간예납기간 중 휴업 등의 사유로 수익금액이 없는 금융ㆍ보험업자는 해당 중간예납기간에 대한 교육세를 납부하지 아니한다.'
제6_2조3항={}
제6_2조502항_='[본조신설 2016.2.5.]'
제6_2조502항={}
제6_3조_='제6조의3(합병 등의 경우 중간예납)'
제6_3조={}
제6_3조1항_='법인이 중간예납세액을 납부할 때에는 다음 각 호에 따라 중간예납세액을 계산하여 납부하여야 한다.'
제6_3조1항={}
제6_3조1항1호_='1. 합병 후 존속하는 합병법인이 합병 후 최초의 사업연도에 중간예납세액을 납부하는 경우에는 합병법인의 직전 사업연도와 피합병법인(합병에 따라 소멸하는 법인을 말한다. 이하 이 조에서 같다)의 해산등기일이 속하는 사업연도의 직전 사업연도 모두를 법 제8조의2제1항에 따른 직전 과세기간으로 보아 중간예납세액을 계산하여 납부하여야 한다.'
제6_3조1항1호={}
제6_3조1항2호_='2. 합병에 따라 설립된 합병법인이 설립 후 최초의 사업연도에 중간예납세액을 납부하는 경우에는 피합병법인의 해산등기일이 속하는 사업연도의 직전 사업연도를 법 제8조의2제1항에 따른 직전 과세기간으로 보아 중간예납세액을 계산하여 납부하여야 한다.'
제6_3조1항2호={}
제6_3조1항3호_='3. 다음 각 목의 어느 하나에 해당하는 법인의 분할 후 최초의 사업연도의 경우에는 해당 사업연도의 수익금액에 대하여 법 제4조, 법 제5조, 법 제7조 및 법 제8조에 따라 중간예납세액을 계산하여 납부하여야 한다.'
제6_3조1항3호={}
제6_3조1항3호가목_='가. 분할에 따라 설립되는 법인'
제6_3조1항3호가목={}
제6_3조1항3호나목_='나. 분할되는 법인의 일부가 다른 법인과 합병하여 그 다른 법인이 존속하는 경우 그 다른 법인'
제6_3조1항3호나목={}
제6_3조503항_='[본조신설 2016.2.5.]'
제6_3조503항={}
제7조_='제7조(신고ㆍ납부)'
제7조={}
제7조1항_='①법 제9조제1항의 규정에 의하여 교육세를 신고ㆍ납부하는 때에는 별지 제2호서식의 교육세과세표준신고서와 함께 소관세무서장에게 납부하거나 「국세징수법」에 의한 납부서에 교육세과세표준신고서를 첨부하여 한국은행(그 대리점을 포함한다. 이하 같다) 또는 체신관서에 납부하여야 한다. <개정 2006.2.9., 2016.2.5.>'
제7조1항={}
제7조2항_='②법 제9조제2항의 규정에 의하여 교육세를 신고ㆍ납부하는 때에는 당해 세법의 규정에 의한 당해 조세의 신고ㆍ납부서에 당해 세액과 교육세액을 병기하고 그 합계액을 기재하여야 한다.'
제7조2항={}
제8조_='제8조(부과와 징수)'
제8조={}
제8조1항_='①법 제10조의 규정에 의하여 교육세와 교육세의 과세표준이 되는 세액을 함께 징수하는 때에는 당해 조세의 납세고지서에 당해 세액과 교육세액을 병기하고 그 합계액을 기재하여 고지하여야 한다.'
제8조1항={}
제8조2항_='②세무서장은 교육세만을 고지하는 경우에는 교육세의 과세표준이 되는 세액에 대한 교육세임을 표시하여 고지하여야 한다. <개정 2000.12.29.>'
제8조2항={}
제9조_='제9조 삭제 <2000.12.29.>'
제9조={}
제10조_='제10조 삭제 <2000.12.29.>'
제10조={}
제11조_='제11조 삭제 <2000.12.29.>'
제11조={}
제12조_='제12조 삭제 <2000.12.29.>'
제12조={}
제12조_='제12조 삭제 <2000.12.29.>'
제12조={}
제12조1004행_='부칙  <제27842호, 2017.2.7.>'
제12조1004행={}
조문[제1조_]=제1조
제1조[제1조1항_]=제1조1항
제1조[제1조501항_]=제1조501항
조문[제2조_]=제2조
제2조[제2조1항_]=제2조1항
제2조[제2조2항_]=제2조2항
제2조[제2조3항_]=제2조3항
조문[제3조_]=제3조
제3조[제3조1항_]=제3조1항
제3조1항[제3조1항1호_]=제3조1항1호
제3조1항[제3조1항2호_]=제3조1항2호
조문[제4조_]=제4조
제4조[제4조1항_]=제4조1항
제4조1항[제4조1항1호_]=제4조1항1호
제4조1항[제4조1항2호_]=제4조1항2호
제4조1항[제4조1항3호_]=제4조1항3호
제4조1항[제4조1항4호_]=제4조1항4호
제4조1항[제4조1항5호_]=제4조1항5호
제4조1항5호[제4조1항5호가목_]=제4조1항5호가목
제4조1항5호[제4조1항5호나목_]=제4조1항5호나목
제4조1항[제4조1항5_2호_]=제4조1항5_2호
제4조1항[제4조1항5_3호_]=제4조1항5_3호
제4조1항[제4조1항6호_]=제4조1항6호
제4조1항[제4조1항7호_]=제4조1항7호
제4조1항[제4조1항8호_]=제4조1항8호
제4조[제4조2항_]=제4조2항
제4조2항[제4조2항1호_]=제4조2항1호
제4조2항[제4조2항2호_]=제4조2항2호
제4조2항2호[제4조2항2호가목_]=제4조2항2호가목
제4조2항2호[제4조2항2호나목_]=제4조2항2호나목
제4조2항2호[제4조2항2호다목_]=제4조2항2호다목
제4조2항2호[제4조2항2호라목_]=제4조2항2호라목
제4조2항[제4조2항3호_]=제4조2항3호
제4조2항[제4조2항3_2호_]=제4조2항3_2호
제4조2항[제4조2항4호_]=제4조2항4호
제4조2항[제4조2항5호_]=제4조2항5호
제4조2항[제4조2항6호_]=제4조2항6호
제4조2항[제4조2항7호_]=제4조2항7호
제4조2항[제4조2항8호_]=제4조2항8호
제4조2항[제4조2항9호_]=제4조2항9호
제4조2항[제4조2항10호_]=제4조2항10호
제4조2항[제4조2항11호_]=제4조2항11호
제4조2항11호[제4조2항11호가목_]=제4조2항11호가목
제4조2항11호[제4조2항11호나목_]=제4조2항11호나목
제4조2항11호[제4조2항11호다목_]=제4조2항11호다목
제4조2항[제4조2항12호_]=제4조2항12호
제4조2항12호[제4조2항12호가목_]=제4조2항12호가목
제4조2항12호[제4조2항12호나목_]=제4조2항12호나목
제4조[제4조3항_]=제4조3항
제4조[제4조4항_]=제4조4항
제4조[제4조5항_]=제4조5항
제4조[제4조6항_]=제4조6항
제4조[제4조7항_]=제4조7항
제4조[제4조8항_]=제4조8항
제4조8항[제4조8항1호_]=제4조8항1호
제4조8항[제4조8항2호_]=제4조8항2호
조문[제5조_]=제5조
제5조[제5조1항_]=제5조1항
제5조1항[제5조1항1호_]=제5조1항1호
제5조1항[제5조1항2호_]=제5조1항2호
제5조1항2호[제5조1항2호가목_]=제5조1항2호가목
제5조1항2호[제5조1항2호나목_]=제5조1항2호나목
조문[제6조_]=제6조
제6조[제6조1항_]=제6조1항
제6조[제6조2항_]=제6조2항
제6조[제6조3항_]=제6조3항
조문[제6_2조_]=제6_2조
제6_2조[제6_2조1항_]=제6_2조1항
제6_2조[제6_2조2항_]=제6_2조2항
제6_2조[제6_2조3항_]=제6_2조3항
제6_2조[제6_2조502항_]=제6_2조502항
조문[제6_3조_]=제6_3조
제6_3조[제6_3조1항_]=제6_3조1항
제6_3조1항[제6_3조1항1호_]=제6_3조1항1호
제6_3조1항[제6_3조1항2호_]=제6_3조1항2호
제6_3조1항[제6_3조1항3호_]=제6_3조1항3호
제6_3조1항3호[제6_3조1항3호가목_]=제6_3조1항3호가목
제6_3조1항3호[제6_3조1항3호나목_]=제6_3조1항3호나목
제6_3조[제6_3조503항_]=제6_3조503항
조문[제7조_]=제7조
제7조[제7조1항_]=제7조1항
제7조[제7조2항_]=제7조2항
조문[제8조_]=제8조
제8조[제8조1항_]=제8조1항
제8조[제8조2항_]=제8조2항
조문[제9조_]=제9조
조문[제10조_]=제10조
조문[제11조_]=제11조
조문[제12조_]=제12조
조문[제12조_]=제12조
서문={'교육세법 시행령': '', '[시행 2017.2.7.] [대통령령 제27842호, 2017.2.7., 일부개정]': '', '': '', '기획재정부(조세특례제도과) 044-215-4133': '', '기획재정부(금융세제과) 044-215-4236': '', '기획재정부(소득세제과) 044-215-4163': '', '기획재정부(세제실 금융세제과) 044-215-4236': ''}
부칙={}
교육세법시행령={'서문':서문,'조문':조문,'조별':조,'부칙':부칙}
전문=교육세법시행령
bubname='교육세법시행령'


import wx
class MyFrame(wx.Frame):
    def __init__(self):
        wx.Frame.__init__(self, parent=None, title=bubname)
        self.SetSize(620, 520)
        self.mainPanel = wx.Panel(self)
        self.expandButton = wx.Button(self.mainPanel, label=bubname)
        self.tree = wx.TreeCtrl(self.mainPanel)
        root = self.tree.AddRoot(bubname)
        for i in bub:
            ii = self.tree.AppendItem(root, i)
            for j in bub[i]:
                jj = self.tree.AppendItem(ii, j)
                for k in bub[i][j]:
                    kk = self.tree.AppendItem(jj, k)
                    for m in bub[i][j][k]:
                        mm = self.tree.AppendItem(kk, m)
                        for n in bub[i][j][k][m]:
                            nn = self.tree.AppendItem(mm, n)
                            for p in bub[i][j][k][m][n]:
                                pp = self.tree.AppendItem(nn, p)
                                for r in bub[i][j][k][m][n][p]:
                                    rr = self.tree.AppendItem(pp, r)
        self.staticText = wx.TextCtrl(self.mainPanel, style=wx.TE_MULTILINE)
        self.vtBoxSizer = wx.BoxSizer(wx.VERTICAL)
        self.vtBoxSizer.Add(self.expandButton, 0, wx.EXPAND | wx.ALL, 5)
        self.vtBoxSizer.Add(self.tree, 5, wx.EXPAND | wx.ALL, 5)
        self.vtBoxSizer.Add(self.staticText, 0, wx.EXPAND | wx.ALL, 5)
        self.mainPanel.SetSizer(self.vtBoxSizer)
        self.Bind(wx.EVT_BUTTON, self.OnExpandButton, self.expandButton)
        self.Bind(wx.EVT_TREE_SEL_CHANGED, self.OnNodeSelected, self.tree)
        self.Bind(wx.EVT_CLOSE, self.OnClose)

    def OnExpandButton(self, e):
        self.tree.ExpandAll()

    def __del__(self):
        print('소멸합니다.')

    def OnClose(self, event):
        frame.Destroy()

    def OnNodeSelected(self, e):
        selected = self.tree.GetSelection()
        self.staticText.SetLabel(self.tree.GetItemText(selected))

        self.mainPanel.Layout()


if __name__ == '__main__':
    app = wx.App(redirect=True)
    frame = MyFrame()
    wnd = wx.Frame(None, wx.ID_ANY, "")
    wnd.CenterOnScreen()
    app.SetTopWindow(wnd)
    frame.Show()
    app.MainLoop()
    
