# -*- coding: utf-8 -*-
#Created on 2019년 @author: 권달현
조={};서문={};조문={};부칙 = {};bubname='교육세법'
편=장=절=관=항=조={} 
서문['']={}
서문['교육세']={}
서문['[시행 2019. 1. 1] [법률 제16095호, 2018. 12. 31, 일부개정']={}
서문['기획재정부(조세특례제도과) 044-215-413']={}
제1조_=' 제1조 (목적) '
제1조={}
제1조['교육세법 제1조 (목적)']={}
조문['제1조 (목적)']=제1조
조['제1조 (목적)']=제1조
제1조1항_='이 법은 교육의 질적 향상을 도모하기 위하여 필요한 교육재정의 확충에 드는 재원을 확보함을 목적으로 한다.'
제1조1항={}
제1조[제1조1항_]=제1조1항
제1조['[전문개정 2010. 12. 27.]']={}
제2조_=' 제2조 (정의) '
제2조={}
제2조['교육세법 제2조 (정의)']={}
조문['제2조 (정의)']=제2조
조['제2조 (정의)']=제2조
제2조1항_='이 법에서 사용하는 용어의 뜻은 이 법에서 정하는 것을 제외하고는 「국세기본법」, 「개별소비세법」, 「교통ㆍ에너지ㆍ환경세법」 및 「주세법」에서 정하는 바에 따른다.'
제2조1항={}
제2조[제2조1항_]=제2조1항
제2조['[전문개정 2010. 12. 27.]']={}
제3조_=' 제3조 (납세의무자) '
제3조={}
제3조['교육세법 제3조 (납세의무자)']={}
조문['제3조 (납세의무자)']=제3조
조['제3조 (납세의무자)']=제3조
제3조1항_='다음 각 호의 어느 하나에 해당하는 자는 이 법에 따라 교육세를 납부할 의무를 진다. <개정 2014. 1. 1., 2014. 12. 23.>'
제3조1항={}
제3조[제3조1항_]=제3조1항
제3조1항1호_='1. 국내에서 금융업ㆍ보험업을 경영하는 자 중 별표에 규정하는 자(이하 "금융ㆍ보험업자"라 한다)'
제3조1항1호={}
제3조1항[제3조1항1호_]=제3조1항1호
제3조1항2호_='2. 「개별소비세법」에 따른 개별소비세(「개별소비세법」 제1조제2항제4호가목ㆍ나목ㆍ마목ㆍ사목ㆍ자목 및 같은 항 제6호의 물품에 대한 것은 제외한다. 이하 같다)의 납세의무자'
제3조1항2호={}
제3조1항[제3조1항2호_]=제3조1항2호
제3조1항3호_='3. 「교통ㆍ에너지ㆍ환경세법」에 따른 교통ㆍ에너지ㆍ환경세의 납세의무자'
제3조1항3호={}
제3조1항[제3조1항3호_]=제3조1항3호
제3조1항4호_='4. 「주세법」에 따른 주세(주정, 탁주, 약주에 대한 것은 제외한다. 이하 같다)의 납세의무자'
제3조1항4호={}
제3조1항[제3조1항4호_]=제3조1항4호
제3조['[전문개정 2010. 12. 27.]']={}
제4조_=' 제4조 (비과세) '
제4조={}
제4조['교육세법 제4조 (비과세)']={}
조문['제4조 (비과세)']=제4조
조['제4조 (비과세)']=제4조
제4조1항_='금융ㆍ보험업자가 하는 「공익신탁법」에 따른 공익신탁의 신탁재산에서 발생하는 수익금액에 대하여는 교육세를 부과하지 아니한다. <개정 2014. 3. 18.>'
제4조1항={}
제4조[제4조1항_]=제4조1항
제4조['[전문개정 2010. 12. 27.]']={}
제5조_=' 제5조 (과세표준과 세율) '
제5조={}
제5조['교육세법 제5조 (과세표준과 세율)']={}
조문['제5조 (과세표준과 세율)']=제5조
조['제5조 (과세표준과 세율)']=제5조
제5조1항_='①교육세는 다음 각 호의 과세표준에 해당 세율을 곱하여 계산한 금액을 그 세액으로 한다. 다만, 제1호의 경우에 「한국은행법」에 따른 한국은행과의 환매조건부외화자금매각거래(이하 "스와프거래"라 한다)와 관련하여 발생하는 수익금액에 대한 교육세액은 대통령령으로 정하는 바에 따라 스와프거래와 관련하여 발생하는 수익금액에서 그와 관련된 모든 비용을 공제한 금액을 초과하지 못한다.'
제5조1항={}
제5조[제5조1항_]=제5조1항
#제5조['']={}
제5조2항_='② 제1항 각 호에 따른 세율은 교육투자재원의 조달 또는 해당 물품의 수급상 필요한 경우 그 세율의 100분의 30의 범위에서 대통령령으로 조정할 수 있다.'
제5조2항={}
제5조[제5조2항_]=제5조2항
제5조3항_='③ 제1항제1호의 과세표준이 되는 수익금액이란 금융ㆍ보험업자가 수입한 이자, 배당금, 수수료, 보증료, 유가증권의 매각익ㆍ상환익(유가증권의 매각 또는 상환에 따라 지급받은 금액에서 「법인세법」 제41조에 따라 계산한 취득가액을 차감한 금액을 말한다), 보험료(책임준비금 및 비상위험준비금으로 적립되는 금액과 재보험료를 공제한다), 그 밖에 대통령령으로 정하는 금액을 말하며, 그 계산에 관하여는 대통령령으로 정한다.'
제5조3항={}
제5조[제5조3항_]=제5조3항
제5조4항_='④ 제1항제1호의 과세표준이 되는 수익금액은 제8조에 따른 각 과세기간분의 수익금액의 총액에 따른다.'
제5조4항={}
제5조[제5조4항_]=제5조4항
제5조['[전문개정 2010. 12. 27.]']={}
제6조_=' 제6조 (납세지) '
제6조={}
제6조['교육세법 제6조 (납세지)']={}
조문['제6조 (납세지)']=제6조
조['제6조 (납세지)']=제6조
제6조1항_='①금융ㆍ보험업자의 수익금액에 부과되는 교육세의 납세지는 그 금융ㆍ보험업자의 본점 또는 주사무소의 소재지(외국에 본점 또는 주사무소가 있는 경우에는 국내의 주된 사업장 소재지)로 한다. 다만, 금융ㆍ보험업자에게 둘 이상의 사업장이 있는 경우에는 대통령령으로 정하는 바에 따라 각 사업장 소재지를 납세지로 할 수 있다. <개정 2016. 3. 2.>'
제6조1항={}
제6조[제6조1항_]=제6조1항
제6조2항_='② 제1항에도 불구하고 「법인세법」 제2조제6호에 따른 연결납세방식(이하 "연결납세방식"이라 한다)을 적용받는 금융ㆍ보험업자의 수익금액에 부과되는 교육세의 납세지는 같은 조 제9호에 따른 연결모법인(연결모법인이 금융ㆍ보험업자인 경우로 한정한다)의 납세지로 한다. <신설 2016. 3. 2., 2018. 12. 24., 2018. 12. 31.>'
제6조2항={}
제6조[제6조2항_]=제6조2항
제6조['[전문개정 2010. 12. 27.]']={}
제7조_=' 제7조 (금융ㆍ보험업자의 수익금액의 귀속시기) '
제7조={}
제7조['교육세법 제7조 (금융ㆍ보험업자의 수익금액의 귀속시기)']={}
조문['제7조 (금융ㆍ보험업자의 수익금액의 귀속시기)']=제7조
조['제7조 (금융ㆍ보험업자의 수익금액의 귀속시기)']=제7조
제7조1항_='금융ㆍ보험업자의 수익금액의 귀속시기에 관하여는 「법인세법」 제40조 및 제43조를 준용한다.'
제7조1항={}
제7조[제7조1항_]=제7조1항
제7조['[전문개정 2010. 12. 27.]']={}
제8조_=' 제8조 (과세기간) '
제8조={}
제8조['교육세법 제8조 (과세기간)']={}
조문['제8조 (과세기간)']=제8조
조['제8조 (과세기간)']=제8조
제8조1항_='① 금융ㆍ보험업자의 수익금액에 부과되는 교육세의 과세기간은 다음 각 호와 같다. 다만, 사업연도의 변경, 해산, 청산, 합병ㆍ분할 등의 경우에는 「법인세법」 제7조 및 제8조제1항부터 제4항까지의 규정을 준용한다. <개정 2015. 12. 29., 2018. 12. 24.>'
제8조1항={}
제8조[제8조1항_]=제8조1항
제8조1항1호_='1. 납세의무자가 법인인 경우: 「법인세법」 제6조에 따른 사업연도'
제8조1항1호={}
제8조1항[제8조1항1호_]=제8조1항1호
제8조1항2호_='2. 납세의무자가 개인인 경우: 「소득세법」 제5조에 따른 과세기간'
제8조1항2호={}
제8조1항[제8조1항2호_]=제8조1항2호
제8조2항_='② 신규로 금융ㆍ보험업자에 속하게 되는 자에 대한 최초의 과세기간은 사업 개시일부터 그 날이 속하는 과세기간의 종료일까지로 한다.'
제8조2항={}
제8조[제8조2항_]=제8조2항
제8조3항_='③ 금융ㆍ보험업자가 폐업하는 경우의 과세기간은 폐업일이 속하는 과세기간의 개시일부터 폐업일까지로 한다.'
제8조3항={}
제8조[제8조3항_]=제8조3항
제8조['[전문개정 2010. 12. 27.]']={}
제8_02조_=' 제8조의2(중간예납) '
제8_02조={}
제8_02조['교육세법 제8조의2(중간예납)']={}
조문['제8조의2(중간예납)']=제8_02조
조['제8조의2(중간예납)']=제8_02조
제8_02조1항_='① 금융ㆍ보험업자(제8조제1항제1호의 사업연도가 3개월 이하인 법인은 제외한다)는 과세기간 중 다음 각 호에서 규정하는 기간(이하 "중간예납기간"이라 한다)이 끝난 후 2개월 이내에 직전 과세기간의 교육세로서 확정된 산출세액에서 직전 과세기간의 월수로 나눈 금액에 3을 곱하여 계산한 금액(이하 "중간예납세액"이라 한다)을 대통령령으로 정하는 바에 따라 납세지 관할 세무서, 한국은행(그 대리점을 포함한다) 또는 체신관서에 납부하여야 한다. 다만, 새로 설립된 법인으로서 설립 후 최초 과세기간인 경우, 직전 최초 과세기간의 교육세로서 확정된 산출세액이 없는 경우 및 중간예납기간의 납부기한까지 직전 과세기간의 교육세액이 확정되지 아니한 경우에는 중간예납세액을 0으로 한다.'
제8_02조1항={}
제8_02조[제8_02조1항_]=제8_02조1항
제8_02조1항1호_='1. 제1차 중간예납기간: 직전 과세기간 종료 후 최초 3개월'
제8_02조1항1호={}
제8_02조1항[제8_02조1항1호_]=제8_02조1항1호
제8_02조1항2호_='2. 제2차 중간예납기간: 제1차 중간예납기간 종료 후 3개월'
제8_02조1항2호={}
제8_02조1항[제8_02조1항2호_]=제8_02조1항2호
제8_02조1항3호_='3. 제3차 중간예납기간: 제2차 중간예납기간 종료 후 3개월'
제8_02조1항3호={}
제8_02조1항[제8_02조1항3호_]=제8_02조1항3호
제8_02조2항_='② 제1항에도 불구하고 합병, 분할, 사업연도의 변경 등이 있는 경우의 중간예납에 대해서는 대통령령으로 정한다.'
제8_02조2항={}
제8_02조[제8_02조2항_]=제8_02조2항
제8_02조['[본조신설 2015. 12. 29.]']={}
제9조_=' 제9조 (신고ㆍ납부) '
제9조={}
제9조['교육세법 제9조 (신고ㆍ납부)']={}
조문['제9조 (신고ㆍ납부)']=제9조
조['제9조 (신고ㆍ납부)']=제9조
제9조1항_='① 금융ㆍ보험업자는 각 과세기간의 과세표준에 대한 산출세액에서 중간예납세액을 공제한 후 과세기간 종료일이 속하는 달의 말일부터 3개월(연결납세방식을 적용받는 금융ㆍ보험업자의 경우에는 4개월) 이내에 납세지 관할 세무서장에게 신고함과 동시에 세액을 납부하여야 한다. 다만, 중간예납세액이 과세기간의 과세표준에 대한 산출세액을 초과하는 경우 그 초과하는 금액은 「국세기본법」 제51조에 따라 환급하거나 다른 국세, 가산금 및 체납처분비에 충당하여야 한다. <개정 2015. 12. 29., 2016. 12. 20., 2017. 12. 30., 2018. 12. 31.>'
제9조1항={}
제9조[제9조1항_]=제9조1항
제9조1항1호_='1. 삭제 <2015. 12. 29.>'
제9조1항1호={}
제9조1항[제9조1항1호_]=제9조1항1호
제9조1항2호_='2. 삭제 <2015. 12. 29.>'
제9조1항2호={}
제9조1항[제9조1항2호_]=제9조1항2호
제9조1항3호_='3. 삭제 <2015. 12. 29.>'
제9조1항3호={}
제9조1항[제9조1항3호_]=제9조1항3호
제9조1항4호_='4. 삭제 <2015. 12. 29.>'
제9조1항4호={}
제9조1항[제9조1항4호_]=제9조1항4호
제9조2항_='② 제3조제2호부터 제4호까지의 규정에 따른 납세의무자는 해당 세법에 따라 해당 세액을 신고ㆍ납부하는 때에는 그에 대한 교육세를 신고ㆍ납부하여야 한다.'
제9조2항={}
제9조[제9조2항_]=제9조2항
제9조3항_='③ 제1항 및 제2항에 따른 신고ㆍ납부에 필요한 사항은 대통령령으로 정한다.'
제9조3항={}
제9조[제9조3항_]=제9조3항
제9조['[전문개정 2010. 12. 27.]']={}
제10조_=' 제10조 (부과와 징수) '
제10조={}
제10조['교육세법 제10조 (부과와 징수)']={}
조문['제10조 (부과와 징수)']=제10조
조['제10조 (부과와 징수)']=제10조
제10조1항_='① 납세지 관할 세무서장은 제9조제1항에 따라 교육세를 신고하여야 할 자가 신고하지 아니하거나 신고의 내용에 오류 또는 탈루가 있을 때에는 과세표준과 세액을 결정 또는 경정하며, 그 결정 또는 경정한 과세표준과 세액에 오류 또는 탈루가 있는 것이 발견된 때에는 경정 또는 재경정한다. <개정 2016. 12. 20.>'
제10조1항={}
제10조[제10조1항_]=제10조1항
제10조2항_='② 납세지 관할 세무서장은 제9조제1항에 따라 신고한 세액을 납부하지 아니하거나 미달하게 납부한 경우에 그 미납부세액을 제1항에 따라 결정ㆍ경정 또는 재경정을 한 때에는 추가로 납부하여야 할 세액을 즉시 징수하여야 한다. <개정 2016. 12. 20.>'
제10조2항={}
제10조[제10조2항_]=제10조2항
제10조3항_='③ 개별소비세액, 교통ㆍ에너지ㆍ환경세액 또는 주세액에 부과되는 교육세는 납세지 관할 세무서장이 개별소비세, 교통ㆍ에너지ㆍ환경세 또는 주세의 부과ㆍ징수의 예에 따라 부과ㆍ징수한다. <개정 2016. 12. 20.>'
제10조3항={}
제10조[제10조3항_]=제10조3항
제10조4항_='④ 납세지 관할 세무서장은 금융ㆍ보험업자(제8조제1항제1호의 사업연도가 3개월 이하인 법인은 제외한다)가 제8조의2에 따라 납부하여야 할 중간예납세액의 전부 또는 일부를 납부하지 아니하면 그 미납된 중간예납세액을 「국세징수법」에 따라 징수하여야 한다. <신설 2016. 12. 20.>'
제10조4항={}
제10조[제10조4항_]=제10조4항
제10조5항_='⑤ 제4항에도 불구하고 다음 각 호의 어느 하나에 해당하는 법인의 분할 후 최초의 사업연도에 대한 중간예납세액을 납부하지 아니한 경우에는 제8조의2제2항에 따라 계산한 중간예납세액을 결정하여 「국세징수법」에 따라 징수하여야 한다. <신설 2016. 12. 20.>'
제10조5항={}
제10조[제10조5항_]=제10조5항
제10조5항1호_='1. 분할에 따라 설립되는 법인'
제10조5항1호={}
제10조5항[제10조5항1호_]=제10조5항1호
제10조5항2호_='2. 분할되는 법인의 일부가 다른 법인과 합병하여 그 다른 법인이 존속하는 경우 그 다른 법인'
제10조5항2호={}
제10조5항[제10조5항2호_]=제10조5항2호
제10조['[전문개정 2010. 12. 27.]']={}
제11조_=' 제11조 삭제  '
제11조={}
제11조['교육세법 제11조 삭제 ']={}
조문['제11조 삭제 ']=제11조
조['제11조 삭제 ']=제11조
제12조_=' 제12조 (환급) '
제12조={}
제12조['교육세법 제12조 (환급)']={}
조문['제12조 (환급)']=제12조
조['제12조 (환급)']=제12조
제12조1항_='① 금융ㆍ보험업자의 수익금액에 부과되는 교육세로서 납부한 금액 중 잘못 납부하거나 초과하여 납부한 금액의 환급에 관하여는 「국세기본법」 제51조, 제51조의2 및 제52조부터 제54조까지의 규정을 준용한다.'
제12조1항={}
제12조[제12조1항_]=제12조1항
제12조2항_='② 개별소비세액, 교통ㆍ에너지ㆍ환경세액 또는 주세액에 부과되는 교육세로서 납부한 금액 중 잘못 납부하거나 초과하여 납부한 금액과 「개별소비세법」ㆍ「교통ㆍ에너지ㆍ환경세법」 또는 「주세법」에 따라 개별소비세액, 교통ㆍ에너지ㆍ환경세액 또는 주세액을 환급하는 경우의 해당 세액에 부과된 교육세의 환급에 관하여는 「국세기본법」 제51조, 제51조의2 및 제52조부터 제54조까지의 규정과 「개별소비세법」 제20조ㆍ제20조의2, 「교통ㆍ에너지ㆍ환경세법」 제17조 및 「주세법」 제34조ㆍ제35조를 준용한다.'
제12조2항={}
제12조[제12조2항_]=제12조2항
제12조['[전문개정 2010. 12. 27.]']={}
제13조_=' 제13조 (필요경비 또는 손금 불산입) '
제13조={}
제13조['교육세법 제13조 (필요경비 또는 손금 불산입)']={}
조문['제13조 (필요경비 또는 손금 불산입)']=제13조
조['제13조 (필요경비 또는 손금 불산입)']=제13조
제13조1항_='교육세의 과세표준이 되는 세액으로서 「소득세법」 또는 「법인세법」에 따라 필요경비 또는 손금에 산입되지 아니하는 세액에 부과된 교육세는 「소득세법」 또는 「법인세법」에 따른 소득금액을 계산할 때 필요경비 또는 손금에 산입하지 아니한다.'
제13조1항={}
제13조[제13조1항_]=제13조1항
제13조['[전문개정 2010. 12. 27.]']={}
부칙['부칙  <제16095호, 2018. 12. 31.']={}
부칙['제1조(시행일) 이 법은 2019년 1월 1일부터 시행한다']={}
부칙['제2조(연결납세방식을 적용받는 금융ㆍ보험업자의 교육세 신고ㆍ납부에 관한 적용례 등) ① 제9조제1항 본문의 개정규정은 이 법 시행일 이후 교육세를 신고ㆍ납부하는 분부터 적용한다']={}
부칙['② 제1항에도 불구하고 이 법 시행 당시 종전의 제9조제1항 본문에 따른 신고ㆍ납부기한이 경과한 분에 관하여는 종전의 규정에 따른다']={}
bub={'서문':서문,'조문':조문,'조별':조,'부칙':부칙}
    
import wx
class MyFrame(wx.Frame):
    def __init__(self):
        wx.Frame.__init__(self, parent=None, title=bubname)
        self.SetSize(620, 520)
        self.mainPanel = wx.Panel(self)
        self.expandButton = wx.Button(self.mainPanel, label=bubname)
        self.tree = wx.TreeCtrl(self.mainPanel)
        root = self.tree.AddRoot(bubname)
        for i in bub:
            ii = self.tree.AppendItem(root, i)
            for j in bub[i]:
                jj = self.tree.AppendItem(ii, j)
                for k in bub[i][j]:
                    kk = self.tree.AppendItem(jj, k)
                    for m in bub[i][j][k]:
                        mm = self.tree.AppendItem(kk, m)
                        for n in bub[i][j][k][m]:
                            nn = self.tree.AppendItem(mm, n)
                            for p in bub[i][j][k][m][n]:
                                pp = self.tree.AppendItem(nn, p)
                                for q in bub[i][j][k][m][n][p]:
                                    qq=self.tree.AppendItem(pp,q)
                                    for r in bub[i][j][k][m][n][p][q]:
                                        rr=self.tree.AppendItem(qq,r)
                                        for s in bub[i][j][k][m][n][p][q][r]:
                                            ss = self.tree.AppendItem(rr, s)
                                            for t in bub[i][j][k][m][n][p][q][r][s]:
                                                tt = self.tree.AppendItem(ss, t)
                                                for u in bub[i][j][k][m][n][p][q][r][s][t]:
                                                    uu = self.tree.AppendItem(tt, u)
                                                    for v in bub[i][j][k][m][n][p][q][r][s][t][u]:
                                                        vv = self.tree.AppendItem(uu, v)
        self.staticText = wx.TextCtrl(self.mainPanel, style=wx.TE_MULTILINE)
        self.vtBoxSizer = wx.BoxSizer(wx.VERTICAL)
        self.vtBoxSizer.Add(self.expandButton, 0, wx.EXPAND | wx.ALL, 5)
        self.vtBoxSizer.Add(self.tree, 5, wx.EXPAND | wx.ALL, 5)
        self.vtBoxSizer.Add(self.staticText, 0, wx.EXPAND | wx.ALL, 5)
        self.mainPanel.SetSizer(self.vtBoxSizer)
        self.Bind(wx.EVT_BUTTON, self.OnExpandButton, self.expandButton)
        self.Bind(wx.EVT_TREE_SEL_CHANGED, self.OnNodeSelected, self.tree)
        self.Bind(wx.EVT_CLOSE, self.OnClose)

    def OnExpandButton(self, e):
        self.tree.ExpandAll()

    def __del__(self):
        print('소멸합니다.')

    def OnClose(self, event):
        frame.Destroy()

    def OnNodeSelected(self, e):
        selected = self.tree.GetSelection()
        self.staticText.SetLabel(self.tree.GetItemText(selected))
        self.mainPanel.Layout()
if __name__ == '__main__':
    app = wx.App(redirect=True)
    frame = MyFrame()
    wnd = wx.Frame(None, wx.ID_ANY, "")
    wnd.CenterOnScreen()
    app.SetTopWindow(wnd)
    frame.Show()
    app.MainLoop()
    