# -*- coding: utf-8 -*-
#Created on 2019년 @author: 권달현
from 국세기본법 import *
import 국세기본법시행령,국세기본법시행규칙

제5_02조2항["국세기본법시행규칙 "+국세기본법시행규칙.제1조_]=국세기본법시행규칙.제1조
국세기본법시행령.제4_02조["국세기본법시행령 "+국세기본법시행령.제2조_]=국세기본법시행령.제2조



제1조["국세기본법시행령 "+국세기본법시행령.제1조_]=국세기본법시행령.제1조
제2조1항20호["국세기본법시행령 "+국세기본법시행령.제1_02조_]=국세기본법시행령.제1_02조
제5조3항["국세기본법시행령 "+국세기본법시행령.제1_03조_]=국세기본법시행령.제1_03조
제6조1항["국세기본법시행령 "+국세기본법시행령.제2조1항_]=국세기본법시행령.제2조1항
제6조2항["국세기본법시행령 "+국세기본법시행령.제2조2항_]=국세기본법시행령.제2조2항
제6조["국세기본법시행령 "+국세기본법시행령.제2조_]=국세기본법시행령.제2조
제6조["국세기본법시행령 "+국세기본법시행령.제2_02조_]=국세기본법시행령.제2_02조
제6조["국세기본법시행령 "+국세기본법시행령.제2_03조_]=국세기본법시행령.제2_03조
제6조1항["국세기본법시행령 "+국세기본법시행령.제2_02조_]=국세기본법시행령.제2_02조
국세기본법시행령.제2_02조["국세기본법시행령 "+국세기본법시행령.제2_03조_]=국세기본법시행령.제2_03조
제6조["국세기본법시행령 "+국세기본법시행령.제3조_]=국세기본법시행령.제3조
제6조["국세기본법시행령 "+국세기본법시행령.제4조_]=국세기본법시행령.제4조
제6_02조1항3호["국세기본법시행령 "+국세기본법시행령.제4_02조_]=국세기본법시행령.제4_02조
제6_02조2항["국세기본법시행령 "+국세기본법시행령.제4_03조_]=국세기본법시행령.제4_03조
제9조["국세기본법시행령 "+국세기본법시행령.제5조_]=국세기본법시행령.제5조
제10조2항["국세기본법시행령 "+국세기본법시행령.제5_02조_]=국세기본법시행령.제5_02조
제10조6항["국세기본법시행령 "+국세기본법시행령.제6조_]=국세기본법시행령.제6조
제10조8항["국세기본법시행령 "+국세기본법시행령.제6_02조_]=국세기본법시행령.제6_02조
제10조9항["국세기본법시행령 "+국세기본법시행령.제6_03조_]=국세기본법시행령.제6_03조
제10조10항["국세기본법시행령 "+국세기본법시행령.제6_04조_]=국세기본법시행령.제6_04조
제11조1항2호["국세기본법시행령 "+국세기본법시행령.제7조_]=국세기본법시행령.제7조
제11조1항3호["국세기본법시행령 "+국세기본법시행령.제7_02조_]=국세기본법시행령.제7_02조
제13조2항["국세기본법시행령 "+국세기본법시행령.제8조_]=국세기본법시행령.제8조
제13조5항["국세기본법시행령 "+국세기본법시행령.제9조_]=국세기본법시행령.제9조
제13조6항["국세기본법시행령 "+국세기본법시행령.제9_02조_]=국세기본법시행령.제9_02조
제18_02조["국세기본법시행령 "+국세기본법시행령.제9_03조_]=국세기본법시행령.제9_03조
국세기본법시행령.제9_03조3항["국세기본법시행령 "+국세기본법시행령.제9_04조_]=국세기본법시행령.제9_04조
제18조["국세기본법시행령 "+국세기본법시행령.제10조_]=국세기본법시행령.제10조
국세기본법시행령.제10조3항["국세기본법시행령 "+국세기본법시행령.제9_03조_]=국세기본법시행령.제9_03조
국세기본법시행령.제10조5항1호["국세기본법시행령 "+국세기본법시행령.제9_03조_]=국세기본법시행령.제9_03조
제22조1항["국세기본법시행령 "+국세기본법시행령.제10_02조_]=국세기본법시행령.제10_02조

제24조["국세기본법시행령 "+국세기본법시행령.제11조_]=국세기본법시행령.제11조
제24조1항["국세기본법시행령 "+국세기본법시행령.제11조_]=국세기본법시행령.제11조
제24조4항["국세기본법시행령 "+국세기본법시행령.제11조_]=국세기본법시행령.제11조

제24조["국세기본법시행령 "+국세기본법시행령.제12조_]=국세기본법시행령.제12조
제24조3항["국세기본법시행령 "+국세기본법시행령.제12조_]=국세기본법시행령.제12조

제26_02조["국세기본법시행령 "+국세기본법시행령.제12_02조_]=국세기본법시행령.제12_02조
제26_02조1항["국세기본법시행령 "+국세기본법시행령.제12_02조_]=국세기본법시행령.제12_02조

제26_02조["국세기본법시행령 "+국세기본법시행령.제12_03조_]=국세기본법시행령.제12_03조
제26_02조5항["국세기본법시행령 "+국세기본법시행령.제12_03조_]=국세기본법시행령.제12_03조

제27조["국세기본법시행령 "+국세기본법시행령.제12_04조_]=국세기본법시행령.제12_04조
제27조3항["국세기본법시행령 "+국세기본법시행령.제12_04조_]=국세기본법시행령.제12_04조

제29조["국세기본법시행령 "+국세기본법시행령.제13조_]=국세기본법시행령.제13조
제30조["국세기본법시행령 "+국세기본법시행령.제13조_]=국세기본법시행령.제13조
제31조["국세기본법시행령 "+국세기본법시행령.제14조_]=국세기본법시행령.제14조
제32조["국세기본법시행령 "+국세기본법시행령.제15조_]=국세기본법시행령.제15조
제33조["국세기본법시행령 "+국세기본법시행령.제16조_]=국세기본법시행령.제16조
제34조["국세기본법시행령 "+국세기본법시행령.제17조_]=국세기본법시행령.제17조
제35조["국세기본법시행령 "+국세기본법시행령.제18조_]=국세기본법시행령.제18조
제35조1항["국세기본법시행령 "+국세기본법시행령.제18조_]=국세기본법시행령.제18조
제35조3항["국세기본법시행령 "+국세기본법시행령.제18조_]=국세기본법시행령.제18조
제35조["국세기본법시행령 "+국세기본법시행령.제18_02조_]=국세기본법시행령.제18_02조
제35조4항["국세기본법시행령 "+국세기본법시행령.제18_02조_]=국세기본법시행령.제18_02조

제38조["국세기본법시행령 "+국세기본법시행령.제19조_]=국세기본법시행령.제19조
제38조2항["국세기본법시행령 "+국세기본법시행령.제19조_]=국세기본법시행령.제19조
제39조["국세기본법시행령 "+국세기본법시행령.제20조_]=국세기본법시행령.제20조
제40조["국세기본법시행령 "+국세기본법시행령.제21조_]=국세기본법시행령.제21조
제41조["국세기본법시행령 "+국세기본법시행령.제22조_]=국세기본법시행령.제22조
제41조["국세기본법시행령 "+국세기본법시행령.제23조_]=국세기본법시행령.제23조
제43조["국세기본법시행령 "+국세기본법시행령.제24조_]=국세기본법시행령.제24조
제45조["국세기본법시행령 "+국세기본법시행령.제25조_]=국세기본법시행령.제25조
제45_02조["국세기본법시행령 "+국세기본법시행령.제25_02조_]=국세기본법시행령.제25_02조
제45_02조["국세기본법시행령 "+국세기본법시행령.제25_03조_]=국세기본법시행령.제25_03조
제45_03조["국세기본법시행령 "+국세기본법시행령.제25_04조_]=국세기본법시행령.제25_04조
제46조["국세기본법시행령 "+국세기본법시행령.제26조_]=국세기본법시행령.제26조
제46_02조["국세기본법시행령 "+국세기본법시행령.제26_02조_]=국세기본법시행령.제26_02조
제47_02조["국세기본법시행령 "+국세기본법시행령.제27조_]=국세기본법시행령.제27조
제47_03조["국세기본법시행령 "+국세기본법시행령.제27_02조_]=국세기본법시행령.제27_02조
제47_04조["국세기본법시행령 "+국세기본법시행령.제27_04조_]=국세기본법시행령.제27_04조
제48조["국세기본법시행령 "+국세기본법시행령.제28조_]=국세기본법시행령.제28조
제48조["국세기본법시행령 "+국세기본법시행령.제29조_]=국세기본법시행령.제29조
제49조["국세기본법시행령 "+국세기본법시행령.제29_02조_]=국세기본법시행령.제29_02조
제51조["국세기본법시행령 "+국세기본법시행령.제31조_]=국세기본법시행령.제31조
제51조["국세기본법시행령 "+국세기본법시행령.제32조_]=국세기본법시행령.제32조
제51조["국세기본법시행령 "+국세기본법시행령.제33조_]=국세기본법시행령.제33조
제51조["국세기본법시행령 "+국세기본법시행령.제33_02조_]=국세기본법시행령.제33_02조
제51조["국세기본법시행령 "+국세기본법시행령.제34조_]=국세기본법시행령.제34조
제51조["국세기본법시행령 "+국세기본법시행령.제35조_]=국세기본법시행령.제35조
제51조["국세기본법시행령 "+국세기본법시행령.제35조_]=국세기본법시행령.제36조
제51조["국세기본법시행령 "+국세기본법시행령.제35조_]=국세기본법시행령.제37조
제51조["국세기본법시행령 "+국세기본법시행령.제35조_]=국세기본법시행령.제38조
제51조["국세기본법시행령 "+국세기본법시행령.제35조_]=국세기본법시행령.제39조
제51조["국세기본법시행령 "+국세기본법시행령.제35조_]=국세기본법시행령.제43조
제51_02조["국세기본법시행령 "+국세기본법시행령.제43_02조_]=국세기본법시행령.제43_02조
제52조["국세기본법시행령 "+국세기본법시행령.제43_03조_]=국세기본법시행령.제43_03조
제53조["국세기본법시행령 "+국세기본법시행령.제43_04조_]=국세기본법시행령.제43_04조
제55조["국세기본법시행령 "+국세기본법시행령.제44_02조_]=국세기본법시행령.제44_02조
제57조["국세기본법시행령 "+국세기본법시행령.제45조_]=국세기본법시행령.제45조
제58조["국세기본법시행령 "+국세기본법시행령.제46조_]=국세기본법시행령.제46조
제58조["국세기본법시행령 "+국세기본법시행령.제47조_]=국세기본법시행령.제47조
국세기본법시행령.제44_02조["국세기본법시행령 "+국세기본법시행령.제48조_]=국세기본법시행령.제48조
제59_02조["국세기본법시행령 "+국세기본법시행령.제48_02조_]=국세기본법시행령.제48_02조
제60조["국세기본법시행령 "+국세기본법시행령.제49조_]=국세기본법시행령.제49조
제62조["국세기본법시행령 "+국세기본법시행령.제50조_]=국세기본법시행령.제50조
제62조["국세기본법시행령 "+국세기본법시행령.제51조_]=국세기본법시행령.제51조
제63조["국세기본법시행령 "+국세기본법시행령.제52조_]=국세기본법시행령.제52조
제63조["국세기본법시행령 "+국세기본법시행령.제52_02조_]=국세기본법시행령.제52_02조
제66_02조["국세기본법시행령 "+국세기본법시행령.제53조_]=국세기본법시행령.제53조
제65_02조["국세기본법시행령 "+국세기본법시행령.제53_02조_]=국세기본법시행령.제53_02조
제66조["국세기본법시행령 "+국세기본법시행령.제54조_]=국세기본법시행령.제54조
국세기본법시행령.제50조["국세기본법시행령 "+국세기본법시행령.제55조_]=국세기본법시행령.제55조
제69조["국세기본법시행령 "+국세기본법시행령.제55조_]=국세기본법시행령.제55조
제67조["국세기본법시행령 "+국세기본법시행령.제55_02조_]=국세기본법시행령.제55_02조
제67조["국세기본법시행령 "+국세기본법시행령.제55_03조_]=국세기본법시행령.제55_03조
제67조["국세기본법시행령 "+국세기본법시행령.제55_04조_]=국세기본법시행령.제55_04조
제71조["국세기본법시행령 "+국세기본법시행령.제56조_]=국세기본법시행령.제56조
제72조["국세기본법시행령 "+국세기본법시행령.제57조_]=국세기본법시행령.제57조
제72조["국세기본법시행령 "+국세기본법시행령.제58조_]=국세기본법시행령.제58조
제74조["국세기본법시행령 "+국세기본법시행령.제60조_]=국세기본법시행령.제60조
제76조["국세기본법시행령 "+국세기본법시행령.제61조_]=국세기본법시행령.제61조
제78조["국세기본법시행령 "+국세기본법시행령.제62조_]=국세기본법시행령.제62조
제78조["국세기본법시행령 "+국세기본법시행령.제62_02조_]=국세기본법시행령.제62_02조





import wx
class MyFrame(wx.Frame):
    def __init__(self):
        wx.Frame.__init__(self, parent=None, title=bubname)
        self.SetSize(620, 520)
        self.mainPanel = wx.Panel(self)
        self.expandButton = wx.Button(self.mainPanel, label=bubname)
        self.tree = wx.TreeCtrl(self.mainPanel)
        root = self.tree.AddRoot(bubname)
        for i in bub:
            ii = self.tree.AppendItem(root, i)
            for j in bub[i]:
                jj = self.tree.AppendItem(ii, j)
                for k in bub[i][j]:
                    kk = self.tree.AppendItem(jj, k)
                    for m in bub[i][j][k]:
                        mm = self.tree.AppendItem(kk, m)
                        for n in bub[i][j][k][m]:
                            nn = self.tree.AppendItem(mm, n)
                            for p in bub[i][j][k][m][n]:
                                pp = self.tree.AppendItem(nn, p)
                                for q in bub[i][j][k][m][n][p]:
                                    qq = self.tree.AppendItem(pp, q)
                                    for r in bub[i][j][k][m][n][p][q]:
                                        rr = self.tree.AppendItem(qq, r)
                                        for s in bub[i][j][k][m][n][p][q][r]:
                                            ss = self.tree.AppendItem(rr, s)
                                            for t in bub[i][j][k][m][n][p][q][r][s]:
                                                tt = self.tree.AppendItem(ss, t)
                                                for u in bub[i][j][k][m][n][p][q][r][s][t]:
                                                    uu = self.tree.AppendItem(tt, u)
                                                    for v in bub[i][j][k][m][n][p][q][r][s][t][u]:
                                                        vv = self.tree.AppendItem(uu, v)
        self.staticText = wx.TextCtrl(self.mainPanel, style=wx.TE_MULTILINE)
        self.vtBoxSizer = wx.BoxSizer(wx.VERTICAL)
        self.vtBoxSizer.Add(self.expandButton, 0, wx.EXPAND | wx.ALL, 5)
        self.vtBoxSizer.Add(self.tree, 5, wx.EXPAND | wx.ALL, 5)
        self.vtBoxSizer.Add(self.staticText, 0, wx.EXPAND | wx.ALL, 5)
        self.mainPanel.SetSizer(self.vtBoxSizer)
        self.Bind(wx.EVT_BUTTON, self.OnExpandButton, self.expandButton)
        self.Bind(wx.EVT_TREE_SEL_CHANGED, self.OnNodeSelected, self.tree)
        self.Bind(wx.EVT_CLOSE, self.OnClose)

    def OnExpandButton(self, e):
        self.tree.ExpandAll()

    def __del__(self):
        print('소멸합니다.')

    def OnClose(self, event):
        frame.Destroy()

    def OnNodeSelected(self, e):
        selected = self.tree.GetSelection()
        self.staticText.SetLabel(self.tree.GetItemText(selected))
        self.mainPanel.Layout()
if __name__ == '__main__':
    app = wx.App(redirect=True)
    frame = MyFrame()
    wnd = wx.Frame(None, wx.ID_ANY, "")
    wnd.CenterOnScreen()
    app.SetTopWindow(wnd)
    frame.Show()
    app.MainLoop()