# -*- coding: utf-8 -*-
#Created on 2018-12-24 @author: 권달현
법인세_기부금한도초과액={
	'...':{},
	}
법인세_기부금손금추인액={
	'...':{},
	}
법인세_기부금한도초과및이월액손금산입={
        '기부금한도 초과':{
            '법정기부금':{
                '종류':{
                    '국가 등 기증품':{},
                    '국방헌금':{},
                    '이재민 구호금품':{},
                    '문화예술진흥기금':{},
                    '등':{},
                    },
                '한도':{
                    '소득금액 50% ':{},
                    },
                },
            '지정기부금':{
                '종류':{
                    '지정기부금단체에 지출하는 기부금':{},
                    '등':{},
                    },
                '한도':{
                    '소득금액 10%':{},
                    },
                },
            '비지정기부금':{
                '종류':{
                    '업무무관 무상지출금액':{},
                    '저가양도 및 고가매입가액 ':{},
                    },
                '한도':{
                    '전체 손금불산입 ':{},
                        },
                    },
            },
        '기부금 이월공제':{
            '이월공제기간':{
                '법정기부금':{
                    '5년':{},
                    '2014. 1. 1. 이후 개시하는 사업연도에 기부하는 분부터 적용(종전 3년)':{},
                    },
                '지정기부금':{
                    '5년':{},
                    },
                },
            },
        }
법인세={
        "기부금의 의의 및 범위":{
            "기부금의 의의":{},
            "기부금의 주요 내용":{},
            },
        '기부금의 종류':{
            "기부금의 종류":{},
            "법정기부금":{},
            "지정기부금":{},
            "비지정기부금(=기타기부금 또는 전액 손금불산입기부금)":{},
            },
        '기부금의 가액 등':{
            "개요":{},
            "현물기부의 가액계산":{},
            "자본적지출로 보는 기부금":{},
            },
        "귀속시기":{},
        "기준소득금액":{
            "해당 사업연도 소득금액":{},
            "이월결손금":{},
            "기준소득금액":{},
            },
        '기부금의 손금산입 범위액':{},
        "법인세_기부금한도초과및이월액손금산입":법인세_기부금한도초과및이월액손금산입,
        '기부금의 이월공제':법인세_기부금손금추인액,
        '기부금 영수증 및 기부금 영수증 발급대장':{
            "기부금영수증":{},
            "발급명세의 작성,보관의무":{},
            "기부금명세서의 제출":{},
        },
        '기획재정부장관이 지정하는 지정기부금 대상단체':{},
        '기부금 조정명세서 작성사례':{},
        "기부금의 손금불산입 ": {

                "법인이 지출하는 기부금은 일정범위 내에서 손금에 산입하는 기부금(지정 기부금, 법정기부금)과 손금에 산입하지 않는 기타의 기부금으로 구분되며, 손금산입 범위액을 초과하는 기부금과 기타의 기부금은 손금에 산입할 수 없습니다. ": {},
                "* 법정기부금의 이월공제기간을 지정기부금의 이월공제기간과 동일하게 2014.1.1. 이후 개시하는 사업연도에 기부하는 분부터 5년으로 연장(법법§24④). ": {},
                "(1) 기부금의 종류 ": {

                    "기부금이라 함은 법인이 특수관계인 외의 자에게 당해 법인의 사업과 직접 관계없이 무상으로 지출하는 재산적 증여의 가액을 말하며, 손금산입 범위에 따라 대상 기부금을 구분하면 다음과 같습니다. ": {},
                    "① 법정기부금(법법§24②) ": {

                        "2011.7.1.이후 지출하는 기부금부터 종전 특례기부금(조특법§73)은 삭제되고 법정 기부금에 통합되었으며, 기부금 구분 공익성기준을 명확히 하였습니다(2010.12.30.": {},
                        "법법§24 개정).": {},
                        "  국가나 지방자치단체에 무상으로 기증하는 금품의 가액 다만,  기부금품의 모집 및 사용에 관한 법률 의 적용을 받는 기부금품은 동법 제5조 제2항의 규정에 의하여 접수하는 것에 한합니다. ": {},
                        "☞ 법인이 개인 또는 다른 법인에게 자산을 기증하고 이를 기증받은 자가 지체 없이 다시 국가 또는 지방자치단체에 기증한 금품의 가액을 포함합니다. ": {},
                        "  국방헌금과 국군장병 위문금품의 가액 ": {},
                        "☞ 국방헌금에는 예비군법에 의하여 설치된 예비군에 직접 지출하거나 국방부장관의 승인을 얻은 기관 또는 단체를 통하여 지출하는 기부금을 포함합니다. ": {},
                        "  천재지변으로 생기는 이재민을 위한 구호금품의 가액 ": {},
                        "☞ 천재지변에는  재난 및 안전관리 기본법  §60에 따라 특별재난지역으로 선포된 경우 그 선포의 사유가 된 재난을 포함(법령§36의2①) ": {},

                        "  다음의 기관(병원 제외)에 시설비 교육비 장학금 또는 연구비로 지출하는 기부금 ": {},
                        "  사립학교법 에 따른 사립학교  비영리 교육재단(국립 공립 사립학교의 시설비, 교육비, 장학금 또는 연구비 지급을 목적으로 설립된 비영리 재단법인으로 한정)   근로자직업능력 개발법 에 따른 기능대학   평생교육법 에 따른 전공대학의 명칭을 사용할 수 있는 평생교육시설 및원격대학 형태의 평생교육시설 ": {},
                        "☞  평생교육법 에 따른 전공대학은 2013.1.1. 이후 지출하는 분부터 적용합니다. ": {},
                        "  경제자유구역 및 제주국제자유도시의 외국교육기관 설립·운영에 관한 특별법 에 따라 설립된 외국교육기관   산업교육진흥 및 산학연협력촉진에 관한 법률 에 따른 산학협력단   한국과학기술원법 에 따른 한국과학기술원,  광주과학기술원법 에 따른 광주 과학기술원,  대구경북과학기술원법 에 따른 대구경북과학기술원 및  울산과학 기술원법 에 따른 울산과학기술원   국립대학법인 서울대학교 설립·운영에 관한 법률 에 따른 국립대학법인 서울 대학교,  국립대학법인 인천대학교 설립·운영에 관한 법률 에 따른 국립대학 법인 인천대학교   정부출연연구기관 등의 설립 운영 및 육성에 관한 법률 에 따라 설립된 한국개발연구원에 설치된 국제대학원   한국학중앙연구원 육성법 에 따라 설립된 한국학중앙연구원에 설치된 대학원   과학기술분야 정부출연연구기관 등의 설립 운영 및 육성에 관한 법률  제33조에 따라 설립된 대학원대학   재외국민의 교육지원 등에 관한 법률  제2조제3호에 따른 한국학교로서 아래 요건을 모두 충족하는 학교에 한합니다.": {},
                        "  기부금 모금액 및 그 활용 실적을 공개할 수 있는 인터넷 홈페이지가 개설되어 있을 것   기획재정부장관이 법정기부금단체 지정을 취소한 경우에는 그 취소된 날부터 3년, 법정기부금단체 재지정을 받지 못하게 된 경우에는 그 지정기간의 종료일부터 3년이 지났을 것 ": {},

                        "☞ 주무관청은 해당 학교 등의 신청을 받아 매 반기 종료일부터 1개월이 되는 날까지 기획재정부령이 정하는 서류를 갖추어 기획재정부장관에게 추천하고, 기획재정부 장관은 매 반기 종료일부터 4개월이 되는 날까지 기획재정부령으로 정합니다(기획재정부 령으로 정한 날이 속하는 연도의 1월 1일부터 6년간 법정기부금에 해당) (법령§36의2⑥ ⑦). ": {},
                        "  법정기부금단체로 지정된 해당 학교 등은 지정기간 동안 다음 의무를 이행하여야 합니다(법령§36의2⑧).": {},
                        "- 연간 기부금 모금액 및 그 활용실적을 다음 연도 3월 31일까지 기획재정부령으로 정하는 기부금모금액 및 활용실적명세서에 따라 국세청의 인터넷 홈페이지에 공개할 것(2014.1.1. 이후 기부금을 모금하거나 활용하는 분부터 적용합니다.) - 해당 단체의 홈페이지를 통하여 연간 기부금 모금액 및 그 활용실적을 다음 연도 3월 31일까지 공개할 것 - 해당 사업연도의 수익사업의 지출을 제외한 지출액의 100분의 80 이상을 직접 고유목적사업에 지출할 것(2012.2.2. 이후 최초로 지정 또는 재지정하는 분부터 적용합니다.)": {},
                        "  다음의 병원에 시설비 교육비 또는 연구비로 지출하는 기부금 ": {},
                        "  국립대학병원 설치법 에 따른 국립대학병원   국립대학치과병원 설치법 에 따른 국립대학치과병원   서울대학교병원 설치법 에 따른 서울대학교병원   서울대학교치과병원 설치법 에 따른 서울대학교치과병원   사립학교법 에 따른 사립학교가 운영하는 병원   암관리법 에 따른 국립암센터   지방의료원의 설립 및 운영에 관한 법률 에 따른 지방의료원   국립중앙의료원의 설립 및 운영에 관한 법률 에 따른 국립중앙의료원   대한적십자사 조직법 에 따른 대한적십자사가 운영하는 병원   한국보훈복지의료공단법 에 따른 한국보훈복지의료공단이 운영하는 병원   방사선 및 방사성동위원소 이용진흥법  제13조의2에 따른 한국원자력의학원   국민건강보험법 에 따른 국민건강보험공단이 운영하는 병원   산업재해보상보험법  제43조제1항제1호에 따른 의료기관 ": {},

                        "  사회복지사업, 그 밖의 사회복지활동의 지원에 필요한 재원을 모집·배분하는 것을 주된 목적으로 하는 비영리법인으로서 아래 요건을 모두 갖춘 법인에 지출하는 기부금 ": {},
                        " 기부금 모금액 및 그 활용실적을 공개할 수 있는 인터넷 홈페이지가 개설되어 있을 것": {},
                        "  주식회사의 외부감사에 관한 법률  제3조에 따른 감사인에게 회계감사를 받을 것": {},
                        "  상속세 및 증여세법  제50조의3(제5호는 제외한다)에 따른 결산서류등을 인터넷 홈페이지 또는 국세청 홈페이지를 통하여 공시할 것": {},
                        "  상속세 및 증여세법  제50조의2에 따른 전용계좌를 개설하여 사용할 것": {},
                        "  신청일 직전 5개 사업연도[설립일부터 신청일 직전 사업연도 종료일까지의 기간이 5년 미만인 경우에는 해당 법인의 설립일부터 신청일이 속하는 달의 직전 달의 종료일까지의 기간(1년 이상인 경우만 해당)] 평균 기부금 배분 지출액이 총 지출금액의 100분의 80 이상이고 기부금의 모집·배분 및 법인의 관리·운영에 사용한 비용이 기부금 수입금액의 100분의 10 이하일 것. 이 경우총 지출금액, 배분지출액 등의 계산에 관하여는 기획재정부령으로 정합니다.": {},
                        " 신청일 직전 5개 사업연도[설립일부터 신청일 직전 사업연도 종료일까지의 기간이 5년 미만인 경우에는 해당 법인이 설립한 사업연도부터 신청일 직전 사업연도 종료일까지의 기간(1년 이상인 경우만 해당)] 평균 개별 법인(단체를 포함한다. 이하 이 호에서 같다)별 기부금 배분지출액이 전체 배분지출액의 100분의 25 이하이고,  상속세 및 증여세법 시행령  제38조제10항에 따른 출연자 및 같은 영 제12조의2 제1항에 따른 출연자의 특수관계인으로서 같은항 제4호, 제5호 또는 제8호에 해당하는 비영리 법인에 대해서는 기부금 배분지출액이 없을 것": {},
                        " 기획재정부장관이 법정기부금단체 지정을 취소한 경우에는 그 취소된 날부터 3년, 법정기부금단체 재지정을 받지 못하게 된 경우에는 그 지정기간의 종료일부터 3년이 지났을 것 ": {},
                        "☞ 주무관청은 해당 법인의 신청을 받아 매 반기 종료일부터 1개월이 되는 날까지 기획 재정부령이 정하는 서류를 갖추어 기획재정부장관에게 추천하고, 기획재정부장관은 매 반기 종료일부터 4개월이 되는 날까지 기획재정부령으로 정합니다(기획재정부령으로 정한 날이 속하는 연도의 1월 1일부터 6년간 법정기부금에 해당)(영 36의2⑥ ⑦). ": {},

                        "  법정기부금단체로 지정된 해당 학교 등은 지정기간 동안 다음 의무를 이행하여야 하며(법령§36의2⑧), 법정기부금단체 요건충족 여부 및 의무를 기획재정부령이 정하는 바에 따라 주무관청에 보고하여야 합니다(법령§36의2⑨).": {},
                        "- 연간 기부금 모금액 및 그 활용실적을 다음 연도 3월 31일까지 기획재정부령으로 정하는 기부금모금액 및 활용실적명세서에 따라 국세청의 인터넷 홈페이지에 공개할 것(2014.1.1. 이후 기부금을 모금하거나 활용하는 분부터 적용합니다.)": {},
                        "- 해당 단체의 홈페이지를 통하여 연간 기부금 모금액 및 그 활용실적을 다음 연도 3월 31일까지 공개할 것": {},
                        "- 해당 사업연도의 수익사업의 지출을 제외한 지출액의 100분의 80 이상을 직접 고유목적사업에 지출할 것(2012.2.2. 이후 최초로 지정 또는 재지정하는 분부터 적용합니다.)": {},
                        "   공공기관의 운영에 관한 법률  제4조에 따른 공공기관(같은 법 제5조제3항제1호에 따른 공기업은 제외) 또는 법률에 따라 직접 설립된 기관으로서 아래의 요건을 갖춘 기관에 지출하는 기부금 ": {},
                        " 기부금 모금액 및 그 활용실적을 공개할 수 있는 인터넷 홈페이지가 개설되어 있을 것": {},
                        " 설립 목적이 사회복지·자선·문화·예술·교육·학술·장학 등 공익목적 활동을 수행하는 것일 것": {},
                        " 신청일 직전 5개 사업연도[설립일부터 신청일 직전 사업연도 종료일까지의 기간이 5년 미만인 경우에는 해당 법인의 설립일부터 신청일이 속하는 달의 직전 달의 종료일까지의 기간] 평균 정부지원금 및 기부금 합계액이 연간 총수입금액의 3분의 1 이상일 것. 이 경우 정부지원금 및 총 수입금액의 계산에 관하여는 기획재정부령으로 정합니다.": {},
                        " 기획재정부장관이 법정기부금단체 지정을 취소한 경우에는 그 취소된 날부터 3년, 법정기부금단체 재지정을 받지 못하게 된 경우에는 그 지정 기간의 종료일부터 3년이 지났을 것 ": {},

                        "☞ 주무관청은 해당 학교 등의 신청을 받아 매 반기 종료일부터 1개월이 되는 날까지 기획재정부령이 정하는 서류를 갖추어 기획재정부장관에게 추천하고, 기획재정부장관은 매 반기 종료일부터 4개월이 되는 날까지 기획재정부령으로 정합니다(기획재정부령으로 정한 날이 속하는 연도의 1월 1일부터 6년간 법정기부금에 해당)(법령§36의2⑥ ⑦). ": {},
                        "  법정기부금단체로 지정된 해당 학교 등은 지정기간 동안 다음 의무를 이행하여야 합니다(법령§36의2⑧).": {},
                        "- 연간 기부금 모금액 및 그 활용실적을 다음 연도 3월 31일까지 기획재정부 령으로 정하는 기부금모금액 및 활용실적명세서에 따라 국세청의 인터넷 홈페이지에 공개할 것(2014.1.1. 이후 기부금를 모금하거나 활용하는 분부터 적용합니다.)": {},
                        "- 해당 단체의 홈페이지를 통하여 연간 기부금 모금액 및 그 활용실적을 다음 연도 3월 31일까지 공개할 것": {},
                        "- 해당 사업연도의 수익사업의 지출을 제외한 지출액의 100분의 80 이상을 직접 고유목적사업에 지출할 것(2012.2.2. 이후 최초로 지정 또는 재지정하는 분부터 적용합니다.) ": {},

                    },
                    "② 지정기부금 ": {

                        "  법령§36①1호 및 법칙§18①(별표 6의2)에 열거한 지정기부금단체 등의 고유목적 사업비로 지출하는 기부금(다만, 법령§36①1호 사목에 따라 지정된 법인에 지출하는 기부금은 지정일이 속하는 연도의 1월 1일부터 6년간 지출하는 기부금에 한정합니다.) ": {},
                        "* 2014.2.21. 이후 지정하는 기부금단체부터 법령§36①1호 사목의 지정기부금단체 지정요건을 신청시점에 확인 가능한 사항으로 지정요건을 변경하였으며, 해당 사업연도의 수익사업의 지출을 제외한 지출액의 100분의 80 이상을 직접 고유목적사업에 지출하도록 하는 규정은 사후관리 요건으로 이관 하였습니다. ": {},
                        "  법령§36① 2호 및 법칙§18②(별표 6의3)에 열거한 특정용도로 지출하는 기부금 ": {},
                        "* 2012.1.1. 이후 지출하는 기부금부터는  평생교육법  제31조제4항에 따른 전공대학 형태의 평생교육시설에 지출하는 분 및 동 평생교육시설의 장이 추천하는 개인에게 교육비 연구비 또는 장학금으로 지출하는 분, 노인복지법 제36조제1항에 따른 경로당 노인교실에 지출하는 분을 추가합니다. ": {},

                        "  영업자가 조직한 단체로서 법인이거나 주무관청에 등록된 조합 또는 협회에 지급한 특별회비 및 임의로 조직된 조합 또는 협회에 지급한 회비": {},
                        "  무료 또는 실비로 이용할 수 있는 다음의 사회복지시설 또는 기관에 기부하는 금품의 가액. 다만,  노인복지법  제32조제1항에 따른 노인주거복지시설 중 양로시설을 설치한 자가 해당 시설의 설치 운영에 필요한 비용을 부담하는 경우 그 부담금 중해당 시설의 운영으로 발생한 손실금(기업회계기준에 따라 계산한 해당 과세기간의 결손금을 말한다)이 있는 경우에는 그 금액을 포함합니다. ": {},
                        "  아동복지법  제52조제1항에 따른 아동복지시설": {},
                        "  노인복지법  제31조에 따른 노인복지시설 중 다음의 시설을 제외한 시설 1)  노인복지법  제32조제1항에 따른 노인주거복지시설 중 입소자 본인이 입소비용의 전부를 부담하는 양로시설 노인공동생활가정 및 노인복지 주택 2)  노인복지법  제34조제1항에 따른 노인의료복지시설 중 입소자 본인이 입소비용의 전부를 부담하는 노인요양시설 노인요양공동생활가정 및노인전문병원 3)  노인복지법  제38조에 따른 재가노인복지시설 중 이용자 본인이 재가복지서비스에 대한 이용대가를 전부 부담하는 시설": {},
                        "  장애인복지법  제58조제1항에 따른 장애인복지시설. 다만, 다음 각 목의 시설은 제외합니다.": {},
                        "1) 비영리법인( 사회복지사업법  제16조제1항에 따라 설립된 사회복지 법인을 포함한다) 외의 자가 운영하는 장애인 공동생활가정 2)  장애인복지법 시행령  제36조에 따른 장애인생산품 판매시설 3) 장애인 유료복지시설": {},
                        "  한부모가족지원법  제19조제1항에 따른 한부모가족복지시설": {},
                        "  정신보건법  제3조제4호 및 제5호에 따른 정신질환자사회복귀시설 및정신요양시설": {},
                        "  성매매방지 및 피해자보호 등에 관한 법률  제6조제2항 및 제10조제2항에 따른 지원시설 및 성매매피해상담소 ": {},

                        "  가정폭력방지 및 피해자보호 등에 관한 법률  제5조제2항 및 제7조제2항에 따른 가정폭력 관련 상담소 및 보호시설   성폭력방지 및 피해자보호 등에 관한 법률  제10조제2항 및 제12조제2항에 따른 성폭력피해상담소 및 성폭력피해자보호시설   사회복지사업법  제34조에 따른 사회복지시설 중 사회복지관과 부랑인  노숙인 시설": {},
                        "  노인장기요양보험법  제32조에 따른 재가장기요양기관   다문화가족지원업  제12조에 따른 다문화가족지원센터 ": {},
                        "☞ 2013.2.15. 이후 지출하는 분부터 적용 * 2011.1.1. 이후 최초 개시하는 사업연도 분부터는 사회복지시설을 구체적으로 열거하는 방식으로 변경 ": {},
                        "  입양특례법 에 따른 재단법인중앙입양원": {},
                        "  창조경제민관협의회 등의 설치 및 운영규정에 관한 규정 에 따른 창조 경제혁신센터 ": {},
                        "  다음 각 목의 요건을 모두 갖춘 비영리외국법인(단체 포함)으로서 주무관청의 추천을 받아 기획재정부장관이 지정하는 비영리외국법인('해외지정기부금 단체'라 함)에 대하여 지출하는 기부금으로서 지정기간 동안 지출하는 기부금 - 비영리외국법인으로서  재외동포의 출입국과 법적 지위에 관한 법률  제2조에 따른 재외동포의 협력 지원, 한국의 홍보 또는 국제교류 협력을 목적으로 하는 법인일 것 - 법인세법시행령 제1항제1호사목 1)부터 5)까지의 요건을 모두 충족할 것": {},
                        "  다음 각 목의 요건을 모두 갖춘 국제기구로서 법인세법 시행규칙§18⑦(별표 6의4)에 따른 국제기구에 지출하는 기부금 - 사회복지, 문화 예술, 교육, 종교, 자선, 활동 등 공익을 위한 사업을 수행할 것 - 우리나라가 회원국으로 가입하였을 것 ": {},
                        "☞ 2013.2.15. 이후 지정기부금단체로 정하는 국제기구에 지출하는 분부터 적용합니다. ": {},

                        "  법인으로 보는 단체 중 법인세법시행령§56①에 규정된 지정기부금단체를 제외한 단체의 수익사업에서 발생한 소득을 고유목적사업비로 지출하는 금액 ": {},
                    },
                    "③ 기타기부금 ": {

                        "  상기이외의 기부금：전액 손금불산입 ": {},
                        "※ 부칙 <제10406호, 2010.12.27.> 조세특례제한법 제58조(기부금의 과세특례 폐지에 관한 경과조치) 부칙 제1조 단서에 따른 제73조(제1항 제14호의 개정규정은 제외한다), 제88조의4제13항 및 제104조의16제4항제2호의 개정 규정의 시행일 전에 지출하는 기부금에 대하여는 같은 규정의 개정규정에도 불구하고 종전의 규정에 따른다. ": {},

                    },
                },
                "(2) 기부금의 가액 등 ": {

                    "  기부금을 금전 외의 자산으로 제공한 경우 당해 자산의 가액은 이를 제공한 때의 시가(시가가 장부가액보다 낮은 경우에는 장부가액)에 의합니다.": {},
                    "- 다만, 2011.7.1. 전에 제공하거나 기부받은 법법§24②(법정기부금) 및 조특법 §73①(특례기부금)에 대하여는 장부가액으로 하며": {},
                    "- 2011.7.1. 이후 최초로 제공하거나 기부받은 법정기부금 및 지정기부금(단, 특수관계인에게 기부한 지정기부금은 제외)에 대하여는 장부가액으로 합니다. ": {},
                    "※ 현물 기부자산의 개정 전·후 평가방법(법령§37, 2011.3.31.개정) ": {},
                    "Ⅲ ": {},
                    "구 분 ": {},
                    "2011.3.31. 전지출분 ": {},
                    "2011.3.31.∼2011.": {},
                    "6.30. 지출분 ": {},
                    "2011.7.1.이후 지출분 ": {},
                    "법정기부금 장부가액 장부가액 ": {},
                    "장부가액 특례기부금 폐지": {},
                    "지정기부금 시가와 장부가액 중 큰금액 ": {},
                    "장부가액(단, 특수관계인에게 기부 시시가와 장부가액 중 큰 금액) 비지정기부금 시가와 장부가액 중 큰 금액 ": {},
                    "  기부금을 가지급금 등으로 이연 계상한 경우에는 이를 지출한 사업연도의 기부금으로 하고, 그 후 사업연도에 있어서는 이를 기부금으로 보지 아니합니다(법령§37②).": {},
                    "  기부금을 미지급금으로 계상한 경우 실제로 지출할 때까지는 기부금으로 보지 아니합니다(법령§37③). ": {},

                },
                "(3) 기부금의 손금산입 범위액": {

                    "① 법정기부금(법법§24②) ": {

                        "한도액 = (해당 사업연도의 소득금액 1) - 법법§13제1호의 이월결손금 2) ) × 50% ": {},
                        "1) 차가감소득금액 - 합병 분할 등에 따른 자산의 양도차익 + 합병 분할 등에 따른 자산의 양도차손 + 법정기부금지출액 + 지정기부금지출액 2) 각사업연도 개시일 전 10년(2008년 이전 발생분은 5년) 이내 개시한 사업연도에 발생한 이월결손금": {},
                        "☞ 손금불산입된 법정기부금은 해당 사업연도의 다음 사업연도개시일부터 5년(2011.12.31. 이전에 지출한 법정기부금과 2011.6.30. 이전에 지출한 특례기부금은 1년, 2013.12.31. 이전에 지출한 법정기부금은 3년) 이내에 이월하여 손금에 산입할 수 있습니다. ": {},

                    },
                    "② 특례기부금 (舊조특법§73①.14호 제외) ": {
                        "한도액 = (기부금을 손금산입 하지 않은 세무조정 후 소득금액 1) - 이월결손금 2) ) × 50% ": {},
                        "1) [차가감소득금액 + 법정기부금 + 지정기부금]- 법정기부금 손금인정액 2) 각사업연도 개시일 전 10년(2008년 이전 발생분은 5년)이내 개시한 사업연도에 발생한 이월결손금": {},
                        "☞ 손금불산입된 특례기부금 한도초과액은 1년간(신탁재산 공익법인 기부금은 3년, 舊조특법 §73①.11호) 이월하여 손금에 산입할 수 있음(舊조특법§73④). ": {},

                    },
                    "③ 지정기부금 (법법§24①) ": {
                        "한도액 = (해당 사업연도의 소득금액 - 법법§13제1호의 이월결손금 - 법정기부금 손금산입액 - 법정 또는 (구)특례기부금 이월액 중 손금산입액 ) × 10% ": {},
                        "☞ 손금불산입된 지정기부금 한도초과 금액은 향후 5년(2009.12.31. 이전 지출분은 3년) 이내에 이월하여 손금에 산입할 수 있음. ": {},

                    },
                    "④ 비지정기부금：전액 손금불산입 ": {
                        "  세법에서 손금으로 용인되는 기부금으로 열거하고 있지 아니한 기부금은 원칙적으로 손금불산입(신용협동조합, 새마을금고, 동창회, 향우회, 종친회 기부금 등) ": {},
                    },
                },
                "(4) 기부금의 이월공제 ": {

                    "  손금불산입한 기부금 한도초과액은 그 다음 사업연도 개시일로부터 일정 기간(1년∼ 5년) 이내에 종료하는 각 사업연도에 이월하여": {},
                    "- 기부금 종류별로 이월된 각 사업연도의 당해 기부금이 손금산입 한도액에 미달하는 경우에 한하여 그 미달하는 금액의 범위 안에서 손금에 산입합니다. ": {},
                    "☞ 이월된 기부금은 각 사업연도에 발생한 기부금을 먼저 손금에 산입한 후 손금산입 한도액에 미달하는 범위 내에서 손금산입하여야 합니다. ": {},
                    "  이월공제기간 ": {},
                    "법정기부금 (법법§24②) ": {},
                    "(구)특례기부금 (조특법§73①기타) ": {},
                    "(구)특례기부금 (조특법§73①11) ": {},
                    "지정기부금 (법법§24①) ": {},
                    "5년 * 1년 3년 5년 ": {},
                    "* 2014.1.1.이후 개시하는 사업연도에 기부하는 분부터 적용합니다. ": {},

                },
                "(5) 기부금 영수증 및 기부금 영수증 발급대장 ": {

                    "  비영리내국법인이 법인세법 제112조의2의 규정에 따라 기부금영수증을 발급하는 경우 기부자별 발급명세를 작성하여 발급한 날부터 5년간 보관하여야 합니다 (법법§112의2①).": {},
                    "  기부법인별 발급명세 작성대상 ": {},
                    "2008.12.31.까지 2009.1.1.∼12.31. 2010.1.1.부터 ": {},
                    "연간 100만원 초과 연간 50만원 초과 전액 ": {},
                    "  사실과 다른 기부금영수증을 발급하거나 기부자별 발급명세를 작성 보관하지 아니한 경우 가산세가 부과됩니다(법법§76 ⑩).": {},
                    "- 기부금영수증의 경우：사실과 다르게 발급된 금액 등의 100분의 2": {},
                    "- 기부자별 발급명세의 경우：작성 보관하지 아니한 금액의 1천분의 2 ": {},
                    "☞ 2013.1.1. 이후 기부금영수증을 발급하는 분부터 사실과 다르게 기재 또는 기부금액 및 기부자 인적사항 등 주요사항이 기재되지 않은 경우 2%의 가산세가 적용됩니다. ": {},

                },
                "(6) 기획재정부장관이 지정하는 지정기부금 대상단체 ": {

                    "  대상단체 확인：기획재정부 지정 공익성지정기부금단체 공고(분기별)  기획재정부(www.mosf.go.kr) > 법령 > 공고 ": {},
                    "☞ 실제 적용에 있어서는 대상단체 등에 확인 후 처리하시기 바랍니다. ": {},
                    "- 법령§36①1호 사목에 따른 지정기부금단체의 지정 취소(법령§36⑧)  법인이 상증법§48②, ③에 따라 사업연도별 1천만원 이상의 상속세 또는 증여세를 추징당한 경우  법인이 목적 외 사업을 하거나 설립허가의 조건에 위반하는 등 공익목적을 위반한 사실, 법령§36⑤ 각호의 의무를 위반한 사실 또는 같은 법령§36⑥ 후단에 따른 요구에도 불구하고 의무이행 여부를 보고하지 아니한 사실이 있는 경우   국세기본법  제85조의5에 따라 불성실기부금수령단체로 명단이 공개된 경우  법인의 대표자, 대리인, 사용인 또는 그 밖의 종업원이  기부금품의 모집 및사용에 관한 법률 을 위반하여 같은 법 제16조에 따라 법인 또는 개인에게 징역 또는 벌금형이 확정된 경우(2012.2.2. 이후 최초로 법률을 위반한 분부터 적용)  법인이 해산하는 경우": {},
                    "  요건：다음 요건을 모두 충족 후 주무관청의 추천을 받아 기획재정부장관이 지정 - 법인 종류별 요건   민법 상 비영리법인：정관의 내용상 수입을 회원의 이익이 아닌 공익을 위하여 사용하고 사업의 직접 수혜자가 불특정 다수인 것이 인정될 것  사회적협동조합：정관의 내용상  협동조합 기본법  제93조제1항 제1호 부터 제3호까지의 사업 중 어느 하나의 사업을 수행하는 것으로 인정될 것 - 해산을 하면 잔여재산을 국가ㆍ지방자치단체 또는 유사한 목적을 가진 다른 비영리법인에 귀속하도록 한다는 내용이 정관에 포함되어 있을 것 - 인터넷 홈페이지가 개설되어 있고, 인터넷 홈페이지를 통하여 연간 기부금 모금액및 활용실적을 공개한다는 내용이 정관에 포함되어 있을 것 - 지정일이 속하는 연도와 그 직전 연도에 해당 비영리법인의 명의 또는 그 대표자의 명의로 특정 정당 또는 특정인에 대한  공직선거법  제58조제1항에 따른 선거운동을 한 것으로 권한 있는 기관이 확인한 사실이 없을 것 ": {},

                    "- 제11항에 따라 지정이 취소된 경우에는 그 취소된 날부터 3년, 같은 항에 따라 재지정을 받지 못하게 된 경우에는 그 지정기간의 종료일부터 3년이 지났을 것.": {},
                    "다만, 제5항제1호의 의무를 위반한 사유만으로 지정을 취소하거나 재지정을 하지 아니한 경우에는 그러하지 아니합니다. ": {},
                    "참고：통칙 및 예규 ": {

                        " 국 공립학교 후원회 등에 대한 기부금의 처리(통칙 24-0…2) ": {},
                        "국 공립학교가 기부금품모집규제법 제2조 제1호 라목의 규정에 의하여 후원회 등을 통하여 받는 기부금은 동 법상의 기부심사위원회의 심의대상이 아니므로 동 법에 의한 심의절차를 거치지 아니한 경우에도 법 제24조 제2항 제1호의 기부금에 해당함. ": {},
                        " 국외난민돕기 성금의 처리(통칙 24-0…4) ": {},
                        "법 제24조 제2항 제3호의 기부금에는 해외의 천재 지변 등으로 생긴 이재민을 위한 구호금품의 가액을 포함하는 것으로 함. ": {},
                        " 임직원 자녀를 기부금 수혜자로 지정하여 대학교에 지출하는 기부금의 법정기부금 해당여부 ": {},
                        "내국법인이  사립학교법 에 따른 사립학교에 해당법인의 임직원의 자녀를 기부금 수혜자로 지정하여 지출하는 기부금은  법인세법  제24조제2항제4호 가목에 해당하지 아니하는 것임(법규과-821 2013.7.17.) ": {},
                        " 고유목적사업 등에 대한 지출 해당여부 ": {},
                        "신설되는 산학협력단(B)의 설립 및 운영 지원을 고유목적사업 중 하나로 하는 산학 협력단(A)이 수익사업에서 발생한 소득을 산학협력단(B)에 출연하는 경우 해당 출연 금액은  법인세법  제29조에 따라 손금에 산입한 고유목적사업 준비금을 고유목적 사업 등에 지출한 것으로 보는 것임(법규법인2013-82, 2013.3.27.) ": {},
                        " 학교법인이 수익사업용 자산을 고유목적사업에 전출하면서 해당 자산가액을 시가로 할경우 세무처리 ": {},
                        " 조세특례제한법  제74조제1항제1호에 따른 학교법인이 수익사업회계에 속하는 금전외의 자산을 비영리사업회계에 전입한 경우  법인세법 시행규칙  제76조제4항 후단에 따라 비영리사업에 지출한 것으로 보는 것임 ": {},

                        "이 경우 그 자산의 가액은 시가로 평가하는 것이며, 자산의 평가이익(장부가액과 시가와의 차액)은 전입일이 속하는 사업연도의 수익사업의 익금에 해당하는 것임(기재부 법인-364, 2012.5.16.) ": {},
                        " 사립학교에 연구비로 지출하는 기부금 구분 및 장부가액의 범위 ": {},
                        "내국법인이  사립학교법 에 의한 사립학교에 연구비조로 지출하는 소프트웨어 상당액은  법인세법  제24조제2항제4호에서 규정하는 법정기부금에 해당하는 것이며,": {},
                        " 법인세법 시행령  제37조를 적용함에 있어서 같은 조 단서 규정에 의한 장부가액은 세무상 장부가액을 의미하는 것이며, 법인이 무상으로 소프트 웨어를 기부함에 있어 당해 소프트웨어 개발비 중 이미 비용으로 계상한 부분은 법정기부금의 장부가액에 포함되지 않는 것임(법인세과-343, 2009.3.26.) ": {},
                        " 회사정리계획에 따라 지급하는 거래대금의 기부금 해당 여부 ": {},
                        "특수관계가 없는 자간에 합의한 후 법원의 인가를 받은 회사정리계획에 따라 거래당사자간에 거래대가를 지급하는 것은 법인세법 제52조 제1항의 “조세의 부담을 부당히 감소시킨 것으로 인정되는 경우”에 해당되지 아니하고, 법인세법시행령 제35조 제2호의 “정당한 사유”에 해당되는 것임(재경부 법인46012-91, 2003.5.26.) ": {},
                        " 부동산 무상 임대 시 기부금 해당여부 ": {},
                        "법인이 법인세법 제87조에 규정된 특수관계없는 자에게 당해 법인의 사업과 직접 관계없이 부동산을 무상으로 임대하는 경우에는 법인세법시행령 제35조 제1호의 규정이 적용되어 법인세법시행령 제89조의 규정에 의한 시가상당액을 기부금으로 보는 것이며, 부동산을 시가보다 낮은 가액으로 임대하는 경우에는 법인세법시행령 제35조 제2호의 규정이 적용되어 정상가액과의 차액이 기부금에 해당하는 것임(재경부 법인46012-143, 2002.9.6.) ": {},

                    },
                },
                "(7) 기부금 조정명세서 작성사례 ": {},
                "자 료 ": {

                    "① (주)가나의 기부금계정 금액은 104,500,000원이며 그 내역은 다음과 같다.": {},
                    "㉮ 법정기부금：2017.4.1. 지출한 이재민구호금품 5,000,000원 2017.8.1. 지출한 사립대학 시설비 10,000,000원 2017.9.1. 지출한 국립대학병원 연구비 40,000,000원 ㉯ 지정기부금：48,000,000원 [2018.1.31. 만기 지급어음 5,000,000원 포함] ㉰ 전액 손금불산입 기부금：1,500,000원": {},
                    "② 결산서상 당기순이익：178,500,000원": {},
                    "③ 세무조정 ㉮ 익금산입, 손금불산입：41,500,000원": {},
                    "  전액 손금불산입 기부금 및 어음으로 지급한 기부금 포함됨.": {},
                    "㉯ 손금산입 익금불산입：39,000,000원": {},
                    "④ 법인세법§13, 1호 규정의 이월결손금：135,000,000원": {},
                    "⑤ 사업연도는 2017.1.1. ∼ 2017.12.31.이며 일반 영리법인임. ": {},
                },
                "세무조정계산 ": {

                    "[기부금의 손금산입 한도초과액 계산]": {},
                    "① 법정기부금 손금산입 한도초과액 ㉮ 당해 사업연도 소득금액：279,000,000": {},
                    "(178,500,000 + 41,500,000 - 39,000,000) + (5,000,000 + 10,000,000 + 40,000,000 + 43,000,000 * ) ": {},
                    "* 어음으로 지급한 5,000,000원은 2018년 기부금이므로 손금부인 ": {},
                    "㉯ 손금산입한도액：72,000,000 = (279,000,000 - 135,000,000) × 50% ㉰ 한도초과액：△17,000,000(한도미달) = 55,000,000 - 72,000,000": {},
                    "② 지정기부금 손금산입 한도초과액 ㉮ 손금산입한도액：8,900,000 ＝ (279,000,000 - 135,000,000 - 55,000,000) × 10% ㉯ 한도초과액：34,100,000(한도초과) = 43,000,000 - 8,900,000 ": {},

                },
                "[별지 제21호서식] <개정 2013.2.23.>": {

                    "사 업 연 도 ": {},
                    "⑥ 이월잔액 중 손금산입액 MIN[(④-③)>0,     ]": {},
                    "③  법인세법  제24조제2항에 따른 법정기부금 해당 금액 ": {},
                    "55,000,000 ": {},
                    "89,000,000 ": {},
                    "⑫이월잔액 중 손금산입액 MIN[(⑩-⑨)>0,     ] ": {},
                    "2017.1.1. ": {},
                    "기부금 조정명세서 ": {},
                    "법 인 명 ㈜가나 ~ 사 업 자 등 록 번 호 101-81-12345 2017.12.31. ": {},
                    "1. 법정기부금 손금산입액 한도액 계산 ": {},
                    "① 소득금액 계 279,000,000 ⑤ 손금산입액 MIN(③, ④) 55,000,000 ": {},
                    "②  법인세법  제13조제1호에 따른 이월결손금 합계액 ": {},
                    "135,000,000 ": {},
                    "⑦ 소득금액 차감잔액 [(①-②-⑤-⑥)>0] ": {},
                    "④ 한도액 {[(①-②)>0]×50%} 72,000,000 ⑧ 한도초과액[(③-④)>0] ": {},
                    "2. (구)  조세특례제한법  제73조제1항 기부금 손금산입액 한도액 계산": {},
                    "⑨ (구)  조세특례제한법  제73조제1항에 따른 기부금 해당 금액 ": {},
                    "⑩ 한도액 (⑦×50%) 44,500,000 ": {},
                    "⑬소득금액 차감잔액 [(⑦-⑪-⑫)>0] ": {},
                    "89,000,000 ": {},
                    "⑪손금산입액 MIN(⑨, ⑩) ⑭한도초과액[(⑨-⑩)>0] ": {},
                    "3. 지정기부금 손금산입 한도액 계산": {},
                    "⑮  법인세법  제24조제1항에 따른 지정기부금 해당 금액 ": {},
                    "43,000,000   이월잔액 중 손금산입액": {},
                    "MIN[( -⑮)>0,     ]": {},
                    "  한도액(⑬×10%) 8,900,000 ": {},
                    "  손금산입액 MIN(⑮,  ) 8,900,000  한도초과액[(⑮- )>0] 34,100,000 ": {},
                    "4. 기부금 한도초과액 총액 ": {},
                    "  기부금 합계액(③+⑮)      손금산입 합계(⑤+ )      한도초과액 합계( -    )=(⑧+    ) ": {},
                    "98,000,000 63,900,000 34,100,000 ": {},
                    "210mm×297mm[백상지 80g/㎡ 또는 중질지 80g/㎡] ": {},
                },
                "(뒤쪽) ": {

                    "    한도초과 ": {},
                    "손금불산입액 ": {},
                    "    기공제액 ": {},
                    "    공제가능 ": {},
                    "    해당사업연도 ": {},
                    "손금추인액 ": {},
                    "    차기이월액 ": {},
                    "합계 ": {},

                    "5. 기부금 이월액 명세": {},
                    "사업 연도 ": {},
                    "기부금 종류 ": {},
                    "잔액(    -    ) ": {},
                    "(    -    ) ": {},
                    " 법인세법  제24조제2항에 따른 법정기부금": {},
                    "( 구 )   조 세 특 례 제 한 법   제73조제1항에 따른 기부금": {},
                    " 법인세법  제24조제1항에 따른 지정기부금 ": {},
                    "34,100,000 34,100,000 34,100,000 ": {},
                    "2017.": {},
                    "1.1.∼ 12.31 ": {},
                    " 법인세법  제24조제2항에 따른 법정기부금": {},
                    "( 구 )   조 세 특 례 제 한 법   제73조제1항에 따른 기부금": {},
                    " 법인세법  제24조제1항에 따른 지정기부금 ": {},
                    "34,100,000 34,100,000 34,100,000": {},
                    " 법인세법  제24조제2항에 따른 법정기부금": {},
                    "( 구 )   조 세 특 례 제 한 법   제73조제1항에 따른 기부금": {},
                    " 법인세법  제24조제1항에 따른 지정기부금 ": {},
                },
                "작 성 방 법 ": {

                    "1. ①소득금액계란：“법인세 과세표준 및 세액조정계산서(별지 제3호서식)”의       차가감소득금액(같은 서식       손금산입란에 법정기부금, (구)  조세특례제한법  제73조의 기부금 및 지정기부금 이월액 중 손금산입한 금액이 포함되어 있는 경우에는그 금액을 가산한 금액을 말합니다)에서 이 서식의     기부금 합계액(③+⑮)을 합하여 적습니다. (구)  조세특례제한법  제73조제1항제14호의 기부금 전기이월액이 있는 경우에는 그 금액을 차감하여 적고,     손금산입 합계(⑤+ )에는그 금액을 합하여 적습니다.": {},
                    "2. ③, ⑮란：“기부금명세서(별지 제22호서식)”의 ⑨란의 가.~나.에 해당하는 기부금 종류별 소계 금액과 일치하여야 합니다.": {},
                    "3. ④한도액란：“(①-②)>0”은 ①에서 ②를 차감한 금액을 적되, 그 금액이 음수(-)인 경우에는 “0”으로 적습니다.": {},
                    "이하에서 (○A -○B )>0 표시된 경우는 모두 같은 방법으로 적습니다.": {},
                    "4. ⑤손금산입액란：④금액과 ③금액 중 작은 금액을 적습니다.": {},
                    "5. ⑥이월잔액 중 손금산입액란：해당 사업연도의  법인세법  제24조제2항에 따른 기부금이 한도에 미달하는 경우에 전기 이월된 한도초과액 잔액 중  법인세법  제24조제4항에 따라 손금산입되는 금액을 적고,  법인세법  제24조제2항의 기부금 전기이월액 중     해당사업연도 손금추인액의 합계금액과 일치하여야 합니다.": {},
                    "6. ⑦소득금액 차감잔액란：①금액에서 ②금액을 뺀 금액에서 ⑤란과 ⑥란의 손금산입액을 뺀 금액을 적되, 그 금액이 음수(-)인 경우에는 “0”으로 적습니다.": {},
                    "7. ⑧한도초과액란：③금액에서 ④금액을 빼서 적되, 그 금액이 음수(-)인 경우에는 “0”으로 적습니다.": {},
                    "※ 3. 지정기부금 한도액 계산에 동일하게 적용합니다, ": {},
                    "8.     한도초과액 합계란：해당 사업연도 기부금 한도초과액 총합계금액으로서 별지 제3호서식의       기부금한도초과액란에 적습니다.": {},
                    "9. “5. 기부금 이월액 명세”는 사업연도별로 작성하며,     해당 사업연도 손금추인액 합계금액은 “법인세 과세표준 및세액조정계산서(별지 제3호서식)”의       기부금한도초과이월액 손금산입란에 적습니다.": {},
                    "※ 2. (구)  조세특례제한법  제73조제1항에 따른 기부금의 경우 법률제10,406호 조세특례제한법 부칙 59조에 따라 2011.7.1.전에 지출한 기부금에 한하여 기부금한도초과이월액 손금산입만 가능합니다. ": {},

                },
            },
}

#___________________________________________________
제목='기부금'
_={
    #"지방소득세_법인세분 가산세": 지방소득세_법인세분,
    #"기업회계":기업회계,
    "법인세":법인세,
    #"조세특례제한법":조세특례제한법,
    #"증여세":증여세,
    #"상속세":상속세,
    #"양도소득세":양도소득세,
    #"농어촌특별세":{},
}
tax=_
import wx
class MyFrame(wx.Frame):
    def __init__(self):
        wx.Frame.__init__(self,parent=None,title=제목)
        self.SetSize(420,320*2)
        self.mainPanel=wx.Panel(self)
        self.expandButton=wx.Button(self.mainPanel,label='펼침')
        self.tree=wx.TreeCtrl(self.mainPanel)
        root=self.tree.AddRoot(제목)
        for i in tax:
            ii=self.tree.AppendItem(root,i)
            for j in tax[i]:
                jj=self.tree.AppendItem(ii,j)
                for k in tax[i][j]:
                    kk=self.tree.AppendItem(jj,k)
                    for m in tax[i][j][k]:
                        mm=self.tree.AppendItem(kk,m)
                        for n in tax[i][j][k][m]:
                            nn=self.tree.AppendItem(mm,n)
                            for p in tax[i][j][k][m][n]:
                                pp=self.tree.AppendItem(nn,p)
                                for q in tax[i][j][k][m][n][p]:
                                    qq=self.tree.AppendItem(pp,q)
                                    for r in tax[i][j][k][m][n][p][q]:
                                        rr=self.tree.AppendItem(qq,r)
        self.staticText =wx.TextCtrl(self.mainPanel,style=wx.TE_MULTILINE)

        self.vtBoxSizer=wx.BoxSizer(wx.VERTICAL)
        self.vtBoxSizer.Add(self.expandButton,0,wx.EXPAND|wx.ALL,5)
        self.vtBoxSizer.Add(self.tree        ,5,wx.EXPAND|wx.ALL,5)
        self.vtBoxSizer.Add(self.staticText  ,0,wx.EXPAND|wx.ALL,5)
        self.mainPanel.SetSizer(self.vtBoxSizer)
        self.Bind(wx.EVT_BUTTON          ,self.OnExpandButton,self.expandButton)
        self.Bind(wx.EVT_TREE_SEL_CHANGED,self.OnNodeSelected,self.tree)
    def OnExpandButton(self,e):
        self.tree.ExpandAll()
    def OnNodeSelected(self,e):
        selected=self.tree.GetSelection()
        self.staticText.SetLabel(self.tree.GetItemText(selected))
        #self.
        self.mainPanel.Layout()
if __name__=='__main__':
    app=wx.App()
    frame=MyFrame()
    frame.Show()
    app.MainLoop()
#___________________________________________________