합병_지방세={
        '취득세 면제':{},
        '자본증가등의 등록면허세':{},
        '농어촌특별세':{},
}
합병={
        '합병개요':{
                '합병의 의의':{},
                '합병의 유형':{},
        },
        '상법등 규정':{
                 '합병의 제한':{},
                 '합병의 절차':{},
                 '합병의 효과':{},
                 '합병무효의 소':{},
                 },
        '합병회계':{
                 '적용기준':{},
                 '기업회계상 회계처리':{},
                 '세법상 회계처리':{},
                 '합병 회계처리 사례':{},
                 },
        '합병세무':{
                 '과세체계의 변경':{},
                 '세법상 규정':{},
                 '합병법인의 세무':{},
                 '피합병법인의 세무':{},
                 '주주의 세무':{},
                 '적격,비적격합병 세무처리의 비교':{},
                 },
        '합병에 대한 지방세 과세특례':합병_지방세,
}
분할_지방세={
        '취득세 면제':{},
        '취득등기시 취득세 과세표준':{},
}
분할={
        '분할개요':{
                     '분할의 의의':{},
                     '분할의 유형':{},
                     },
        '상법 등 규정':{
                     '분할의 제한':{},
                     '분할의 절차':{},
                     '븐힐의 책임과 효과':{},
                     '분할의 등기  등':{},
                     },
        '분할회계':{
                     '적용기준':{},
                     '기업회계상 회계처리':{},
                     '세법상 회계처리':{},
                     '분할 회계처리 사례':{},
                     },
        '분할세무':{
                     '과세체계의 변경':{},
                     '세법상 규정':{},
                     '물적분할':{},
                     '소멸인적분할':{},
                     '존속인적분할':{},
                     '주주의 세무':{},
                     },
        '분할에 대한 지방세 과세특례':분할_지방세,
}
현물출자_지방세={
        '취득세 면제':{},
        '과점주주 간주 취득세':{},
        '등록면허세':{},
}
현물출자={
        '현물출자개요':{
                         '현물출자의 의의':{},
                         '현물출자의 유형':{},
                         },
        '상법 등의 규정':{
                         '현물출자의 결정':{},
                         '현물출자의 이행':{},
                         '현물출자의 평가':{},
                         },
        '현물출자 회계':{
                         '적용기준':{},
                         '기업회계상 회계처리':{},
                         '세법상 회계처리':{},
                         '현물출자 회계처리 사례':{},
                         },
        '현물출자 세무':{
                         '현물출자에 의한 개인의 법인전환':{},
                         '법인의 현물출자에 대한 과세 특례':{},
                         '주식의 현물출자에 의한 지주회사의 설립 등에 대한 과세특례':{},
                         '내국법인의 외국자회사 주식 등의 현물출자에 대한 과세특례':{},
                         '공모리츠에 대한 현물출자시 법인세 과세특례':{},
                         '전략적 제휴를 위한 현물출자 법인세 과세특례':{},
                         '기타 세금':{},
                         },
        '현물출자에 대한 지방세 과세특례':현물출자_지방세,
}
사업양수도_지방세={
        '취득세세 중과':{},
        '과점주주 간주 취득세':{},
        '자산의 포괄적 양도와 관련된 취득세 면제':{},
}
사업양도={
        '사업양도 개요':{
                         '사업양도의 의의':{},
                         '사업양도의 유형':{},
                         },
        '상법 등의 규정':{
                         '영업양수도의 정의':{},
                         '영업양수도의 결정':{},
                         '영업양수도의 효과':{},
                         '영업양수도의 절차':{},
                         '간이 영업양수도':{},
                         },
        '사업양도 회계':{
                         '적용기준':{},
                         '기업회계상 회계처리':{},
                         '세법상 회계처리':{},
                         '사업양도 회계처리 사례':{},
                         },
        '사업양도 세무':{
                         '사업양도에 의한 개인의법인전환':{},
                         '자산의 포괄적 양도에 대한 과세특례':{},
                         '기업의 금융채무 상환을 위한 자산매각에 대한 과세이연':{},
                         '주주등의 자산양도에 관한 법인세 등 과세특례':{},
                         '채무의 인수 변제에 대한 과세특례':{},
                         '사업재편에 따른 금융채무 상환을 위한 자산매각 과세특례':{},
                         '사업재편계획에 따른 채무의 인수 변제 과세특례':{},
                         '사업재편계획에 따른 주주 등의 자산양도 과세특례':{},
                         '기타 세금':{},
                         },
        '사업양수도에 대한 지방세 과세특례':사업양수도_지방세,
}
자산교환={
        '자산교환의 개요':{
                '자산교환의 의의':{},
                '자산교환의 유형':{},
        },
        '상법 등의 규정':{
                         '자산교환 결정':{},
                         '중요한 자산의 처분':{},
                         '상법상 절차':{},
                         },
        '자산교환 회계':{
                         '적용기준':{},
                         '기업회계상 회게처리':{},
                         '세법상 회계처리':{},
                         '자산교환 회ㅏ계처리 사례':{},
                         },
        '자산교환 세무':{
                         '일반적인 교환의 경우':{},
                         '교환으로 인한 자산양도차익상당에ㅐㄱ의 손금산입특례':{},
                         },
        '자산교환에 대한 지방세 과세특례':{},
}
주식의취득및포괄적이전교환={
        '주식의 취득 등 개요':{
                         '주식의 취득 등 의의':{},
                         '주식취득의 유형':{},
                         },
        '상법 등의 규정':{
                         '개요':{},
                         '주식의 포괄적 교환':{},
                         '삼각주식교환 및 소규모주식교환':{},
                         '주식의 포괄적 이전':{},
                         '제한사항':{},
                         },
        '주식의 취득 등 회계':{
                         '기업회계상 회계처리':{},
                         '세법상 회계처리':{},
                         },
        '주식의 취득 등 세무':{
                         '주식의 포괄적 교환 이전에 대한 과세특례':{},
                         '주식교환에 대한 과세특례':{},
                         '사업재편계획에 따른 주식교환에 대한 과세특례':{},
                         '주식교환에 대한 양도소득세 비과세':{},
                         },
}
현물배당={
        '현물배당의 개요':{
                         '현물배당의 의의':{},
                         '현물배당의 유형':{},
                         },
        '상법등의 규정':{
                         '현물배당의 명문화':{},
                         '현물배당의 절차':{},
                         '주식배당':{},
                         '주식배당':{},
                         '제한사항':{},
                         },
        '현물배당의 회계':{
                         '적용기준':{},
                         '기업회계상 회계처리':{},
                         '세법상 회계처리':{},
                         },
}
과점주주_간주취득_취득세={
        '과세요건 개요':{},
        '적용대상법인의 범위':{},
        '특수관계 판단기준':{},
        '과점주주가 된 대의 기준 적용':{},
        '과점주주가 된 사유별 적용':{},
        '과점주주 간주취득에 대한 비과세 감면':{},
        '과점주주에 대한 중과세 적용':{},
        '2007.12.31이전에 지분율이 51%미만인 경우':{},
        '신탁재산':{},
        '과점주주로서 지분이 감소되었다가 증가된 경우':{},
        '주식양도로 일반주주로 되었다가 다시 과점주주로 된 경우':{},
        '자산재평가':{},
        '과점주주 과세비율 비교(지방세법시행령 11조) 사례':{},
}
기업구조조정과지방세={
        '합병에 대한 과세특례':합병_지방세,
        '분할에 대한 과세특례':분할_지방세,
        '현물출자에 대한 과세특례':현물출자_지방세,
        '사업양수도에 대한 과세특례':사업양수도_지방세,
        '자산교환에 대한 과세특례':{},
        '과점주주 간주취득':과점주주_간주취득_취득세,
}
파산={}
_={
        '기업구조정 세무가이드':{},
         '합병':합병,
         '분할':분할,
         '현물출자':현물출자,
         '사업양도 및 자산매각':사업양도,
         '자산교환':자산교환,
         '주식의 취득 및 포괄적 이전 교환':주식의취득및포괄적이전교환,
         '현물배당':현물배당,
         '기업구조조정과 지방세':기업구조조정과지방세,
        '파산':파산,
}
#___________________________________________________
제목='기업구조조정'
tax=_
import wx
class MyFrame(wx.Frame):
    def __init__(self):
        wx.Frame.__init__(self,parent=None,title=제목)
        self.SetSize(420,320*2)
        self.mainPanel=wx.Panel(self)
        self.expandButton=wx.Button(self.mainPanel,label='펼침')
        self.tree=wx.TreeCtrl(self.mainPanel)
        root=self.tree.AddRoot(제목)
        for i in tax:
            ii=self.tree.AppendItem(root,i)
            for j in tax[i]:
                jj=self.tree.AppendItem(ii,j)
                for k in tax[i][j]:
                    kk=self.tree.AppendItem(jj,k)
                    for m in tax[i][j][k]:
                        mm=self.tree.AppendItem(kk,m)
                        for n in tax[i][j][k][m]:
                            nn=self.tree.AppendItem(mm,n)
                            for p in tax[i][j][k][m][n]:
                                pp=self.tree.AppendItem(nn,p)
                                for q in tax[i][j][k][m][n][p]:
                                    qq=self.tree.AppendItem(pp,q)
                                    for r in tax[i][j][k][m][n][p][q]:
                                        rr=self.tree.AppendItem(qq,r)

        self.staticText =wx.TextCtrl(self.mainPanel,style=wx.TE_MULTILINE)


        self.vtBoxSizer=wx.BoxSizer(wx.VERTICAL)
        self.vtBoxSizer.Add(self.expandButton,0,wx.EXPAND|wx.ALL,5)
        self.vtBoxSizer.Add(self.tree        ,5,wx.EXPAND|wx.ALL,5)
        self.vtBoxSizer.Add(self.staticText  ,0,wx.EXPAND|wx.ALL,5)


        self.mainPanel.SetSizer(self.vtBoxSizer)

        self.Bind(wx.EVT_BUTTON          ,self.OnExpandButton,self.expandButton)
        self.Bind(wx.EVT_TREE_SEL_CHANGED,self.OnNodeSelected,self.tree)
    def OnExpandButton(self,e):
        self.tree.ExpandAll()
    def OnNodeSelected(self,e):
        selected=self.tree.GetSelection()
        self.staticText.SetLabel(self.tree.GetItemText(selected))

        self.mainPanel.Layout()
if __name__=='__main__':
    app=wx.App()
    frame=MyFrame()
    frame.Show()
    app.MainLoop()
#___________________________________________________