# -*- coding: utf-8 -*-
#Created on 2019년 @author: 권달현
조={};서문={};조문={};부칙 = {};bubname='농어촌특별세법시행령'
편=장=절=관=항=조={} 
서문['']={}
서문['농어촌특별세법 시행']={}
서문['[시행 2019. 1. 1] [대통령령 제29438호, 2018. 12. 31, 타법개정']={}
서문['기획재정부(조세특례제도과) 044-215-413']={}
제1조_=' 제1조 (목적) '
제1조={}
제1조['농어촌특별세법시행령 제1조 (목적)']={}
조문['제1조 (목적)']=제1조
조['제1조 (목적)']=제1조
제1조1항_='이 영은 「농어촌특별세법」에서 위임된 사항과 그 시행에 관하여 필요한 사항을 규정함을 목적으로 한다. <개정 2005. 12. 31.>'
제1조1항={}
제1조[제1조1항_]=제1조1항
제2조_=' 제2조 (정의) '
제2조={}
제2조['농어촌특별세법시행령 제2조 (정의)']={}
조문['제2조 (정의)']=제2조
조['제2조 (정의)']=제2조
제2조1항_='이 영에서 사용하는 용어의 정의는 「농어촌특별세법」(이하 "법"이라 한다)이 정하는 바에 의한다. <개정 2005. 12. 31.>'
제2조1항={}
제2조[제2조1항_]=제2조1항
제3조_=' 제3조 삭제  '
제3조={}
제3조['농어촌특별세법시행령 제3조 삭제 ']={}
조문['제3조 삭제 ']=제3조
조['제3조 삭제 ']=제3조
제4조_=' 제4조 (비과세) '
제4조={}
제4조['농어촌특별세법시행령 제4조 (비과세)']={}
조문['제4조 (비과세)']=제4조
조['제4조 (비과세)']=제4조
제4조1항_='①법 제4조제2호에서 "대통령령으로 정하는 것"이란 다음 각 호의 어느 하나에 해당하는 감면을 말한다. <개정 1994. 12. 23., 1994. 12. 31., 1995. 12. 30., 1997. 10. 1., 1997. 12. 31., 1998. 12. 31., 1999. 12. 31., 2000. 12. 29., 2001. 12. 31., 2002. 12. 30., 2003. 12. 30., 2005. 12. 31., 2008. 2. 29., 2010. 9. 20., 2010. 12. 30., 2013. 3. 23., 2014. 11. 19., 2015. 2. 27., 2016. 2. 5., 2017. 7. 26.>'
제4조1항={}
제4조[제4조1항_]=제4조1항
제4조1항1호_='1. 「조세특례제한법」 제66조부터 제70조까지, 제72조제1항(제1호 및 제5호의 법인은 제외한다), 제77조[「조세특례제한법」 제69조제1항 본문에 따른 거주자가 직접 경작한 토지(8년 이상 경작할 것의 요건은 적용하지 아니한다)로 한정한다] 및 제102조, 제104조의2, 「지방세특례제한법」 제57조의3제1항제2호(「농업협동조합법」에 따른 조합이 양수한 재산으로 한정한다)ㆍ제3호(「수산업협동조합법」에 따른 조합이 양수한 재산으로 한정한다)에 따른 감면'
제4조1항1호={}
제4조1항[제4조1항1호_]=제4조1항1호
제4조1항2호_='2. 「관세법」 제93조제1호에 따른 감면'
제4조1항2호={}
제4조1항[제4조1항2호_]=제4조1항2호
제4조1항3호_='3. 「지방세특례제한법」 제6조제1항ㆍ제2항 및 제4항, 제7조부터 제9조까지, 제10조제1항, 제11조, 제12조, 제14조제1항부터 제3항까지 및 제14조의2에 따른 감면'
제4조1항3호={}
제4조1항[제4조1항3호_]=제4조1항3호
제4조1항4호_='4. 「지방세특례제한법」 제4조의 조례에 따른 지방세 감면 중 제1호부터 제3호까지와 유사한 감면으로서 행정안전부장관이 기획재정부장관과 협의하여 고시하는 것'
제4조1항4호={}
제4조1항[제4조1항4호_]=제4조1항4호
제4조2항_='② 법 제4조제6호에서 "대통령령으로 정하는 것"이란 「관세법」 제88조, 제92조, 제93조제4호부터 제7호까지 및 제9호부터 제14호까지, 제94조, 제96조부터 제101조까지의 규정에 따른 감면을 말한다. <개정 2010. 12. 30.>'
제4조2항={}
제4조[제4조2항_]=제4조2항
제4조3항_='③ 법 제4조제8호에서 "대통령령으로 정하는 것"이란 「지방세특례제한법」 제4조제4항, 제57조의2제2항ㆍ제6항, 제66조제1항ㆍ제2항, 제68조제1항, 제73조제3항, 제74조제3항, 제92조, 「지방세법」 제9조제3항부터 제5항까지, 제15조제1항제1호부터 제4호까지, 제7호 및 제26조제2항제1호ㆍ제2호에 따른 감면을 말한다. <개정 2010. 12. 30., 2012. 2. 2., 2015. 2. 27., 2016. 12. 1.>'
제4조3항={}
제4조[제4조3항_]=제4조3항
제4조4항_='④법 제4조제9호 및 제11호에서 "대통령령으로 정하는 서민주택"이란 「주택법」 제2조제6호에 따른 국민주택 규모(「건축법 시행령」 별표 1 제1호다목에 따른 다가구주택의 경우에는 가구당 전용면적을 기준으로 한다) 이하의 주거용 건물과 이에 부수되는 토지(국가, 지방자치단체 또는 「한국토지주택공사법」에 따라 설립된 한국토지주택공사가 해당 주택을 건설하기 위하여 취득하거나 개발ㆍ공급하는 토지를 포함한다)로서 주택바닥면적(아파트ㆍ연립주택 등 공동주택의 경우에는 1세대가 독립하여 구분ㆍ사용할 수 있도록 구획된 부분의 바닥면적을 말한다)에 다음 표의 용도지역별 적용배율을 곱하여 산정한 면적 이내의 토지를 말한다. <개정 2012. 2. 2., 2016. 8. 11.>'
제4조4항={}
제4조[제4조4항_]=제4조4항
제4조['']={}
제4조5항_='⑤법 제4조제11호에서 "대통령령으로 정하는 농가주택"이란 영농에 종사하는 자가 영농을 위하여 소유하는 주거용 건물과 이에 부수되는 토지로서 농지의 소재지와 동일한 시ㆍ군ㆍ구(자치구를 말한다. 이하 이 항에서 같다) 또는 그와 연접한 시ㆍ군ㆍ구의 지역에 소재하는 것을 말한다. 다만, 「소득세법 시행령」 제156조에 따른 고가주택을 제외한다. <개정 2000. 12. 29., 2005. 12. 31., 2010. 12. 30., 2015. 2. 27.>'
제4조5항={}
제4조[제4조5항_]=제4조5항
제4조6항_='⑥법 제4조제12호에서 "대통령령으로 정하는 것"이란 다음 각 호의 어느 하나에 해당하는 감면을 말한다. <개정 1994. 12. 23., 1994. 12. 31., 1995. 12. 30., 1997. 8. 30., 1997. 10. 1., 1997. 12. 31., 1998. 12. 31., 1999. 10. 30., 1999. 12. 31., 2000. 10. 21., 2000. 12. 29., 2001. 8. 14., 2001. 12. 31., 2002. 4. 20., 2002. 12. 30., 2004. 12. 31., 2005. 1. 5., 2005. 12. 31., 2006. 2. 9., 2008. 2. 29., 2009. 2. 4., 2009. 4. 21., 2009. 6. 9., 2009. 12. 15., 2010. 2. 18., 2010. 6. 8., 2010. 7. 9., 2010. 9. 20., 2010. 12. 30., 2011. 7. 14., 2012. 2. 2., 2012. 5. 22., 2013. 3. 23., 2013. 10. 22., 2014. 2. 21., 2014. 11. 19., 2015. 2. 27., 2015. 12. 31., 2016. 2. 5., 2016. 12. 1., 2016. 12. 30., 2017. 6. 27., 2017. 7. 26., 2018. 2. 27., 2018. 12. 31.>'
제4조6항={}
제4조[제4조6항_]=제4조6항
제4조6항1호_='1. 「조세특례제한법」 제10조, 제10조의2, 제11조, 제12조, 제12조의2, 제13조, 제14조, 제18조, 제18조의2, 제29조의6, 제30조, 제30조의3, 제33조, 제63조, 제63조의2, 제64조, 제76조제1항, 제95조의2, 제98조의3, 제98조의5, 제104조의8제1항ㆍ제3항, 제104조의21, 제104조의28, 제121조의2부터 제121조의4까지, 제121조의13, 제126조의2, 제126조의6 및 제126조의7제9항에 따른 감면'
제4조6항1호={}
제4조6항[제4조6항1호_]=제4조6항1호
제4조6항1_02호_='1의2. 「한국철도공사법」에 의하여 설립되는 한국철도공사가 현물출자 받은 국유재산에 대한 취득세 또는 등록에 대한 등록면허세의 감면'
제4조6항1_02호={}
제4조6항[제4조6항1_02호_]=제4조6항1_02호
제4조6항1_03호_='1의3. 삭제 <2014. 12. 30.>'
제4조6항1_03호={}
제4조6항[제4조6항1_03호_]=제4조6항1_03호
제4조6항1_04호_='1의4. 「방송광고판매대행 등에 관한 법률」 제24조에 따라 설립되는 한국방송광고진흥공사에 대한 「지방세특례제한법」 제57조의2제3항제1호에 따른 감면'
제4조6항1_04호={}
제4조6항[제4조6항1_04호_]=제4조6항1_04호
제4조6항1_05호_='1의5. 삭제 <2014. 12. 30.>'
제4조6항1_05호={}
제4조6항[제4조6항1_05호_]=제4조6항1_05호
제4조6항1_06호_='1의6. 「농업협동조합법」 제161조의2 또는 제161조의10에 따라 설립되는 농협경제지주회사 또는 농협금융지주회사에 대한 「지방세특례제한법」 제57조의2제5항제3호에 따른 감면'
제4조6항1_06호={}
제4조6항[제4조6항1_06호_]=제4조6항1_06호
제4조6항1_07호_='1의7. 법률 제10522호 농업협동조합법 일부개정법률 부칙 제6조에 따라 농협경제지주회사가 농업협동조합중앙회로부터 경제사업을 현물출자로 이관받은 경우에 대한 「지방세특례제한법」 제57조의2제3항제3호에 따른 감면'
제4조6항1_07호={}
제4조6항[제4조6항1_07호_]=제4조6항1_07호
제4조6항2호_='2. 「금융회사부실자산 등의 효율적 처리 및 한국자산관리공사의 설립에 관한 법률」에 따른 한국자산관리공사와 「한국농어촌공사 및 농지관리기금법」에 따른 한국농어촌공사가 「혁신도시 조성 및 발전에 관한 특별법」 제43조에 따라 종전부동산을 매입한 경우에 대한 「지방세특례제한법」 제13조제2항제5호 및 제57조의3제2항에 따른 취득세의 면제'
제4조6항2호={}
제4조6항[제4조6항2호_]=제4조6항2호
제4조6항3호_='3. 「조세특례제한법」 제89조의3에 따른 조합등예탁금의 이자소득의 소득세에 대한 감면 중 다음 각 목의 어느 하나에 해당하는 사람에 대한 감면'
제4조6항3호={}
제4조6항[제4조6항3호_]=제4조6항3호
제4조6항3호가목_='가. 「농어가 목돈마련저축에 관한 법률 시행령」 제2조제1항에 따른 농어민'
제4조6항3호가목={}
제4조6항3호[제4조6항3호가목_]=제4조6항3호가목
제4조6항3호나목_='나. 「산림조합법 시행령」 제2조에 따른 임업인. 다만, 5헥타르 이상의 산림을 소유한 사람은 제외한다.'
제4조6항3호나목={}
제4조6항3호[제4조6항3호나목_]=제4조6항3호나목
제4조6항3호다목_='다. 「한국주택금융공사법 시행령」 제2조제1항제1호 및 제2호에 따른 근로자'
제4조6항3호다목={}
제4조6항3호[제4조6항3호다목_]=제4조6항3호다목
제4조6항4호_='4. 「관세법」 제90조제1항제2호부터 제4호까지, 제91조, 제93조제2호ㆍ제3호 및 제15호에 따른 감면'
제4조6항4호={}
제4조6항[제4조6항4호_]=제4조6항4호
제4조6항5호_='5. 「지방세법」 제9조제2항, 「지방세특례제한법」 제13조제2항제1호(「농어촌정비법」에 따라 국가 또는 지방자치단체의 농업생산기반정비계획에 따라 취득ㆍ소유하는 농업기반시설용 토지와 그 시설물로 한정한다), 제15조제2항, 제16조제1항, 제17조, 제17조의2, 제19조, 제20조, 제21조제1항, 제22조제1항ㆍ제5항ㆍ제6항, 제22조의2제1항ㆍ제2항, 제22조의3, 제23조, 제28조제1항, 제29조, 제30조제3항, 제31조제1항부터 제3항까지, 제31조의4, 제33조제1항ㆍ제2항, 제34조, 제36조, 제37조, 제38조제1항, 제40조, 제40조의3, 제41조제1항ㆍ제5항ㆍ제7항, 제42조제2항ㆍ제3항, 제43조제1항, 제44조제1항, 제44조의2, 제45조제1항, 제46조, 제50조제1항, 제52조, 제53조, 제54조제5항, 제57조의2제1항(「법인세법」 제44조제2항 각 호의 요건을 충족하거나 같은 조 제3항에 해당하여 양도손익이 없는 것으로 한 합병의 경우로 한정한다), 제57조의2제3항제2호, 같은 조 제9항, 제58조의2, 제60조제4항, 제63조, 제64조제1항, 제66조제3항ㆍ제4항, 제67조제1항ㆍ제2항, 제72조제1항, 제73조제1항ㆍ제2항, 제73조의2, 제74조제1항, 제76조제1항, 제79조, 제80조, 제81조제1항ㆍ제2항, 제83조제1항ㆍ제2항, 제85조제1항, 제85조의2, 제88조, 제89조 및 제90조제1항에 따른 감면'
제4조6항5호={}
제4조6항[제4조6항5호_]=제4조6항5호
제4조6항6호_='6.「지방세특례제한법」 제4조의 조례에 따른 지방세 감면 중 제1호부터 제5호까지와 유사한 감면으로서 행정안전부장관이 기획재정부장관과 협의하여 고시하는 것'
제4조6항6호={}
제4조6항[제4조6항6호_]=제4조6항6호
제4조7항_='⑦법 또는 이 영에서 농어촌특별세 비과세 대상으로 규정된 「조세특례제한법」의 해당 규정과 같은 취지의 감면을 규정한 법률 제4666호 조세감면규제법개정법률의 해당 규정에 대하여 동법 부칙 제13조 내지 제19조의 규정에 의한 경과조치 또는 특례가 적용되는 경우에 동 경과조치 또는 특례에 대하여서도 농어촌특별세를 부과하지 아니한다. <개정 1998. 12. 31., 2005. 12. 31.>'
제4조7항={}
제4조[제4조7항_]=제4조7항
제5조_=' 제5조 (과세표준의 계산) '
제5조={}
제5조['농어촌특별세법시행령 제5조 (과세표준의 계산)']={}
조문['제5조 (과세표준의 계산)']=제5조
조['제5조 (과세표준의 계산)']=제5조
제5조1항_='① 법 제5조제1항제5호의 과세표준란에서 "대통령령으로 정하는 증권시장"이란 「자본시장과 금융투자업에 관한 법률 시행령」 제176조의9제1항에 따른 유가증권시장을 말한다. <신설 2013. 8. 27.>'
제5조1항={}
제5조[제5조1항_]=제5조1항
제5조2항_='②법 제5조제3항에서 "대통령령으로 정하는 계산방법에 의하여 계산한 금액"이란 다음 산식에 의하여 계산한 금액을 말한다. <개정 2010. 12. 30., 2013. 8. 27.>'
제5조2항={}
제5조[제5조2항_]=제5조2항
제5조['(비과세소득 및 소득공제액을 과세표준에 산입하여 계산한 세액)-(비과세소득ㆍ소득공제액을 과세표준에서 제외하고 계산한 세액)']={}
제5조3항_='③개별소비세 또는 증권거래세를 본세로 하는 농어촌특별세는 「개별소비세법」 또는 「증권거래세법」상의 과세표준에 산입하지 아니한다. <개정 2005. 12. 31., 2007. 12. 31., 2013. 8. 27.>'
제5조3항={}
제5조[제5조3항_]=제5조3항
제5조4항_='④본세를 납부하지 아니함으로써 본세에 가산세가 가산된 때에 그 가산세액은 농어촌특별세의 과세표준에 산입하지 아니한다. <개정 2013. 8. 27.>'
제5조4항={}
제5조[제5조4항_]=제5조4항
제5조5항_='⑤개별소비세를 본세로 하는 농어촌특별세의 과세표준을 계산함에 있어서 농어촌특별세가 부과되는 물품을 원재료로 하여 제조ㆍ가공한 물품에 대하여는 그 제조ㆍ가공한 물품의 개별소비세 산출세액에서 그 원재료에 대하여 납부한 개별소비세액을 공제한 것을 과세표준으로 한다. <개정 2007. 12. 31., 2013. 8. 27.>'
제5조5항={}
제5조[제5조5항_]=제5조5항
제6조_=' 제6조 (신고ㆍ납부등) '
제6조={}
제6조['농어촌특별세법시행령 제6조 (신고ㆍ납부등)']={}
조문['제6조 (신고ㆍ납부등)']=제6조
조['제6조 (신고ㆍ납부등)']=제6조
제6조1항_='①법 제7조의 규정에 의하여 농어촌 특별세를 신고ㆍ납부하는 때에는 당해 본세의 신고ㆍ납부서에 당해 본세의 세액과 농어촌특별세의 세액 및 그 합계액을 각각 기재하여야 한다.'
제6조1항={}
제6조[제6조1항_]=제6조1항
제6조2항_='②농어촌특별세를 「국세기본법」 제45조 및 제46조의 규정에 의하여 수정신고 및 추가자진납부를 하는 경우 수정신고의 기한ㆍ납부방법, 가산세 경감등은 당해 본세의 예에 의한다. <개정 2005. 12. 31.>'
제6조2항={}
제6조[제6조2항_]=제6조2항
제7조_=' 제7조 (부과ㆍ징수) '
제7조={}
제7조['농어촌특별세법시행령 제7조 (부과ㆍ징수)']={}
조문['제7조 (부과ㆍ징수)']=제7조
조['제7조 (부과ㆍ징수)']=제7조
제7조1항_='①법 제8조의 규정에 의하여 농어촌특별세를 부과ㆍ징수하는 때에는 당해 본세의 납세고지서에 당해 세액과 농어촌특별세액 및 그 합계액을 각각 기재하여 고지하여야한다.'
제7조1항={}
제7조[제7조1항_]=제7조1항
제7조2항_='②시장ㆍ군수 및 자치구의 구청장(이하 "시장ㆍ군수"라 한다) 또는 세무서장은 농어촌특별세만을 고지하는 경우에는 농어촌특별세의 과세표준을 표시하여 고지하여야 한다.'
제7조2항={}
제7조[제7조2항_]=제7조2항
제8조_=' 제8조 (분납) '
제8조={}
제8조['농어촌특별세법시행령 제8조 (분납)']={}
조문['제8조 (분납)']=제8조
조['제8조 (분납)']=제8조
제8조1항_='법 제9조제2항의 규정에 의한 농어촌특별세의 분납은 당해 본세의 분납기간이내에 다음 각호에 의하여 분납할 수 있다.'
제8조1항={}
제8조[제8조1항_]=제8조1항
제8조1항1호_='1. 농어촌특별세의 세액이 1천만원이하인 때에는 500만원을 초과하는 금액'
제8조1항1호={}
제8조1항[제8조1항1호_]=제8조1항1호
제8조1항2호_='2. 농어촌특별세의 세액이 1천만원을 초과하는 때에는 그세액의 100분의 50이하의 금액'
제8조1항2호={}
제8조1항[제8조1항2호_]=제8조1항2호
제9조_=' 제9조 삭제  '
제9조={}
제9조['농어촌특별세법시행령 제9조 삭제 ']={}
조문['제9조 삭제 ']=제9조
조['제9조 삭제 ']=제9조
제10조_=' 제10조 (국고납입) '
제10조={}
제10조['농어촌특별세법시행령 제10조 (국고납입)']={}
조문['제10조 (국고납입)']=제10조
조['제10조 (국고납입)']=제10조
제10조1항_='①시장ㆍ군수가 징수한 농어촌특별세는 납부서를 첨부하여 기획재정부장관이 행정안전부장관과 협의하여 별도로 정한 절차에 따라 한국은행(국고대리점을 포함한다. 이하 이 조에서 같다) 또는 체신관서에 납입하여야 한다. <개정 1995. 11. 30., 1998. 12. 31., 2008. 2. 29., 2013. 3. 23., 2014. 11. 19., 2017. 7. 26.>'
제10조1항={}
제10조[제10조1항_]=제10조1항
제10조2항_='②지방자치단체의 금고 또는 그 수납대리점에서 농어촌특별세를 수납한 경우에는 영수필통지서를 시장ㆍ군수에게 송부하고 수납한 농어촌특별세는 이를 직접 국고에 납입하여야 한다.'
제10조2항={}
제10조[제10조2항_]=제10조2항
제10조3항_='③「지방세징수법 시행령」 제24조제1항은 지방세액에 부과되는 농어촌특별세에 관하여 이를 준용한다. <개정 2005. 12. 31., 2010. 9. 20., 2017. 3. 27.>'
제10조3항={}
제10조[제10조3항_]=제10조3항
제11조_=' 제11조 (환급) '
제11조={}
제11조['농어촌특별세법시행령 제11조 (환급)']={}
조문['제11조 (환급)']=제11조
조['제11조 (환급)']=제11조
제11조1항_='①시장ㆍ군수가 법 제12조의 규정에 의하여 농어촌특별세를 환급하는 경우에는 시ㆍ군의 수입금중에서 환급세액에 상당하는 금액을 충당한다.'
제11조1항={}
제11조[제11조1항_]=제11조1항
제11조2항_='②제1항의 규정에 의하여 시ㆍ군의 수입금에서 농어촌특별세의 환급세액에 상당하는 금액을 충당하고자 하는 경우에는 시ㆍ군 금고가 수납한 농어촌특별세중 환급세액에 상당하는 금액을 국고에 납입하지 아니하고 시ㆍ군 금고의 수입금이 되도록 조치한다. 이 경우 시ㆍ군 공무원이 농어촌특별세를 징수한 경우에는 환급세액에 상당하는 금액을 직접 시ㆍ군 금고에 납입할 수 있다.'
제11조2항={}
제11조[제11조2항_]=제11조2항
제12조_=' 제12조 (부과ㆍ징수상황의 보고) '
제12조={}
제12조['농어촌특별세법시행령 제12조 (부과ㆍ징수상황의 보고)']={}
조문['제12조 (부과ㆍ징수상황의 보고)']=제12조
조['제12조 (부과ㆍ징수상황의 보고)']=제12조
제12조1항_='시장ㆍ군수는 매월 농어촌특별세의 부과ㆍ징수 상황을 다음달 20일까지 기획재정부장관에게 보고하여야 한다. <개정 1994. 12. 23., 1998. 12. 31., 2008. 2. 29.>'
제12조1항={}
제12조[제12조1항_]=제12조1항
부칙['부칙  <제29438호, 2018. 12. 31.>  (지방세특례제한법 시행령']={}
부칙['제1조(시행일) 이 영은 2019년 1월 1일부터 시행한다']={}
부칙['제2조부터 제5조까지 생']={}
부칙['제6조(다른 법령의 개정) ① 생']={}
부칙['② 농어촌특별세법 시행령 일부를 다음과 같이 개정한다']={}
부칙['제4조제6항제5호 중 "제16조, 제17조"를 "제16조제1항, 제17조"로, "제33조, 제34조"를 "제33조제1항ㆍ제2항, 제34조"로, "제44조, 제44조의2"를 "제44조제1항, 제44조의2"로 한다']={}
bub={'서문':서문,'조문':조문,'조별':조,'부칙':부칙}
    
import wx
class MyFrame(wx.Frame):
    def __init__(self):
        wx.Frame.__init__(self, parent=None, title=bubname)
        self.SetSize(620, 520)
        self.mainPanel = wx.Panel(self)
        self.expandButton = wx.Button(self.mainPanel, label=bubname)
        self.tree = wx.TreeCtrl(self.mainPanel)
        root = self.tree.AddRoot(bubname)
        for i in bub:
            ii = self.tree.AppendItem(root, i)
            for j in bub[i]:
                jj = self.tree.AppendItem(ii, j)
                for k in bub[i][j]:
                    kk = self.tree.AppendItem(jj, k)
                    for m in bub[i][j][k]:
                        mm = self.tree.AppendItem(kk, m)
                        for n in bub[i][j][k][m]:
                            nn = self.tree.AppendItem(mm, n)
                            for p in bub[i][j][k][m][n]:
                                pp = self.tree.AppendItem(nn, p)
                                for q in bub[i][j][k][m][n][p]:
                                    qq=self.tree.AppendItem(pp,q)
                                    for r in bub[i][j][k][m][n][p][q]:
                                        rr=self.tree.AppendItem(qq,r)
                                        for s in bub[i][j][k][m][n][p][q][r]:
                                            ss = self.tree.AppendItem(rr, s)
                                            for t in bub[i][j][k][m][n][p][q][r][s]:
                                                tt = self.tree.AppendItem(ss, t)
                                                for u in bub[i][j][k][m][n][p][q][r][s][t]:
                                                    uu = self.tree.AppendItem(tt, u)
                                                    for v in bub[i][j][k][m][n][p][q][r][s][t][u]:
                                                        vv = self.tree.AppendItem(uu, v)
        self.staticText = wx.TextCtrl(self.mainPanel, style=wx.TE_MULTILINE)
        self.vtBoxSizer = wx.BoxSizer(wx.VERTICAL)
        self.vtBoxSizer.Add(self.expandButton, 0, wx.EXPAND | wx.ALL, 5)
        self.vtBoxSizer.Add(self.tree, 5, wx.EXPAND | wx.ALL, 5)
        self.vtBoxSizer.Add(self.staticText, 0, wx.EXPAND | wx.ALL, 5)
        self.mainPanel.SetSizer(self.vtBoxSizer)
        self.Bind(wx.EVT_BUTTON, self.OnExpandButton, self.expandButton)
        self.Bind(wx.EVT_TREE_SEL_CHANGED, self.OnNodeSelected, self.tree)
        self.Bind(wx.EVT_CLOSE, self.OnClose)

    def OnExpandButton(self, e):
        self.tree.ExpandAll()

    def __del__(self):
        print('소멸합니다.')

    def OnClose(self, event):
        frame.Destroy()

    def OnNodeSelected(self, e):
        selected = self.tree.GetSelection()
        self.staticText.SetLabel(self.tree.GetItemText(selected))
        self.mainPanel.Layout()
if __name__ == '__main__':
    app = wx.App(redirect=True)
    frame = MyFrame()
    wnd = wx.Frame(None, wx.ID_ANY, "")
    wnd.CenterOnScreen()
    app.SetTopWindow(wnd)
    frame.Show()
    app.MainLoop()
    