# -*- coding: utf-8 -*-
#Created on 2019년 @author: 권달현
조={};서문={};조문={};부칙 = {};bubname='농어촌특별세법'
편=장=절=관=항=조={} 
서문['']={}
서문['농어촌특별세']={}
서문['[시행 2019. 1. 1] [법률 제16100호, 2018. 12. 31, 일부개정']={}
서문['기획재정부(조세특례제도과) 044-215-413']={}
제1조_=' 제1조 (목적) '
제1조={}
제1조['농어촌특별세법 제1조 (목적)']={}
조문['제1조 (목적)']=제1조
조['제1조 (목적)']=제1조
제1조1항_='이 법은 농어업의 경쟁력강화와 농어촌산업기반시설의 확충 및 농어촌지역 개발사업을 위하여 필요한 재원을 확보함을 목적으로 한다.'
제1조1항={}
제1조[제1조1항_]=제1조1항
제1조['[전문개정 2010. 12. 30.]']={}
제2조_=' 제2조 (정의) '
제2조={}
제2조['농어촌특별세법 제2조 (정의)']={}
조문['제2조 (정의)']=제2조
조['제2조 (정의)']=제2조
제2조1항_='① 이 법에서 "감면"이란 「조세특례제한법」ㆍ「관세법」ㆍ「지방세법」 또는 「지방세특례제한법」에 따라 소득세ㆍ법인세ㆍ관세ㆍ취득세 또는 등록에 대한 등록면허세가 부과되지 아니하거나 경감되는 경우로서 다음 각 호의 어느 하나에 해당하는 것을 말한다. <개정 2010. 12. 30.>'
제2조1항={}
제2조[제2조1항_]=제2조1항
제2조1항1호_='1. 비과세ㆍ세액면제ㆍ세액감면ㆍ세액공제 또는 소득공제'
제2조1항1호={}
제2조1항[제2조1항1호_]=제2조1항1호
제2조1항2호_='2. 「조세특례제한법」 제72조제1항에 따른 조합법인 등에 대한 법인세 특례세율의 적용 또는 같은 법 제89조제1항 및 제89조의3에 따른 이자소득ㆍ배당소득에 대한 소득세 특례세율의 적용'
제2조1항2호={}
제2조1항[제2조1항2호_]=제2조1항2호
제2조1항3호_='3. 「지방세법」 제15조제1항에 따른 취득세 특례세율의 적용'
제2조1항3호={}
제2조1항[제2조1항3호_]=제2조1항3호
제2조2항_='② 이 법에서 "본세"란 다음 각 호의 것을 말한다. <개정 2001. 12. 29., 2005. 1. 5., 2007. 12. 31., 2010. 3. 31., 2010. 12. 30.>'
제2조2항={}
제2조[제2조2항_]=제2조2항
제2조2항1호_='1. 제5조제1항제1호에 따른 농어촌특별세의 경우에는 감면을 받는 해당 소득세ㆍ법인세ㆍ관세ㆍ취득세 또는 등록에 대한 등록면허세'
제2조2항1호={}
제2조2항[제2조2항1호_]=제2조2항1호
제2조2항2호_='2. 제5조제1항제2호에 따른 농어촌특별세의 경우에는 소득세'
제2조2항2호={}
제2조2항[제2조2항2호_]=제2조2항2호
제2조2항3호_='3. 삭제 <2010. 12. 30.>'
제2조2항3호={}
제2조2항[제2조2항3호_]=제2조2항3호
제2조2항4호_='4. 제5조제1항제4호에 따른 농어촌특별세의 경우에는 개별소비세'
제2조2항4호={}
제2조2항[제2조2항4호_]=제2조2항4호
제2조2항5호_='5. 제5조제1항제5호에 따른 농어촌특별세의 경우에는 증권거래세'
제2조2항5호={}
제2조2항[제2조2항5호_]=제2조2항5호
제2조2항6호_='6. 제5조제1항제6호에 따른 농어촌특별세의 경우에는 취득세'
제2조2항6호={}
제2조2항[제2조2항6호_]=제2조2항6호
제2조2항7호_='7. 제5조제1항제7호에 따른 농어촌특별세의 경우에는 레저세'
제2조2항7호={}
제2조2항[제2조2항7호_]=제2조2항7호
제2조2항8호_='8. 제5조제1항제8호에 따른 농어촌특별세의 경우에는 종합부동산세'
제2조2항8호={}
제2조2항[제2조2항8호_]=제2조2항8호
제2조3항_='③ 제1항 및 제2항에 규정된 용어 외의 용어에 대한 정의는 본세에 관한 법률이 정하는 바에 따른다. <개정 2010. 12. 30.>'
제2조3항={}
제2조[제2조3항_]=제2조3항
제2조['[제목개정 2010. 12. 30.]']={}
제3조_=' 제3조 (납세의무자) '
제3조={}
제3조['농어촌특별세법 제3조 (납세의무자)']={}
조문['제3조 (납세의무자)']=제3조
조['제3조 (납세의무자)']=제3조
제3조1항_='다음 각 호의 어느 하나에 해당하는 자는 이 법에 따라 농어촌특별세를 납부할 의무를 진다. <개정 1994. 12. 22., 1998. 12. 28., 1999. 12. 3., 2001. 12. 29., 2005. 1. 5., 2007. 12. 31., 2010. 1. 1., 2010. 3. 31., 2010. 12. 30.>'
제3조1항={}
제3조[제3조1항_]=제3조1항
제3조1항1호_='1. 제2조제1항 각 호 외의 부분에 규정된 법률에 따라 소득세ㆍ법인세ㆍ관세ㆍ취득세 또는 등록에 대한 등록면허세의 감면을 받는 자'
제3조1항1호={}
제3조1항[제3조1항1호_]=제3조1항1호
제3조1항2호_='2. 삭제 <2010. 12. 30.>'
제3조1항2호={}
제3조1항[제3조1항2호_]=제3조1항2호
제3조1항3호_='3. 「개별소비세법」 제1조제2항의 물품 중 같은 항 제1호가목1)ㆍ2), 같은 호 다목, 같은 항 제2호나목1)ㆍ2)의 물품 또는 같은 조 제3항제4호의 입장행위에 대한 개별소비세 납세의무자'
제3조1항3호={}
제3조1항[제3조1항3호_]=제3조1항3호
제3조1항4호_='4. 「증권거래세법」 제3조제1호에 규정된 증권거래세 납세의무자'
제3조1항4호={}
제3조1항[제3조1항4호_]=제3조1항4호
제3조1항5호_='5. 「지방세법」에 따른 취득세 또는 레저세의 납세의무자'
제3조1항5호={}
제3조1항[제3조1항5호_]=제3조1항5호
제3조1항6호_='6. 「종합부동산세법」에 따른 종합부동산세의 납세의무자'
제3조1항6호={}
제3조1항[제3조1항6호_]=제3조1항6호
제3조['[제목개정 2010. 12. 30.]']={}
제4조_=' 제4조 (비과세) '
제4조={}
제4조['농어촌특별세법 제4조 (비과세)']={}
조문['제4조 (비과세)']=제4조
조['제4조 (비과세)']=제4조
제4조1항_='다음 각 호의 어느 하나에 해당하는 경우에는 농어촌특별세를 부과하지 아니한다. <개정 1994. 12. 22., 1995. 12. 29., 1996. 10. 2., 1997. 8. 30., 1997. 12. 13., 1998. 2. 24., 1998. 9. 16., 1998. 12. 28., 1999. 2. 5., 1999. 12. 28., 2000. 10. 21., 2000. 12. 29., 2004. 7. 26., 2009. 3. 18., 2009. 4. 1., 2010. 3. 31., 2010. 12. 30., 2011. 12. 31., 2014. 1. 1., 2014. 5. 14., 2014. 12. 31., 2015. 6. 22., 2015. 12. 15., 2016. 12. 20., 2018. 12. 31.>'
제4조1항={}
제4조[제4조1항_]=제4조1항
제4조1항1호_='1. 국가(외국정부를 포함한다)ㆍ지방자치단체 또는 지방자치단체조합에 대한 감면'
제4조1항1호={}
제4조1항[제4조1항1호_]=제4조1항1호
제4조1항2호_='2. 농어업인(「농업ㆍ농촌 및 식품산업 기본법」 제3조제2호의 농업인과 「수산업ㆍ어촌 발전 기본법」 제3조제3호의 어업인을 말한다. 이하 같다) 또는 농어업인을 조합원으로 하는 단체(「농어업경영체 육성 및 지원에 관한 법률」에 따른 영농조합법인, 농업회사법인 및 영어조합법인를 포함한다)에 대한 감면으로서 대통령령으로 정하는 것'
제4조1항2호={}
제4조1항[제4조1항2호_]=제4조1항2호
제4조1항3호_='3. 「조세특례제한법」 제6조ㆍ제7조에 따른 중소기업에 대한 세액감면ㆍ특별세액감면 및 「지방세특례제한법」 제58조의3제1항ㆍ제3항에 따른 세액감면'
제4조1항3호={}
제4조1항[제4조1항3호_]=제4조1항3호
제4조1항3_02호_='3의2. 「조세특례제한법」 제40조에 따른 양도소득세의 감면'
제4조1항3_02호={}
제4조1항[제4조1항3_02호_]=제4조1항3_02호
제4조1항3_03호_='3의3. 「조세특례제한법」 제16조의 소득공제에 따른 감면'
제4조1항3_03호={}
제4조1항[제4조1항3_03호_]=제4조1항3_03호
제4조1항4호_='4. 「조세특례제한법」 제86조의3ㆍ제87조ㆍ제87조의2ㆍ제87조의5ㆍ제88조의2ㆍ제88조의4ㆍ제88조의5ㆍ제91조의14ㆍ제91조의16ㆍ제91조의17ㆍ제91조의18 및 제91조의19에 따른 저축 또는 배당에 대한 감면'
제4조1항4호={}
제4조1항[제4조1항4호_]=제4조1항4호
제4조1항4_02호_='4의2. 삭제 <2000. 12. 29.>'
제4조1항4_02호={}
제4조1항[제4조1항4_02호_]=제4조1항4_02호
제4조1항5호_='5. 「조세특례제한법」 제21조에 따른 이자소득 등에 대한 감면 중 비거주자 또는 외국법인에 대한 감면'
제4조1항5호={}
제4조1항[제4조1항5호_]=제4조1항5호
제4조1항6호_='6. 국제협약ㆍ국제관례 등에 따른 관세의 감면으로서 대통령령으로 정하는 것'
제4조1항6호={}
제4조1항[제4조1항6호_]=제4조1항6호
제4조1항7호_='7. 「증권거래세법」 제6조에 따라 증권거래세가 부과되지 아니하거나 같은 법 제8조제2항에 따라 영의 세율이 적용되는 경우'
제4조1항7호={}
제4조1항[제4조1항7호_]=제4조1항7호
제4조1항7_02호_='7의2. 「조세특례제한법」 제117조에 따라 증권거래세가 면제되는 경우'
제4조1항7_02호={}
제4조1항[제4조1항7_02호_]=제4조1항7_02호
제4조1항8호_='8. 「지방세법」과 「지방세특례제한법」에 따른 형식적인 소유권의 취득, 단순한 표시변경 등기 또는 등록, 임시건축물의 취득, 천재지변 등으로 인한 대체취득 등에 대한 취득세 및 등록면허세의 감면으로서 대통령령으로 정하는 것'
제4조1항8호={}
제4조1항[제4조1항8호_]=제4조1항8호
제4조1항8_02호_='8의2. 삭제 <2014. 12. 31.>'
제4조1항8_02호={}
제4조1항[제4조1항8_02호_]=제4조1항8_02호
제4조1항9호_='9. 대통령령으로 정하는 서민주택에 대한 취득세 또는 등록에 대한 등록면허세의 감면'
제4조1항9호={}
제4조1항[제4조1항9호_]=제4조1항9호
제4조1항10호_='10. 「지방세특례제한법」 제6조제1항의 적용대상이 되는 농지 및 임야에 대한 취득세'
제4조1항10호={}
제4조1항[제4조1항10호_]=제4조1항10호
제4조1항10_02호_='10의2. 「지방세법」 제124조에 따른 자동차에 대한 취득세'
제4조1항10_02호={}
제4조1항[제4조1항10_02호_]=제4조1항10_02호
제4조1항10_03호_='10의3. 「지방세특례제한법」 제35조제1항에 따른 등록면허세의 감면'
제4조1항10_03호={}
제4조1항[제4조1항10_03호_]=제4조1항10_03호
제4조1항10_04호_='10의4. 「지방세법」 제15조제1항제1호부터 제3호까지의 규정에 따른 취득세'
제4조1항10_04호={}
제4조1항[제4조1항10_04호_]=제4조1항10_04호
제4조1항10_05호_='10의5. 「지방세특례제한법」 제8조제4항에 따른 취득세'
제4조1항10_05호={}
제4조1항[제4조1항10_05호_]=제4조1항10_05호
제4조1항11호_='11. 대통령령으로 정하는 서민주택 및 농가주택에 대한 취득세'
제4조1항11호={}
제4조1항[제4조1항11호_]=제4조1항11호
제4조1항11_02호_='11의2. 「조세특례제한법」 제20조ㆍ제100조ㆍ제140조 및 제141조에 따른 감면'
제4조1항11_02호={}
제4조1항[제4조1항11_02호_]=제4조1항11_02호
제4조1항11_03호_='11의3. 「조세특례제한법」 제30조의2 및 제30조의4에 따른 감면'
제4조1항11_03호={}
제4조1항[제4조1항11_03호_]=제4조1항11_03호
제4조1항11_04호_='11의4. 「조세특례제한법」 제121조의24에 따른 감면'
제4조1항11_04호={}
제4조1항[제4조1항11_04호_]=제4조1항11_04호
제4조1항12호_='12. 기술 및 인력개발, 저소득자의 재산형성, 공익사업 등 국가경쟁력의 확보 또는 국민경제의 효율적 운영을 위하여 농어촌특별세를 비과세할 필요가 있다고 인정되는 경우로서 대통령령으로 정하는 것'
제4조1항12호={}
제4조1항[제4조1항12호_]=제4조1항12호
제4조['[제목개정 2010. 12. 30.]']={}
제5조_=' 제5조 (과세표준과 세율) '
제5조={}
제5조['농어촌특별세법 제5조 (과세표준과 세율)']={}
조문['제5조 (과세표준과 세율)']=제5조
조['제5조 (과세표준과 세율)']=제5조
제5조1항_='①농어촌특별세는 다음 각 호의 과세표준에 대한 세율을 곱하여 계산한 금액을 그 세액으로 한다. <개정 1994. 12. 22., 1998. 12. 28., 1999. 12. 28., 2000. 12. 29., 2001. 12. 29., 2005. 1. 5., 2007. 12. 31., 2010. 12. 30., 2013. 5. 28.>'
제5조1항={}
제5조[제5조1항_]=제5조1항
제5조['']={}
제5조2항_='② 「조세특례제한법」 제72조제1항에 따른 조합법인 등의 경우에는 제1호에 규정된 세액에서 제2호에 규정된 세액을 차감한 금액을 감면을 받는 세액으로 보아 제1항제1호를 적용한다. <개정 2010. 12. 30.>'
제5조2항={}
제5조[제5조2항_]=제5조2항
제5조2항1호_='1. 해당 법인의 각 사업연도 과세표준금액에 「법인세법」 제55조제1항에 규정된 세율을 적용하여 계산한 법인세액'
제5조2항1호={}
제5조2항[제5조2항1호_]=제5조2항1호
제5조2항2호_='2. 해당 법인의 각 사업연도 과세표준금액에 「조세특례제한법」 제72조제1항에 규정된 세율을 적용하여 계산한 법인세액'
제5조2항2호={}
제5조2항[제5조2항2호_]=제5조2항2호
제5조3항_='③ 비과세 및 소득공제를 받는 경우에는 대통령령으로 정하는 계산방법에 의하여 계산한 금액을 감면을 받는 세액으로 보아 제1항제1호를 적용한다. <개정 2010. 12. 30.>'
제5조3항={}
제5조[제5조3항_]=제5조3항
제5조4항_='④ 「조세특례제한법」에 따라 이자소득ㆍ배당소득에 대한 소득세가 부과되지 아니하거나 소득세특례세율이 적용되는 경우에는 제1호에 규정된 세액에서 제2호에 규정된 세액을 차감한 금액을 감면을 받는 세액으로 보아 제1항제2호를 적용한다. <개정 2010. 12. 30.>'
제5조4항={}
제5조[제5조4항_]=제5조4항
제5조4항1호_='1. 이자소득ㆍ배당소득에 다음 각 목의 어느 하나의 율을 곱하여 계산한 금액'
제5조4항1호={}
제5조4항[제5조4항1호_]=제5조4항1호
제5조4항1호가목_='가. 이자소득의 경우에는 100분의 14'
제5조4항1호가목={}
제5조4항1호[제5조4항1호가목_]=제5조4항1호가목
제5조4항1호나목_='나. 배당소득의 경우에는 100분의 14'
제5조4항1호나목={}
제5조4항1호[제5조4항1호나목_]=제5조4항1호나목
제5조4항2호_='2. 「조세특례제한법」에 따라 납부하는 소득세액(소득세가 부과되지 아니하는 경우에는 영으로 한다)'
제5조4항2호={}
제5조4항[제5조4항2호_]=제5조4항2호
제5조5항_='⑤ 제1항제6호에도 불구하고 「지방세법」 제15조제2항에 해당하는 경우에는 같은 항에 따라 계산한 취득세액을 제1항제6호의 과세표준으로 본다. <신설 2010. 12. 30.>'
제5조5항={}
제5조[제5조5항_]=제5조5항
제6조_=' 제6조 (납세지) '
제6조={}
제6조['농어촌특별세법 제6조 (납세지)']={}
조문['제6조 (납세지)']=제6조
조['제6조 (납세지)']=제6조
제6조1항_='농어촌특별세의 납세지는 해당 본세의 납세지로 한다.'
제6조1항={}
제6조[제6조1항_]=제6조1항
제6조['[전문개정 2010. 12. 30.]']={}
제7조_=' 제7조 (신고ㆍ납부 등) '
제7조={}
제7조['농어촌특별세법 제7조 (신고ㆍ납부 등)']={}
조문['제7조 (신고ㆍ납부 등)']=제7조
조['제7조 (신고ㆍ납부 등)']=제7조
제7조1항_='① 제5조제1항제1호에 따른 농어촌특별세는 해당 본세를 신고ㆍ납부(중간예납은 제외한다)하는 때에 그에 대한 농어촌특별세도 함께 신고ㆍ납부하여야 하며, 신고ㆍ납부할 본세가 없는 경우에는 해당 본세의 신고ㆍ납부의 예에 따라 신고ㆍ납부하여야 한다. 다만, 제3항이 적용되는 경우에는 그러하지 아니하다. <개정 2010. 12. 30.>'
제7조1항={}
제7조[제7조1항_]=제7조1항
제7조2항_='② 제1항에도 불구하고 「법인세법」에 따른 연결납세방식을 적용받는 법인의 경우에는 같은 법 제1조제9호에 따른 연결모법인이 신고ㆍ납부하여야 한다. 이 경우 그 납부의무에 관하여는 「법인세법」 제3조제3항을 준용한다. <신설 2011. 12. 31., 2018. 12. 24.>'
제7조2항={}
제7조[제7조2항_]=제7조2항
제7조3항_='③ 「소득세법」에 따른 원천징수의무자가 제5조제1항제1호 또는 제2호를 적용받는 소득금액을 지급하는 때에는 「소득세법」의 원천징수의 예에 따라 농어촌특별세를 징수하여 신고ㆍ납부하여야 한다. <개정 2010. 12. 30.>'
제7조3항={}
제7조[제7조3항_]=제7조3항
제7조4항_='④ 제5조제1항제4호부터 제8호까지의 규정에 따른 농어촌특별세는 해당 본세를 신고ㆍ납부하거나 거래징수(「증권거래세법」 제9조에 따른 거래징수를 말한다. 이하 같다)하여 납부하는 때에 그에 대한 농어촌특별세도 함께 신고ㆍ납부하여야 한다. <개정 2010. 12. 30.>'
제7조4항={}
제7조[제7조4항_]=제7조4항
제7조5항_='⑤ 제1항부터 제4항까지의 규정에 따른 신고ㆍ납부 등에 관하여 필요한 사항은 대통령령으로 정한다. <개정 2010. 12. 30., 2011. 12. 31.>'
제7조5항={}
제7조[제7조5항_]=제7조5항
제7조['[제목개정 2010. 12. 30.]']={}
제8조_=' 제8조 (부과ㆍ징수) '
제8조={}
제8조['농어촌특별세법 제8조 (부과ㆍ징수)']={}
조문['제8조 (부과ㆍ징수)']=제8조
조['제8조 (부과ㆍ징수)']=제8조
제8조1항_='① 삭제 <2005. 1. 5.>'
제8조1항={}
제8조[제8조1항_]=제8조1항
제8조2항_='② 제7조에 따라 농어촌특별세의 신고ㆍ납부 및 원천징수 등을 하여야 할 자가 신고를 하지 아니하거나 신고내용에 오류 또는 누락이 있는 경우와 납부하여야 할 세액을 납부하지 아니하거나 미달하게 납부한 경우에는 다음 각 호에 따른다. <개정 2010. 12. 30.>'
제8조2항={}
제8조[제8조2항_]=제8조2항
제8조2항1호_='1. 제3조제1호의 납세의무자 중 소득세 또는 법인세의 감면을 받는 자와 제3조제3호ㆍ제4호 및 제6호의 납세의무자(같은 조 제3호의 납세의무자 중 물품을 수입하는 자는 제외한다)에 대하여는 세무서장이 해당 본세의 결정ㆍ경정 및 징수의 예에 따라 결정ㆍ경정 및 징수한다.'
제8조2항1호={}
제8조2항[제8조2항1호_]=제8조2항1호
제8조2항2호_='2. 제3조제1호의 납세의무자 중 관세의 감면을 받는 자와 제3조제3호의 납세의무자 중 물품을 수입하는 자에 대하여는 세관장이 관세의 부과ㆍ징수의 예에 따라 부과ㆍ징수한다.'
제8조2항2호={}
제8조2항[제8조2항2호_]=제8조2항2호
제8조2항3호_='3. 제3조제1호의 납세의무자 중 취득세 또는 등록에 대한 등록면허세의 감면을 받는 자와 제3조제5호에 따른 납세의무자에 대하여는 시장ㆍ군수 및 자치구의 구청장(이하 "시장ㆍ군수"라 한다)이 해당 본세의 부과ㆍ징수의 예에 따라 부과ㆍ징수한다.'
제8조2항3호={}
제8조2항[제8조2항3호_]=제8조2항3호
제8조['[제목개정 2010. 12. 30.]']={}
제9조_=' 제9조 (분납) '
제9조={}
제9조['농어촌특별세법 제9조 (분납)']={}
조문['제9조 (분납)']=제9조
조['제9조 (분납)']=제9조
제9조1항_='① 제3조 각 호의 납세의무자가 본세를 해당 세법에 따라 분납하는 경우에는 농어촌특별세도 그 분납금액의 비율에 의하여 해당 본세의 분납의 예에 따라 분납할 수 있다.'
제9조1항={}
제9조[제9조1항_]=제9조1항
제9조2항_='② 본세가 해당 세법에 따른 분납기준금액에 미달하여 그 본세를 분납하지 아니하는 경우에도 농어촌특별세의 세액이 500만원을 초과하는 경우에는 대통령령으로 정하는 바에 따라 분납할 수 있다.'
제9조2항={}
제9조[제9조2항_]=제9조2항
제9조['[전문개정 2010. 12. 30.]']={}
제10조_=' 제10조 (국고납입) '
제10조={}
제10조['농어촌특별세법 제10조 (국고납입)']={}
조문['제10조 (국고납입)']=제10조
조['제10조 (국고납입)']=제10조
제10조1항_='시장ㆍ군수가 농어촌특별세를 징수한 때에는 대통령령으로 정하는 바에 따라 이를 국고에 납입하여야 한다.'
제10조1항={}
제10조[제10조1항_]=제10조1항
제10조['[전문개정 2010. 12. 30.]']={}
제11조_=' 제11조 (불복) '
제11조={}
제11조['농어촌특별세법 제11조 (불복)']={}
조문['제11조 (불복)']=제11조
조['제11조 (불복)']=제11조
제11조1항_='지방세를 본세로 하는 농어촌특별세에 대한 이의신청, 심사청구 및 심판청구에 대해서는 「지방세기본법」의 예에 따른다.'
제11조1항={}
제11조[제11조1항_]=제11조1항
제11조['[본조신설 2014. 1. 1.]']={}
제12조_=' 제12조 (환급) '
제12조={}
제12조['농어촌특별세법 제12조 (환급)']={}
조문['제12조 (환급)']=제12조
조['제12조 (환급)']=제12조
제12조1항_='농어촌특별세의 과오납금 등(감면을 받은 세액을 추징함에 따라 발생하는 환급금을 포함한다)에 대한 환급은 본세의 환급의 예에 따른다.'
제12조1항={}
제12조[제12조1항_]=제12조1항
제12조['[전문개정 2010. 12. 30.]']={}
제13조_=' 제13조 (필요경비 또는 손금불산입) '
제13조={}
제13조['농어촌특별세법 제13조 (필요경비 또는 손금불산입)']={}
조문['제13조 (필요경비 또는 손금불산입)']=제13조
조['제13조 (필요경비 또는 손금불산입)']=제13조
제13조1항_='「소득세법」 또는 「법인세법」에 따라 필요경비 또는 손금에 산입되지 아니하는 본세에 대한 농어촌특별세는 「소득세법」 또는 「법인세법」에 따른 소득금액계산에 있어서 필요경비 또는 손금에 산입하지 아니한다.'
제13조1항={}
제13조[제13조1항_]=제13조1항
제13조['[전문개정 2010. 12. 30.]']={}
부칙['부칙  <제16100호, 2018. 12. 31.']={}
부칙['제1조(시행일) 이 법은 2019년 1월 1일부터 시행한다']={}
부칙['제2조(비과세에 관한 적용례) 제4조제4호의 개정규정은 이 법 시행 이후 감면받는 분부터 적용한다']={}
bub={'서문':서문,'조문':조문,'조별':조,'부칙':부칙}
    
import wx
class MyFrame(wx.Frame):
    def __init__(self):
        wx.Frame.__init__(self, parent=None, title=bubname)
        self.SetSize(620, 520)
        self.mainPanel = wx.Panel(self)
        self.expandButton = wx.Button(self.mainPanel, label=bubname)
        self.tree = wx.TreeCtrl(self.mainPanel)
        root = self.tree.AddRoot(bubname)
        for i in bub:
            ii = self.tree.AppendItem(root, i)
            for j in bub[i]:
                jj = self.tree.AppendItem(ii, j)
                for k in bub[i][j]:
                    kk = self.tree.AppendItem(jj, k)
                    for m in bub[i][j][k]:
                        mm = self.tree.AppendItem(kk, m)
                        for n in bub[i][j][k][m]:
                            nn = self.tree.AppendItem(mm, n)
                            for p in bub[i][j][k][m][n]:
                                pp = self.tree.AppendItem(nn, p)
                                for q in bub[i][j][k][m][n][p]:
                                    qq=self.tree.AppendItem(pp,q)
                                    for r in bub[i][j][k][m][n][p][q]:
                                        rr=self.tree.AppendItem(qq,r)
                                        for s in bub[i][j][k][m][n][p][q][r]:
                                            ss = self.tree.AppendItem(rr, s)
                                            for t in bub[i][j][k][m][n][p][q][r][s]:
                                                tt = self.tree.AppendItem(ss, t)
                                                for u in bub[i][j][k][m][n][p][q][r][s][t]:
                                                    uu = self.tree.AppendItem(tt, u)
                                                    for v in bub[i][j][k][m][n][p][q][r][s][t][u]:
                                                        vv = self.tree.AppendItem(uu, v)
        self.staticText = wx.TextCtrl(self.mainPanel, style=wx.TE_MULTILINE)
        self.vtBoxSizer = wx.BoxSizer(wx.VERTICAL)
        self.vtBoxSizer.Add(self.expandButton, 0, wx.EXPAND | wx.ALL, 5)
        self.vtBoxSizer.Add(self.tree, 5, wx.EXPAND | wx.ALL, 5)
        self.vtBoxSizer.Add(self.staticText, 0, wx.EXPAND | wx.ALL, 5)
        self.mainPanel.SetSizer(self.vtBoxSizer)
        self.Bind(wx.EVT_BUTTON, self.OnExpandButton, self.expandButton)
        self.Bind(wx.EVT_TREE_SEL_CHANGED, self.OnNodeSelected, self.tree)
        self.Bind(wx.EVT_CLOSE, self.OnClose)

    def OnExpandButton(self, e):
        self.tree.ExpandAll()

    def __del__(self):
        print('소멸합니다.')

    def OnClose(self, event):
        frame.Destroy()

    def OnNodeSelected(self, e):
        selected = self.tree.GetSelection()
        self.staticText.SetLabel(self.tree.GetItemText(selected))
        self.mainPanel.Layout()
if __name__ == '__main__':
    app = wx.App(redirect=True)
    frame = MyFrame()
    wnd = wx.Frame(None, wx.ID_ANY, "")
    wnd.CenterOnScreen()
    app.SetTopWindow(wnd)
    frame.Show()
    app.MainLoop()
    