# -*- coding: utf-8 -*-
#Created on 2018-11-6 @author: 권달현
양도소득세={#양도소득세_과세대상'으로
    '동일기업 지분의 양도시 과세':{},
    '동일기업 자산의 분배시 과세':{},
}
법인세={
        "동업기업을 실질적 측면에서 도관(Pass-through entity)으로 보아 동업 기업에서 발생한 소득에 대해 동업기업 단계에서는 과세하지 않고, 이를 구성원인 동업자에게 귀속시켜 동업자별로 과세하는 제도입니다. ": {},
        "※ 동업기업 과세특례에 대한 자세한 설명은 국세청 발간책자 ‘동업기업 과세특례의 이해’를 참조하시기 바랍니다(국세청 누리집에서 확인가능함). ": {},
        "가. 적용범위 ": {

            "(1) 동업기업이란 (조특법 §100의14) ": {
                "  2명 이상이 금전이나 그밖의 재산 또는 노무 등을 출자하여 공동사업을 경영하면서 발생한 이익 또는 손실을 배분받기 위하여 설립한 단체를 말합니다. ": {},
            },
            "(2) 동업기업의 범위 (조특법 §100의15) ": {

                "  다음 하나에 해당하는 조합이나 인적회사적 성격이 있는 단체가 적용신청한 한 경우 동업기업 과세특례를 적용받을 수 있습니다. ": {},
                "1.  민법 에 따른 조합 및  상법 에 따른 익명조합 2.  상법 에 따른 합명회사 및 합자회사 3.  상법 에 따른 합자조합 ": {},
                "* 2012.4.15. 이후 동업기업과세특례 적용신청하는 분부터 적용 ": {},
                "4. 주로 인적 용역을 제공하는 아래 해당 단체 - 변호사법에 의한 법무법인 및 법무조합 - 변리사법에 따른 특허법인 - 공인노무사법에 따른 노무법인 ": {},

                "- 법무사법에 따른 법무사합동법인 - 전문적인 인적용역을 제공하는 법인으로서 법무법인(유한), 특허법인(유한) (’14.1.1. 이후 개시 사업연도부터), 회계법인, 세무법인, 관세법인 ": {},
                "*  자본시장과 금융투자업에 관한 법률 에 따른 투자조합 투자익명조합 투자합자회사는 적용대상에서 제외하고 사모투자전문회사(PEF)는 적용대상에 포함. ": {},
                "  동업기업 과세특례를 적용받고자 하는 경우 최초 사업연도 개시일 이전(설립 과세연도 개시일 이후 1개월 이내)에 신청하여야 하며(조특법§100의17)": {},
                "- 동업기업 과세특례를 적용받은 법인은 5년간은 동업기업과세특례의 적용을 포기할수 없습니다(조특법§100의17). ": {},
            },
            "(3) 동업자군 (조특법 §100의14) ": {

                "  동업자군은 거주자, 비거주자, 내국법인, 외국법인으로 구분합니다.": {},
                "- 동업자군별로 각각 소득금액 결손금을 달리 구분하고 세율 및 과세방식(종합 분류  분리과세)도 달리 적용합니다. ": {},
                "* 계산·배분 순서：① 동업자군별 동업기업 소득금액 및 결손금 → ② 동업자군별 손익배분비율 적용 → ③ 동업자군별 배분대상 소득금액 및 결손금 계산 ": {},
            },
            "(4) 준청산소득에 대한 법인세 과세표준 신고 (조특법 §100의16) ": {

                "  동업기업과세특례를 적용받는 내국법인은  법인세법  제79조제1항의 “해산에 의한 청산소득”의 금액에 준하여 대통령령으로 정하는 바에 따라 계산한 과세표준에  법인세법  제55조제1항에 따른 세율을 적용하여 계산한 금액을 법인세로 납부하여야 합니다. ": {},
                "* 신고기한：동업기업과세특례를 적용받는 최초 사업연도의 직전 사업연도 종료일 이후 3개월이 되는 날까지 신고 ": {},
                "  준청산소득에 대한 법인세는 신고기한부터 3년 동안 균등액 이상 납부하도록 규정하고 있습니다. ": {},

            },
            "참고：예규 ": {

                " 동업기업 및 동업자의 납세의무 ": {},
                "동업기업 전환법인이 준청산소득에 대한 법인세 납부의무를 이행한 경우, 동업기업 전환 전에 발생한 유가증권평가이익 및 미수수익 익금불산입액, 이월결손금은 동업기업에 승계되지 않음(법인-798, 2011.10.26.)": {},
                "  민법 에 따른 조합( 자본시장과 금융투자업에 관한 법률  제9조 제18항 제5호의 투자 조합은 제외)은  조세특례제한법  제100조의 17에 따라 적용신청을 한 경우 같은법에 의한 동업기업으로 보아 같은법 제100조의16 제1항에 의해 소득세 또는 법인세를 부과하지 아니하고, 동업자들은 같은 법 제100조의18에 따라 배분받은 동업기업의 소득에 대하여 소득세 또는 법인세를 납부할 의무가 있는 것임(법인세과-848, 2009.7.22) ": {},

            },
        },
        "나. 소득의 계산 및 배분 등 ": {

            "(1) 소득의 계산 및 배분 (조특법 §100의18) ": {
                "  동업기업에 대하여는 소득세 및 법인세를 과세하지 아니하고 그 소득을 손익배분 비율에 따라 동업자에게 배분하여 소득세 또는 법인세로 과세합니다. ": {},
                "* 동업기업의 소득금액 또는 결손금은 실제 자산분배 여부와 관계없이 동업기업의 각 과세연도 종료일에 강제적으로 배분 ": {},
                "  원칙적으로 동업기업이 소득의 계산 및 배분명세 신고 시 신고한 약정 손익배분비율을 적용하고 신고한 약정 손익배분비율이 없으면 지분비율을 적용합니다. ": {},
            },
            "(2) 결손금 배분한도 및 이월배분 (조특법 §100의18) ": {

                "  동업기업의 결손금은 해당 과세연도 종료일 현재 해당 동업자의 지분가액을 한도로 배분하되 배분한도 초과결손금은 10년간 이월배분을 인정하고 있습니다.": {},
                "- 수동적 동업자는 소극적 투자자의 성격을 가지므로 결손금 배분을 인정하지 않고, 소득구분도 배당소득으로 일원화하고 있습니다. ": {},
                "참고：예규 ": {

                    " 출자금을 초과하여 분배하는 경우 동업자의 과세소득 산정방법 ": {},
                    "동업기업은 각 과세연도 종료일에 동업자군별 배분대상 소득금액을 해당 동업자군에 속하는 동업자들에게 배분하는 것이나, 귀 법인의 사실관계와 같이  자본시장과 금융투자업에 관한 법률 에 따른 사모투자전문회사로서 같은 법에 따라 초과분배 (이익금을 초과하여 분배)가 가능한 동업기업이 과세연도 중에 출자금보다 더 많은 금액(이하“해당분배금”)을 분배하여 동업자가 해당분배에 따른 지분가액의 감액조정을한 후 감액한 지분가액을 초과하는 금액에 대해 과세연도 중에 이미 소득으로 인식한 경우에는, 해당 분배금 중 출자금을 초과하는 금액 상당액은 과세연도 종료일 현재 동업기업의 배분대상 소득금액에 포함하지 아니하는 것임(법규과-1232, 2012.10.24.) ": {},

                },
            },
            "(3) 세액의 계산 및 배분 (조특법 §100의18) ": {

                "  소득의 계산 배분 단계에서는 반영이 불가능한 동업기업 관련 세액은 동업기업 단계에서 세액을 계산하고 손익배분비율에 따라 동업자에게 배분하여 동업자의 소득세 법인세에서 공제하거나 합산합니다.": {},
                "  동업기업 관련 세액은 동업기업이 형식적으로는 법인과 같은 실체적 외관을 갖는 점을 감안 동업기업을 하나의 내국법인으로 보아 계산합니다.": {},
                "  해당 배분소득에 대해 동업기업이 원천징수함으로써 납세의무가 종결하는 때에는 동업기업 단계에서 원천징수된 세액을 동업자 단계에서 공제하기 곤란한 점을 감안하여 해당 배분소득에 대해 동업기업이 원천징수할 세액에서 공제합니다. ": {},

            },
            "(4) 동업기업과 동업자간의 거래 (조특법 §100의19) ": {

                "  동업자가 동업자의 자격이 아닌 제3자의 자격으로 동업기업과 거래하는 경우 발생된 수익 또는 손비를 익금 또는 손금에 산입할 수 있습니다.": {},
                "- 다만, 조세부담을 부당하게 감소시킨 경우 부당행위계산부인 규정을 준용하여 해당소득금액을 계산할 수 있습니다.": {},
                "(동업자의 급여를 비용 계상할 수 없음) ": {},
                "참고：예규 ": {},
                " 동업자가 동업기업이 영위하는 사업관련 용역을 동업기업에게 제공하고, 동업기업은 이와 관련 급여 성격의 비용을 동업자에게 지급하는 경우 당해 거래는 동업자가 제3자의 자격으로 동업기업과 거래하는 경우에 해당하지 아니므로 동 비용은 동업기업의 손금에 산입하지 아니하고  법인세법  제52조의 규정을 준용하여 동업기업의 소득금액을 재계산하여야 하는 것임 (법인세과-555, 2013.10.14) ": {},

            },
        },
        "다. 지분가액 조정방법 ": {

            "(1) 지분가액 (조특법 §100의20) ": {},
            "  동업자가 보유하는 동업기업 지분의 세무상 장부가액으로서 동업기업 지분의 양도 또는 동업기업 자산의 분배시 과세소득 계산 등의 기초가 되는 가액 소득금액 결손금의 배분 등에 따라 지속적으로 가감 조정해야 합니다. ": {},
            "(2) 지분 양도시 과세 (조특법 §100의21) ": {},
            "  동업자가 동업기업 지분을 양도하는 경우 법인의 주식 출자지분을 양도한 것으로 보아 양도소득세 또는 법인세 과세합니다. ": {},
            "*  자본시장과 금융투자업에 관한 법률  §9    1의 경영참여형 사모집합투자기구는 주식등 변동상황 명세서 제출 의무 있음(법인세법 §119, 법인세법 시행령§161①2) ": {},
            "(3) 자산 분배시 과세 (조특법 §100의22) ": {},
            "  동업자가 동업기업으로부터 자산을 실제로 분배받는 경우 지분가액을 초과 하여 분배받은 자산가액(시가)에 한하여 과세함으로써 이중과세를 방지하고 있습니다.": {},
            "  해산 등의 사유로 동업자가 동업기업으로부터 자산을 분배받은 경우 지분가액에 미달하여 분배받은 자산가액(시가)에 대해 손실로 봅니다. ": {},

        },
        "라. 소득계산 및 배분명세 신고 (조특법 §100의23) ": {

            "  동업기업은 과세연도 종료일이 속하는 달 말일부터 3월이 되는 날이 속하는 달의 15일까지 소득계산 배분명세 등을 관할세무서장에게 신고하여야 하며 - 동업자에게도 해당 동업자와 관련된 신고내용을 통지하여야 합니다. ": {},
            "* 동업기업은 신고는 하되, 법인세 부과는 않음. ": {},
        },
}
_={
    #"법인세":법인세,
    #"조세특례제한법":조세특례제한법,
    #"증여세":증여세,
    "양도소득세":양도소득세,
    "법인세":법인세
}

tax=_;제목='동업기업과세특례'
import wx
class MyFrame(wx.Frame):
    def __init__(self):
        wx.Frame.__init__(self,parent=None,title=제목)
        self.SetSize(420,320*2)
        self.mainPanel=wx.Panel(self)
        self.expandButton=wx.Button(self.mainPanel,label='펼침')
        self.tree=wx.TreeCtrl(self.mainPanel)
        root=self.tree.AddRoot(제목)
        for i in tax:
            ii=self.tree.AppendItem(root,i)
            for j in tax[i]:
                jj=self.tree.AppendItem(ii,j)
                for k in tax[i][j]:
                    kk=self.tree.AppendItem(jj,k)
                    for m in tax[i][j][k]:
                        mm=self.tree.AppendItem(kk,m)
                        for n in tax[i][j][k][m]:
                            nn=self.tree.AppendItem(mm,n)
                            for p in tax[i][j][k][m][n]:
                                pp=self.tree.AppendItem(nn,p)
                                for q in tax[i][j][k][m][n][p]:
                                    qq=self.tree.AppendItem(pp,q)
                                    for r in tax[i][j][k][m][n][p][q]:
                                        rr=self.tree.AppendItem(qq,r)

        self.staticText =wx.TextCtrl(self.mainPanel,style=wx.TE_MULTILINE)


        self.vtBoxSizer=wx.BoxSizer(wx.VERTICAL)
        self.vtBoxSizer.Add(self.expandButton,0,wx.EXPAND|wx.ALL,5)
        self.vtBoxSizer.Add(self.tree        ,5,wx.EXPAND|wx.ALL,5)
        self.vtBoxSizer.Add(self.staticText  ,0,wx.EXPAND|wx.ALL,5)


        self.mainPanel.SetSizer(self.vtBoxSizer)

        self.Bind(wx.EVT_BUTTON          ,self.OnExpandButton,self.expandButton)
        self.Bind(wx.EVT_TREE_SEL_CHANGED,self.OnNodeSelected,self.tree)
    def OnExpandButton(self,e):
        self.tree.ExpandAll()
    def OnNodeSelected(self,e):
        selected=self.tree.GetSelection()
        self.staticText.SetLabel(self.tree.GetItemText(selected))

        self.mainPanel.Layout()
if __name__=='__main__':
    app=wx.App()
    frame=MyFrame()
    frame.Show()
    app.MainLoop()