# -*- coding: utf-8 -*-
#Created on 2019년 @author: 권달현
조={};서문={};조문={};부칙 = {};bubname='민법법인및특수법인등기규칙'
편=장=절=관=항=조={} 
서문['']={}
서문['민법법인 및 특수법인 등기규']={}
서문['[시행 2014. 11. 21] [대법원규칙 제2560호, 2014. 10. 2, 타법개정']={}
서문['법원행정처(사법등기심의관실) 02-3480-188']={}
제1조_=' 제1조 (목적) '
제1조={}
제1조['민법법인및특수법인등기규칙 제1조 (목적)']={}
조문['제1조 (목적)']=제1조
조['제1조 (목적)']=제1조
제1조1항_='이 규칙은 민법법인, 「민법」 및 「상법」 외의 법령에 의하여 설립된 법인(이하 "특수법인"이라 한다)과 회사가 아닌 외국법인(이하 "외국법인"이라 한다)의 등기에 관하여 「비송사건절차법」에서 위임된 사항과 그 시행에 필요한 사항을 규정함을 목적으로 한다.'
제1조1항={}
제1조[제1조1항_]=제1조1항
제2조_=' 제2조 (등기기록의 편성) '
제2조={}
제2조['민법법인및특수법인등기규칙 제2조 (등기기록의 편성)']={}
조문['제2조 (등기기록의 편성)']=제2조
조['제2조 (등기기록의 편성)']=제2조
제2조1항_='민법법인, 특수법인 및 외국법인의 등기기록은 별지 제1호 양식의 각 란에 기록한 등기정보로 편성한다.'
제2조1항={}
제2조[제2조1항_]=제2조1항
제3조_=' 제3조 (등기소에 비치할 장부) '
제3조={}
제3조['민법법인및특수법인등기규칙 제3조 (등기소에 비치할 장부)']={}
조문['제3조 (등기소에 비치할 장부)']=제3조
조['제3조 (등기소에 비치할 장부)']=제3조
제3조1항_='① 등기소에는 접수장 및 「상업등기규칙」 제22조제1항의 장부를 비치하여야 한다.'
제3조1항={}
제3조[제3조1항_]=제3조1항
제3조2항_='② 제1항의 장부는 「상업등기규칙」에서 규정하는 해당 장부와 같이 사용할 수 있다.'
제3조2항={}
제3조[제3조2항_]=제3조2항
제4조_=' 제4조 (민법법인의 종류에 관한 표시) '
제4조={}
제4조['민법법인및특수법인등기규칙 제4조 (민법법인의 종류에 관한 표시)']={}
조문['제4조 (민법법인의 종류에 관한 표시)']=제4조
조['제4조 (민법법인의 종류에 관한 표시)']=제4조
제4조1항_='민법법인의 명칭을 등기하는 때에는 사단법인 또는 재단법인임을 표시하여야 한다. 그러나, 법인의 명칭 중에 법인의 종류를 표시하는 문자가 사용되고 있는 때에는 그러하지 아니한다.'
제4조1항={}
제4조[제4조1항_]=제4조1항
제5조_=' 제5조 (특수법인에 관한 특칙) '
제5조={}
제5조['민법법인및특수법인등기규칙 제5조 (특수법인에 관한 특칙)']={}
조문['제5조 (특수법인에 관한 특칙)']=제5조
조['제5조 (특수법인에 관한 특칙)']=제5조
제5조1항_='① 특수법인에 관하여는 당해 특별법령이 정하는 사항을 등기하여야 한다.'
제5조1항={}
제5조[제5조1항_]=제5조1항
제5조2항_='② 당해 특별법령에 따라 주사무소 또는 분사무소 업무에 관하여 재판상 또는 재판외의 모든 행위를 할 수 있는 대리인을 선임한 때에는 2주일 내에 그 대리인을 둔 사무소의 소재지에서 대리인을 둔 뜻을 등기하여야 한다.'
제5조2항={}
제5조[제5조2항_]=제5조2항
제5조3항_='③ 자본금 및 그에 준하는 것(이하 이 항에서 "자본금등"이라 한다)을 등기하여야 하는 특수법인의 설립등기 또는 자본금등의 증액으로 인한 변경등기의 신청서에는 자본금등에 관하여 납입 또는 급부가 있었음을 증명하는 서면을 첨부하여야 한다.'
제5조3항={}
제5조[제5조3항_]=제5조3항
제6조_=' 제6조 (「민법」, 「상업등기법」 및 「상업등기규칙」의 준용) '
제6조={}
제6조['민법법인및특수법인등기규칙 제6조 (「민법」, 「상업등기법」 및 「상업등기규칙」의 준용)']={}
조문['제6조 (「민법」, 「상업등기법」 및 「상업등기규칙」의 준용)']=제6조
조['제6조 (「민법」, 「상업등기법」 및 「상업등기규칙」의 준용)']=제6조
제6조1항_='① 민법법인, 특수법인 및 외국법인의 등기에 관하여는 그 성질에 반하지 아니하는 한 「상업등기법」 제23조제1항과「상업등기규칙」 제2조부터 제4조까지, 제6조, 제8조부터 제12조까지, 제14조부터 제21조까지, 제22조제2항과 제3항, 제23조부터 제71조까지, 제167조부터 제174조까지, 제176조부터 제178조까지의 규정을 준용한다. 이 경우 「상업등기규칙」 제8조제2항의 "등기부의 종류"란 민법법인등기부, 특수법인등기부, 외국법인등기부를 말한다.'
제6조1항={}
제6조[제6조1항_]=제6조1항
제6조2항_='② 민법법인 및 특수법인의 등기에 관하여는 그 성질에 반하지 아니하는 한 「상업등기규칙」 제5조, 제99조, 제101조, 제102조, 제115조제1항, 제116조, 제131조, 제132조, 제145조, 제153조, 제154조제2항의 규정을 준용한다.'
제6조2항={}
제6조[제6조2항_]=제6조2항
제6조3항_='③ 특수법인의 등기에 관하여는 그 성질에 반하지 아니하는 한 「민법」 제50조부터 제52조까지, 제85조, 제94조의 규정과 「상업등기규칙」 제88조, 제103조제3항, 제104조, 제105조제1항, 제108조, 제109조, 제113조, 제115조제2항 및 제154조제3항·제4항·제5항·제6항의 규정을 준용한다.'
제6조3항={}
제6조[제6조3항_]=제6조3항
제6조4항_='④ 외국법인의 등기에 관하여는 그 성질에 반하지 아니하는 한 「상업등기규칙」 제88조 및 제163조부터 제166조까지의 규정을 준용한다.'
제6조4항={}
제6조[제6조4항_]=제6조4항
제6조['[전문개정 2014. 10. 2.]']={}
제7조_=' 제7조 (등기공고의 유예기간) '
제7조={}
제7조['민법법인및특수법인등기규칙 제7조 (등기공고의 유예기간)']={}
조문['제7조 (등기공고의 유예기간)']=제7조
조['제7조 (등기공고의 유예기간)']=제7조
제7조1항_='「비송사건절차법(1996. 12. 30. 법률 제5206호)」 부칙 제2조에 따라 민법법인, 특수법인 및 외국법인의 등기의 공고는 2022년까지 이를 하지 아니한다.'
제7조1항={}
제7조[제7조1항_]=제7조1항
부칙['부칙  <제2560호, 2014. 10. 2.>  (상업등기규칙']={}
부칙['제1조(시행일) 이 규칙은 2014년 11월 21일부터 시행한다']={}
부칙['제2조 생']={}
부칙['제3조(다른 규칙의 개정) ① 민법법인 및 특수법인 등기규칙 일부를 다음과 같이 개정한다']={}
부칙['제6조를 다음과 같이 한다']={}
부칙['제6조(「민법」, 「상업등기법」 및 「상업등기규칙」의 준용) ① 민법법인, 특수법인 및 외국법인의 등기에 관하여는 그 성질에 반하지 아니하는 한 「상업등기법」 제23조제1항과「상업등기규칙」 제2조부터 제4조까지, 제6조, 제8조부터 제12조까지, 제14조부터 제21조까지, 제22조제2항과 제3항, 제23조부터 제71조까지, 제167조부터 제174조까지, 제176조부터 제178조까지의 규정을 준용한다. 이 경우 「상업등기규칙」 제8조제2항의 "등기부의 종류"란 민법법인등기부, 특수법인등기부, 외국법인등기부를 말한다']={}
부칙['② 민법법인 및 특수법인의 등기에 관하여는 그 성질에 반하지 아니하는 한 「상업등기규칙」 제5조, 제99조, 제101조, 제102조, 제115조제1항, 제116조, 제131조, 제132조, 제145조, 제153조, 제154조제2항의 규정을 준용한다']={}
부칙['③ 특수법인의 등기에 관하여는 그 성질에 반하지 아니하는 한 「민법」 제50조부터 제52조까지, 제85조, 제94조의 규정과 「상업등기규칙」 제88조, 제103조제3항, 제104조, 제105조제1항, 제108조, 제109조, 제113조, 제115조제2항 및 제154조제3항·제4항·제5항·제6항의 규정을 준용한다']={}
부칙['④ 외국법인의 등기에 관하여는 그 성질에 반하지 아니하는 한 「상업등기규칙」 제88조 및 제163조부터 제166조까지의 규정을 준용한다']={}
부칙['②부터 ⑧까지 생']={}
부칙['제4조 생']={}
bub={'서문':서문,'조문':조문,'조별':조,'부칙':부칙}
    
import wx
class MyFrame(wx.Frame):
    def __init__(self):
        wx.Frame.__init__(self, parent=None, title=bubname)
        self.SetSize(620, 520)
        self.mainPanel = wx.Panel(self)
        self.expandButton = wx.Button(self.mainPanel, label=bubname)
        self.tree = wx.TreeCtrl(self.mainPanel)
        root = self.tree.AddRoot(bubname)
        for i in bub:
            ii = self.tree.AppendItem(root, i)
            for j in bub[i]:
                jj = self.tree.AppendItem(ii, j)
                for k in bub[i][j]:
                    kk = self.tree.AppendItem(jj, k)
                    for m in bub[i][j][k]:
                        mm = self.tree.AppendItem(kk, m)
                        for n in bub[i][j][k][m]:
                            nn = self.tree.AppendItem(mm, n)
                            for p in bub[i][j][k][m][n]:
                                pp = self.tree.AppendItem(nn, p)
                                for q in bub[i][j][k][m][n][p]:
                                    qq=self.tree.AppendItem(pp,q)
                                    for r in bub[i][j][k][m][n][p][q]:
                                        rr=self.tree.AppendItem(qq,r)
                                        for s in bub[i][j][k][m][n][p][q][r]:
                                            ss = self.tree.AppendItem(rr, s)
                                            for t in bub[i][j][k][m][n][p][q][r][s]:
                                                tt = self.tree.AppendItem(ss, t)
                                                for u in bub[i][j][k][m][n][p][q][r][s][t]:
                                                    uu = self.tree.AppendItem(tt, u)
                                                    for v in bub[i][j][k][m][n][p][q][r][s][t][u]:
                                                        vv = self.tree.AppendItem(uu, v)
        self.staticText = wx.TextCtrl(self.mainPanel, style=wx.TE_MULTILINE)
        self.vtBoxSizer = wx.BoxSizer(wx.VERTICAL)
        self.vtBoxSizer.Add(self.expandButton, 0, wx.EXPAND | wx.ALL, 5)
        self.vtBoxSizer.Add(self.tree, 5, wx.EXPAND | wx.ALL, 5)
        self.vtBoxSizer.Add(self.staticText, 0, wx.EXPAND | wx.ALL, 5)
        self.mainPanel.SetSizer(self.vtBoxSizer)
        self.Bind(wx.EVT_BUTTON, self.OnExpandButton, self.expandButton)
        self.Bind(wx.EVT_TREE_SEL_CHANGED, self.OnNodeSelected, self.tree)
        self.Bind(wx.EVT_CLOSE, self.OnClose)

    def OnExpandButton(self, e):
        self.tree.ExpandAll()

    def __del__(self):
        print('소멸합니다.')

    def OnClose(self, event):
        frame.Destroy()

    def OnNodeSelected(self, e):
        selected = self.tree.GetSelection()
        self.staticText.SetLabel(self.tree.GetItemText(selected))
        self.mainPanel.Layout()
if __name__ == '__main__':
    app = wx.App(redirect=True)
    frame = MyFrame()
    wnd = wx.Frame(None, wx.ID_ANY, "")
    wnd.CenterOnScreen()
    app.SetTopWindow(wnd)
    frame.Show()
    app.MainLoop()
    