# -*- coding: utf-8 -*-
#Created on 2018-11-8 @author: 권달현
import 개정세법
import 부가가치세법
_={
    '부가가치세법':부가가치세법.bub,
    '총설':{
        '부가가치세 제도': {
            '부가가치세의 개념': {},
            '부가가치세의 유형': {},
            '부가가치세의 과세방법': {},
            '부가가치세의 경제적 효과': {},
        },
        '한국의 부가가치세 제도': {
            '시행목적': {},
            '문제점': {},
            '특성': {},
        },
    },
    '총칙':{
        '납세의무자':{
            '납세의무자의 개념': {},
            '납세의무자의 요건': {},
            '관련사례': {},
        },
        '과세기간': {
            '의의': {},
            '과세기간의 적용': {},
            '예정신고기간 및 조기환급기간': {},
        },
        '납세지': {
            '의의': {},
            '사업장': {},
            '직매장과 하치장': {},
            '임시사업장': {},
            '과세관할': {},
        },
        '사업자등록': {
            '의의': {},
            '등록신청 및 발급': {
                '일반적인 사업자의 등록신청': {},
                '사업자등록증의 발급': {},
            },
            '사업자 등록 특례': {
                '사업자단위 과세사업자': {},
                '다단계판매원의 사업자등록': {},
                '개별소비세 또는 교통에너지환경세 사업자': {},
                '과세,면세 겸영사업자': {},
                '공동사업자의 사ㅣ업자등록 및 업무처리': {},
            },
            '등록정정 및 휴폐업신고': {
                '사업자등록 정정': {},
                '휴업 및 폐업의 신고': {},
            },
            '등록말소와 갱신': {
                '등록말소': {},
                '등록갱신': {},
            },
            '사업의 구분': {},
        },
    },
    '과세거래':{
        '과세대상': {
            '과세대상':{},
            '과세대상 재화 및 용역의 범위':{
                '과세대상 재화의 범위':{},
                '과세대상 용역의 범위': {},
                '관련 사례': {},
            },
        },
        '재화의 공급': {
            '개념': {
                '계약상,법률상의 모든 원인': {},
                '재화의 인도 또는 양도': {},
            },
            '재화공급의 범위': {
                '매매계약': {},
                '가공계약': {},
                '교환계약': {},
                '보세구역내 창고 임치물의 국내반입': {},
                '기타 원인': {},
            },
            '재화의 의제공급': {
                '개요': {},
                '자가공급': {},
                '개인적 공급': {},
                '사업상 증여': {},
                '폐업시 남아있는 재화': {},
                '의제공급의 업무처리': {},
            },
            '위탁매매(대리인)에 의한 매매의 공급 특례': {},
            '신탁자산 매매의 공급특례': {},
            '재화의 공급으로 보지 않는 경우': {
                '담보제공': {},
                '사업의 양도': {},
                '물납': {},
                '신탁재산의 소유권 이전': {},
                '창고증권의 양도': {},
                '국외위탁 가공용 원자재 무환반출': {},
                '한국석유공사 비축용 석유를 외국법인에 소비대차로 공급': {},
                '공매 및 강제집행에 의한 재화공급': {},
                '수용된 재화의 대가를 받는 경우': {},
                '정비사업조합이 공급하는 토지 및 건축물': {},
            },
        },
        '용역의 공급': {
            '용역공급의 범위': {},
            '용역공급의 특례': {
                '용역의 자가공급': {},
                '용역의 공급으로 보지 않는 거래': {},
            },
        },
        '재화의 수입': {
            '의의': {},
            '보세구역에서의 부가가치세법의 적용': {},
        },
        '부수재화 또는 용역': {
            '의의': {},
            '부수재화 또는 용역의 범위': {},
        },
        '공급시기': {
            '의의': {},
            '재화의 공급시기': {
                '일반적 기준': {},
                '거래형태별 공급시기': {},
            },
            '용역의 공급시기': {
                '일반적 기준': {},
                '거래형태별 공급시기': {},
            },
            '공급시기의 특례': {},
            '재화의 수입시기': {},
        },
        '공급장소': {
            '의의': {},
            '재화의 공급장소': {},
            '용역의 공급장소': {},
            '사례': {},
        },
    },
    '영세율과 면세': {
        '영세율':{
            '개요': {
                '영세율 제도의 의의': {},
                '영세율 제도의 목적': {},
                '영세율과 면세의 차이점': {},
                '수출의 일반':{},
            },
            '영세율의 적용대상': {},
            '재화의 수출': {
                '수출의 범위': {},
                '직수출': {},
                '대행수출(代行輸出)': {},
                '중계무역 방식의 수출': {},
                '외국인도수출': {},
                '위탁판매수출 ': {},
                '위탁가공무역 방식의 수출': {},
                '국외 수탁가공사업자에 원자재 반출후 가공재화 양도': {},
                '내국신용장(구매확인서)에 의한 영세율 적용': {},
                '한국국제협력단 등에 공급하는 재화': {},
                '수탁가공무역 수출': {},
                '기타 거래형태별 영세율 적용': {},
            },
            '영세율과 면세의 차이점': {},
            '용역의 국외공급': {
                '적용범위': {},
                '세금계산서 발급': {},
                '영세율 첨부서류': {},
                '관련사례': {},
            },
            '외국항행용역': {
                '적용범위': {},
                '공급시기': {},
                '세금계산서 발급': {},
                '영세율 첨부서류': {},
                '사례별 외국항행용역': {},
            },
            '기타 외화획득 사업': {
                '외교공관, 국제연합 등에 공급하는 재화,용역': {},
                '외교관 등에게 공급하는 재화,용역 ': {},
                '국내에서 비거주자?외국법인에게 공급하는 재화,용역': {},
                '수출재화임가공용역': {},
                '외국항행선박 등에 공급하는 재화,용역': {},
                '국제연합군?미합중국 군대에 공급하는 재화,용역': {},
                '외국인 관광객에게 공급하는 관광알선용역': {},
                '외국인 전용판매장 등의 사업자가 공급하는 재화 또는 용역 ': {},
            },
            '조세특례제한법에 의한 영세율적용': {
                '방위산업물자': {},
                '국군부대 등에 공급하는 석유류': {},
                '도시철도 건설용역': {},
                '국가 등에 귀속된 사회간접자본시설': {},
                '장애인용 보장구 ': {},
                '농민,임업종사자에게 공급하는 농축임업용기자재 ': {},
                '어민에게 공급하는 어업용 기자재': {},
                '농어업용 기자재에 대한 부가가치세 환급': {},
                '조약에 의한 영세율 적용': {},
            },
            '외국인관광객 등이 구입하는 재화에 대한 영세율적용 및 환급	': {
                '제도의 취지': {},
                '적용범위': {},
                '면세판매장 등의 지정,취소': {},
                '면세물품의 판매?반출확인 및 송금절차': {},
                '부가가치세 신고': {},
            },
            '': {},
            '': {},
            '': {},
        },
        '면세':{
            '개요': {
                '의의': {},
                '목적': {},
                '환수효과(還收效果)와 누적효과(累積效果)': {},
            },
            '부가가치세법상 면세대상': {
                '기초생활필수품 및 용역': {
                    '미가공식료품 및 농축수임산물의 면세': {},
                    '수돗물': {},
                    '연탄과 무연탄': {},
                    '여객운송용역': {},
                },
                '국민후생용역': {
                    '여성용 생리처리 위생용품': {},
                    '의료보건용역과 혈액': {},
                    '교육용역': {},
                    '주택과 이에 부수되는 토지의 임대용역': {},
                    '공동주택 어린이집의 임대용역': {},
                    '우표(수집용 우표를 제외)?인지?증지?복권?공중전화': {},
                    '제조담배': {},
                },
                '문화관련 재화,용역': {
                    '도서(도서대여용역 포함),신문,잡지,관보,통신. 다만, 광고는 제외': {},
                    '예술창작품,예술행사,문화행사와 아마추어운동경기': {},
                    '도서관,과학관,박물관,미술관,동물원,식물원에의 입장': {},
                    '관련사례': {},
                    '': {},
                },
                '부가가치 생산요소인 재화,용역 ': {
                    '토지의 공급': {},
                    '인적용역': {},
                    '금융,보험용역': {},
                    '': {},
                    '': {},
                },
                '기타 면세': {
                    '종교,자선,학술,구호 그 밖의 공익을 목적으로 하는 단체가 공급하는 재화 또는 용역': {},
                    '국가,지방자치단체,지방자치단체조합이 공급하는 재화 또는 용역': {},
                    ' 국가,지방자치단체,공익단체에 무상으로 공급하는 재화 또는 용역': {},
                    '': {},
                    '': {},
                },
                '수입 재화': {
                    ' 미가공식료품': {},
                    '도서,신문,잡지': {},
                    '학술연구단체 등이 과학용 등으로 수입하는 재화': {},
                    '종교단체 등에 기증되는 재화': {},
                    '국가,지방자치단체 등에 기증되는 재화': {},
                    '거주자가 수취하는 소액물품': {},
                    '이주,이민 또는 상속으로 인한 수입재화': {},
                    '관세의 면세 또는 간이세율 적용 재화': {},
                    '수입하는 상품 견본품': {},
                    '우리나라 개최 박람회 등 출품재화': {},
                    '조약 등에 의하여 관세가 면제되는 재화': {},
                    '재수입재화': {},
                    '일시 수입재화': {},
                    '제조담배': {},
                    '기타 관세가 무세(無稅)이거나 감면되는 재화': {},
                    '관련사례': {},
                },
            },
            '조세특례제한법에 의한 면세': {
                '도서지방의 자가발전용 석유류': {},
                '공장 등 구내식당에서 공급하는 음식용역': {},
                '농어업경영 및 농?어작업의 대행용역': {},
                '국민주택과 해당 주택의 (리모델링)건설 및 설계용역': {},
                '정부업무대행단체가 공급하는 재화,용역': {},
                '주택의 관리, 경비용역, 청소용역 및 난방용역 ': {},
                '국가에 귀속되는 철도시설': {},
                '민자로 건설하는 고등교육기관 학교시설 운영사업': {},
                '기숙사': {},
                '시내버스 운송사업용버스': {},
                '전기버스': {},
                '개인택시용으로 간이과세자에게 공급하는 자동차': {},
                '희귀병치료제': {},
                '영유아용 기저귀와 분유': {},
                '목재펠릿': {},
                '해저광물자원개발과 관련하여 공급하는 재화 또는 용역': {},
                '온실가스 감축량 및 상왜배출권': {},
                '농어업용 및 연안여객선박용 석유류에 대한 감면': {
                    '감면범위': {},
                    '농어업용 면세석유류 적용대상 농어민의 범위': {},
                    '농어업용 면세유류의 범위': {},
                    '농어민에 의한 면세유 부정유통 방지': {},
                    '농수협에 의한 면세유 부정유통 방지': {},
                    ' 석유판매업자에 의한 면세유 부정유통 방지': {},
                    '면세유류구입권 등 발급수수료': {},
                    '농기계 등 보유신고서 제출 및 관리대장 작성 등': {},
                    '면세유류 연간 한도량 신청 및 관리': {},
                    '부가가치세 신고시 첨부서류': {},
                    '기타': {},
                    '관련사례': {},
                },
            },
            '부수면세': {
                '의의':{},
                '면세되는 비영리 출판물의 용역': {},
                ' 관련사례': {},
            },
            '면세포기': {
                '의의': {},
                '면세포기대상': {},
                '면세포기절차': {},
                '면세포기의 효력': {},
            },
        },
    },
    '과세표준과 세액': {
#http://www.kyobobook.co.kr/product/detailViewKor.laf?ejkGb=KOR&mallGb=KOR&barcode=9788964771037&orderClick=LEA&Kc=' 한장석 부가가치세
    },
    '거래징수와 세금계산서': {},
    '신고와 납부': {},
    '경정,징수 및 가산세': {},
    '간이과세': {},
    '보칙 및 특례규정': {},
    '체크리스트':{},
}
#___________________________________________________
제목='부가가치세'
tax=_
import wx
class MyFrame(wx.Frame):
    def __init__(self):
        wx.Frame.__init__(self,parent=None,title=제목)
        self.SetSize(420,320*2)
        self.mainPanel=wx.Panel(self)
        self.expandButton=wx.Button(self.mainPanel,label='펼침')
        self.tree=wx.TreeCtrl(self.mainPanel)
        root=self.tree.AddRoot(제목)
        for i in tax:
            ii=self.tree.AppendItem(root,i)
            for j in tax[i]:
                jj=self.tree.AppendItem(ii,j)
                for k in tax[i][j]:
                    kk=self.tree.AppendItem(jj,k)
                    for m in tax[i][j][k]:
                        mm=self.tree.AppendItem(kk,m)
                        for n in tax[i][j][k][m]:
                            nn=self.tree.AppendItem(mm,n)
                            for p in tax[i][j][k][m][n]:
                                pp=self.tree.AppendItem(nn,p)
                                for q in tax[i][j][k][m][n][p]:
                                    qq=self.tree.AppendItem(pp,q)
                                    for r in tax[i][j][k][m][n][p][q]:
                                        rr=self.tree.AppendItem(qq,r)

        self.staticText =wx.TextCtrl(self.mainPanel,style=wx.TE_MULTILINE)


        self.vtBoxSizer=wx.BoxSizer(wx.VERTICAL)
        self.vtBoxSizer.Add(self.expandButton,0,wx.EXPAND|wx.ALL,5)
        self.vtBoxSizer.Add(self.tree        ,5,wx.EXPAND|wx.ALL,5)
        self.vtBoxSizer.Add(self.staticText  ,0,wx.EXPAND|wx.ALL,5)


        self.mainPanel.SetSizer(self.vtBoxSizer)

        self.Bind(wx.EVT_BUTTON          ,self.OnExpandButton,self.expandButton)
        self.Bind(wx.EVT_TREE_SEL_CHANGED,self.OnNodeSelected,self.tree)
    def OnExpandButton(self,e):
        self.tree.ExpandAll()
    def OnNodeSelected(self,e):
        selected=self.tree.GetSelection()
        self.staticText.SetLabel(self.tree.GetItemText(selected))

        self.mainPanel.Layout()
if __name__=='__main__':
    app=wx.App()
    frame=MyFrame()
    frame.Show()
    app.MainLoop()
#___________________________________________________