# -*- coding: utf-8 -*-
#Created on 2018-12-24 @author: 권달현
국제조세조정={
    "국외특수관계인과의 거래에 대한 이전가격세제":{
        "개요":{},
        "정상가격산출방법신고서의 제출":{},
        "정상가격 등에 의한 과세조정":{},
        "세무조정 및 소득처분":{},
        "국제거래에 대한 자료제출의무":{},
        },
    "외국자회사 중 특정외국법인의 유보소득에 대한 합산과세(=조세피난방지세제)":{
        "개요":{},
        "합산과세대상":{},
        "합산과세내용":{},
        "해외지주회사의 유보소득 배당간주에 관한 특례":{},
        "국외출자명세서의 제출":{},
    },
}
법인세={
    "부당행위계산 부인 ": {

                    "내국법인의 행위 또는 소득금액계산이 특수관계인과의 거래로 인하여 그 법인의 소득에 대한 조세부담을 부당히 감소시킨 것으로 인정되는 경우 그 법인의 행위 또는 소득금액의 계산에 관계없이 그 법인의 각 사업연도의 소득금액을 계산합니다 (법법§52). ": {},
                    "  부당행위계산의 유형 등(법령§88) - 자산을 시가보다 높은 가액으로 매입 또는 현물출자 받았거나, 그 자산을 과대상각한 경우 ": {},

                    "- 무수익자산을 매입 또는 현물출자 받았거나, 그 자산에 대한 비용을 부담한 경우": {},
                    "- 자산을 무상 또는 시가보다 낮은 가액으로 양도 또는 현물출자한 경우 다만, 주식매수선택권 행사에 따른 주식의 저가양도 저가발행 제외": {},
                    "- 특수관계인인 법인 간 합병(분할합병을 포함한다)·분할에 있어서 불공정한 비율로 합병·분할하여 합병·분할에 따른 양도손익을 감소시킨 경우. 다만,  자본시장과 금융투자업에 관한 법률  제165조의4에 따라 합병(분할합병을 포함한다)· 분할하는 경우는 제외": {},
                    "- 불량자산을 차환하거나 불량채권을 양수한 경우": {},
                    "- 출연금을 대신 부담한 경우": {},
                    "- 금전 그 밖의 자산 또는 용역을 무상 또는 시가보다 낮은 이율 요율이나 임대료로 대부하거나 제공한 경우. 다만, 주식매수선택권 행사에 따라 금전을 제공하거나 주주 등이나 출연자가 아닌 임원(소액주주인 임원을 포함) 및 사용인에게 사택을 제공하는 경우를 제외함.": {},
                    "- 금전 기타 자산 또는 용역을 시가보다 높은 이율 요율이나 임차료로 차용하거나 제공을 받은 경우": {},
                    "- 특수관계자간 파생상품 거래를 하면서 권리를 행사하지 아니하거나 권리행사 기간을 조정하는 방법 등으로 이익분여를 하는 경우 ": {},
                    "☞ 2007.2.28. 이후 최초로 거래하는 분부터 적용 ": {},
                    "- 다음에 해당하는 자본거래로 인하여 주주 등인 법인이 특수관계자인 다른 주주 등에게 이익을 분여한 경우": {},
                    " 특수관계자인 법인간의 합병(분할합병 포함)에 있어서 주식 등을 시가보다 높거나 낮게 평가하여 불공정한 비율로 합병한 경우 ": {},
                    "※  자본시장과 금융투자업에 관한 법률 에 따라 합병(분할합병 포함)하는 경우 제외 ": {},
                    " 법인의 자본(출자액 포함)을 증가시키는 거래에 있어서 신주(전환사채  신주인수권부사채 또는 교환사채 등을 포함)를 배정 인수받을 수 있는 권리의 전부 또는 일부를 포기(그 포기한 신주가  자본시장과 금융투자업에 관한 법률  §9⑦의 규정에 의한 모집방법으로 배정되는 경우 제외)하거나 신주를 시가보다 높은 가액으로 인수하는 경우 ": {},

                    " 법인의 감자에 있어서 주주 등의 소유주식 등의 비율에 의하지 아니하고 일부 주주 등의 주식 등을 소각하는 경우 - 증자 감자, 합병(분할합병 포함) 분할, 상증법§40 ⓛ에 따른 전환사채 등에 의한 주식의 전환 인수 교환 등 법인의 자본(출자액을 포함)을 증가시키거나 감소시키는 거래를 통하여 법인의 이익을 분여하였다고 인정되는 경우. 다만, 법령§20①3호각 목 외의 부분에 해당하는 주식매수선택권 등 중 주식매수선택권의 행사에 따라 주식을 발행하는 경우 제외 - 기타 위에 준하는 행위 또는 계산 및 그 외에 법인의 이익을 분여하였다고 인정되는 것이 있을 때": {},
                    "  시가보다 낮거나 높은 대가로 거래하는 경우 시가와 대가의 차액이 3억원 이상이거나 시가의 5%이상인 경우에 한하여 부당행위계산 부인 규정 적용(다만, 주권상장법인및 코스닥상장법인이 발행한 주식을 거래소에서 거래한 경우 제외)(법령§88③, ④)": {},
                    "  자본거래로 인한 부당행위계산 부인 시 분여이익이 시가의 30%에 미달할 때에는 분여한 이익이 3억원(1억원)이상인 경우에도 부당행위계산을 부인하지 않았으나 - 2007.1.1.이후 최초로 개시하는 사업연도 분부터는 30%기준에 미달할 때에도 분여한 이익이 3억원(1억원)이상인 경우에는 부당행위계산 부인규정을 적용 (법령§89⑥)": {},
                    "  주권상장법인이 발행한 주식을 한국거래소에서 거래한 경우 해당 주식의 시가는 그거래일의 한국거래소 최종시세가액으로 함(법령§89ⓛ).": {},
                    "  특수관계인간 자금대여시의 시가인 이자율을 적용함에 있어 가중평균 차입이자율 적용이 곤란한 사유로 인정되는 경우에는 해당 대여금 또는 차입금에 한정하여 당좌대출이자율을 시가로 적용할 수 있도록 개정됨(구체적인 사유는 시행규칙에 규정)(법령§89③). ": {},
                    "☞ 2012.2.2. 이후 최초로 신고하는 분부터 적용함. ": {},

                    "참고：예규 ": {

                        " 내국법인이  법인세법 시행령  제88조제1항제6호나목 및 같은 법 시행규칙 제42조의3 에 규정한 사택을 당해 법인이 직접 임차하여 주주 등이나 출연자가 아닌 임원(소액주주 등인 임원 포함) 및 사용인에게 무상으로 제공하는 경우에는 같은 법 제52조에 따른 부당행위계산의 부인 규정이 적용되지 아니하는 것이나, 사용인 등에게 주택을 임차하는데 소요되는 자금을 무상으로 지원하는 경우에는 부당행위계산의 부인 규정이 적용되는 것임(법인세과-1411, 2009.12.21.). ": {},
                        " 종업원에게 할인판매가 조세를 부당히 감소시키는 거래 해당여부 ": {},
                        "사용인에게 자사제품 등을 취득가액 이상이고, 소비자판매가액에 비하여 현저하게 낮은 가액이 아니며, 수량이 통상 자기의 가사를 위하여 소비하는 것이라고 인정되는 정도의 것은 조세를 부당하게 감소시킨 것으로 보지 아니함(서면2팀-1534, 2007.8.21.) ": {},
                        " 자기주식 매입소각에 관련된 부당행위 부인 적용여부 ": {},
                        "자본감소의 목적으로 당해 법인이 특수관계에 있는 특정주주로부터 자기주식을 저가로 매입하여 소각한 경우 특정주주의 저가양도는 부당행위에 해당하지 아니하나, 이로 인하여 특정주주와 특수관계에 있는 다른 주주에게 이익이 분여된 것으로 인정되는 때에는 부당행위에 해당하는 것임(재경부 법인-617, 2006.9.5.) ": {},
                        " 금융기관의 경영개선약정에 의하여 보유주식을 무상 또는 저가 출자시 ": {},
                        "법인이 특수관계자인 부실금융기관의 경영개선약정을 이행하기 위하여 계열그룹 구조조정본부의 지침에 따른 법인간 합의에 의하여 보유주식을 현물출자한 것이 법인세법 시행령 제88조 제1항 제3호에 해당하는 경우에는 법인세법 제52조 규정에 의한 부당행위계산 부인규정을 적용하는 것임(재경부 법인-199, 2005.3.28.) ": {},
                        " 특수관계자에게 임대한 자산의 시가판정은 임대차계약일이 기준임 ": {},
                        "법인세법 시행령 제88조 제1항 각호의 1의 규정에 의한 부당행위계산의 유형에 해당하는지 여부는 임대차 계약일을 기준으로 판단하는 것으로 임대차계약 체결시점에서 동법 시행령 제89조 제4항 제1호의 규정(2000.12.29. 대통령령 제17033호로 개정되기 전의 것)에 의하여 산출한 시가를 임대차계약기간에 속하는 사업연도에 계속하여 적용하는 것임(재경부 법인-72, 2005.1.28.) ": {},
                        " 감정평가법인이 감정한 상장주식 가액을 시가로 적용할 수 없음. ": {},
                        "법인세법시행령 제89조(시가의 범위 등)를 적용함에 있어 증권거래소에 상장된 주식에 대하여는 같은 영 같은 조 제2항 제1호의 가액(지가공시및토지등의 평가에관한법률에 의한 감정평가법인이 감정한 가액)을 시가로 적용할 수 없음(재경부 법인46012-63, 2003.4.15.) ": {},

                    },
                },
    "개요":{},
    "적용 요건":{},
    "특수관계인의 범위":{},
    "부당행위계산의 적용범위":{},
    "시기적 판정기준":{},
    "조세의 부담을 부당히 감소시킨 부당행위 및 계산의 유형":{
        "법인세법의 예시적 규정":{},
        "법인세법 기본통칙의 예시적 규정":{},
    },
    "시가의 계산":{
        "시가의 의의":{},
        "시가의 산정":{},
    },
    "부당행위계산부인의 세무조정":{},
    "자본거래 관련 부당행위계산의 세무조정":{
        "익금에 산입되는 분여이익의 계산":{},
        "분여이익의 세무조정":{},
    },
    "특수관계인간 거래명세서의 제출":{},

}


#___________________________________________________
제목='부당행위계산 부인'
_={
    #"지방소득세_법인세분 가산세": 지방소득세_법인세분,
    #"기업회계":기업회계,
    "법인세":법인세,
    "국제조세조정":국제조세조정,
    #"조세특례제한법":조세특례제한법,
    #"증여세":증여세,
    #"상속세":상속세,
    #"양도소득세":양도소득세,
    #"농어촌특별세":{},
}
tax=_
import wx
class MyFrame(wx.Frame):
    def __init__(self):
        wx.Frame.__init__(self,parent=None,title=제목)
        self.SetSize(420,320*2)
        self.mainPanel=wx.Panel(self)
        self.expandButton=wx.Button(self.mainPanel,label='펼침')
        self.tree=wx.TreeCtrl(self.mainPanel)
        root=self.tree.AddRoot(제목)
        for i in tax:
            ii=self.tree.AppendItem(root,i)
            for j in tax[i]:
                jj=self.tree.AppendItem(ii,j)
                for k in tax[i][j]:
                    kk=self.tree.AppendItem(jj,k)
                    for m in tax[i][j][k]:
                        mm=self.tree.AppendItem(kk,m)
                        for n in tax[i][j][k][m]:
                            nn=self.tree.AppendItem(mm,n)
                            for p in tax[i][j][k][m][n]:
                                pp=self.tree.AppendItem(nn,p)
                                for q in tax[i][j][k][m][n][p]:
                                    qq=self.tree.AppendItem(pp,q)
                                    for r in tax[i][j][k][m][n][p][q]:
                                        rr=self.tree.AppendItem(qq,r)
        self.staticText =wx.TextCtrl(self.mainPanel,style=wx.TE_MULTILINE)

        self.vtBoxSizer=wx.BoxSizer(wx.VERTICAL)
        self.vtBoxSizer.Add(self.expandButton,0,wx.EXPAND|wx.ALL,5)
        self.vtBoxSizer.Add(self.tree        ,5,wx.EXPAND|wx.ALL,5)
        self.vtBoxSizer.Add(self.staticText  ,0,wx.EXPAND|wx.ALL,5)
        self.mainPanel.SetSizer(self.vtBoxSizer)
        self.Bind(wx.EVT_BUTTON          ,self.OnExpandButton,self.expandButton)
        self.Bind(wx.EVT_TREE_SEL_CHANGED,self.OnNodeSelected,self.tree)
    def OnExpandButton(self,e):
        self.tree.ExpandAll()
    def OnNodeSelected(self,e):
        selected=self.tree.GetSelection()
        self.staticText.SetLabel(self.tree.GetItemText(selected))
        #self.
        self.mainPanel.Layout()
if __name__=='__main__':
    app=wx.App()
    frame=MyFrame()
    frame.Show()
    app.MainLoop()
#___________________________________________________
