# -*- coding: utf-8 -*-
#Created on 2018-12-24 @author: 권달현
import 구분경리
법인세={#보론
        '비영리법인 세무 가이드':{},
         '비영리법인 일반':{
             '비영리법인의 의의':{
                 '법인의 종류':{},
                 '비영리법인의 의미':{}
                 },
             '비영리법인의 구분':{
                 '민법상의 법인':{
                     '사단법인':{},
                     '재단법인':{}
                     },
                 "사립학교법인":{},
                 '특별법에 의한 비영리공익법인':{},
                 "그밖의 특별법에 의해 설립된 비영리법인":{},
                 "법인으로 보는 법인 아닌 단체":{},
                 "비영리외국법인":{},
                 '세법상의 비영리법인':{
                     '비영리법인의 구분':{},
                     '법인세법상 비영리내국법인':{}
                     },
                 '공익법인':{
                     '공익법인의 설립운영에 관한 법률에 의한 공익법인':{},
                     '상속세법및증여세법에의한 공익법인':{},
                     '공익법인과 비영리법인의 구분':{}
                     },
                 '지방세법상 비영리사업자':{}
                 }
             },
         '비영리법인의 설립과 회계,세무':{
             '설립 일반':{
                 '사전검토사항':{
                     '개요':{},
                     '법령의 검토':{},
                     '관할 주무관청의 확인':{}
                     },
                 '비영리법인의 설립':{
                     '설립허가 절차':{},
                     '허가후 절차':{}
                     }
                 },
             '설립 회계,세무':{
                 '설립회계':{
                     '출연자':{},
                     '수증법인':{}
                     },
                 '설립세무':{
                     '재산의 출연':{},
                     '출연시기':{},
                     '출연시한':{},
                     '출연재산의 평가':{}
                     }
                 }
             },
         '비영리법인의 운영과 회계,세무':{
             '비영리법인의 운영':{
                 '운영관리':{
                     '사업운영':{},
                     '재산관리':{},
                     '정관관리':{}
                     },
                 '법인의 등기':{
                     '법인등기의 유형':{},
                     '등기 강제의 수단':{}
                     }
                 },
             '비영리법인 회계':{
                 '회계원칙':{
                     '비영리법인 회계기준 개요':{},
                     '주요 비영리법인별 회계기준':{},
                     '공익법인회계기준':{}
                     },
                 '회계처리':{
                     '회계의 구분':{},
                     '수익사업과 비수익사업 회계의 흐름':{},
                     '자산과 부채의 평가':{}
                     },
                 '예산 및 결산':{
                     '예산과 결산의무':{},
                     '예산의 일반원칙':{},
                     '예산편성절차':{},
                     '결산절차':{}
                     },
                 '재무제표의 작성':{
                     '재무제표의 종류와 작성의무':{},
                     '재무제표 작성방법':{}
                     },
                 '비영리법인별 회계실무':{
                     '학교법인':{},
                     '의료법인':{},
                     '사회복지법인':{}
                     }
                 },
             '비영리법인 세무':{
                 '법인세':{
                     '비영리법인의 범위':{},
                     '수익사업':{
                         "사업소득":{},
                         "이자,배당소득": {},
                         "주식 등의 양도로 인한 수입": {},
                         "고정자산처분수입": {},
                         "부동산에 관한 권리와 기타자산의 양도로 생기는 수입": {},
                         "기타 계속적 행위로 생기는 수입": {},
                         "부수수익": {},
                     },
                     '구분경리':구분경리.법인세,
                     '기부금':{},
                     '고유목적사업준비금':{},
                     '자산양도과세특례':{},
                     '원천징수':{},
                     '법인세 신고':{},
                     '면세사업자 전자세금계산서 발급 및 전송 의무화':{}
                     },
                 '소득세':{
                     '소득의 구분과 과세방법':{},
                     '소득별 원천징수':{},
                     '연말정산':{},
                     '원천징수이행상황신고서':{}
                     },
                 '부가가치세':{
                     '사업자등록':{},
                     '과세거래':{},
                     '면세거래':{},
                     '과세표준의 계산':{},
                     '매입세액공제':{},
                     '세금계산서;':{},
                     '부가가치세 신고':{},
                     '대리납부':{},
                     '폐업,휴업':{},
                     '부가가치세 신고서 작성 사례':{}
                     },
                 '상속세및증여세':{
                     '공익법인 재산출연':{},
                     '주식취득 및 보유제한':{},
                     '출연재산의 사후관리':{},
                     '출연재산의 반환':{},
                     '공익법인 세무보고':{}
                     },
                 '취득세':{
                     '취득세 일반':{},
                     '비영리법인에대한 취득세 감면 등':{},
                     '비영리법인의 취득세 중과':{},
                     '비영리 조직구조와 취득세':{}
                     },
                 '재산세':{
                     '납세의무자':{},
                     '과세대상 및 구분':{},
                     '과세표준':{},
                     '세율(지법111조)':{},
                     '재산세 세부담 상한':{},
                     '과세기준일 및 납기':{},
                     '중과세대상':{},
                     '면제대상':{},
                     '기타':{}
                     },
                 '종합부동산세':{
                     '의의':{},
                     '과세대상 여부':{},
                     '과세특례':{},
                     '납세의무자':{},
                     '과세표준':{},
                     '산출세액':{}
                     },
                 '지방소득세':{
                     '개정 취지':{},
                     '과세구조':{},
                     '내국법인의 각 사업연도의 소득에대한 지방소득세':{},
                     '특별징수 소득분':{}
                     },
                 '주민세':{
                     '균등분':{},
                     '재산분':{},
                     '종업원분':{}
                     },
                 '지역자원시설세':{
                     '특정부동산분 과세대상':{},
                     '특정부동산분 납세의무자':{},
                     '특정자원분 지역자원시설세 면제':{}
                     },
                 '비영리법인별 지방세 감면':{
                     '학교 및 외국교육기관에대한 면제(지특법41조)':{},
                     '의료기관':{},
                     '사회복지법인 및 사회복지단체(지특법22조)':{},
                     '종교단체 및 향교(지특법50조,감면조례)':{},
                     '문화예술지원을 위한 과세특례(지특법52조)':{},
                     '사회단체 등에 관한 감면(지특법53조)':{},
                     '학술연구단체 및 장학단체에 관한 감면':{},
                     '평생교육단체 등에대한 면제(지특법43조)':{},
                     '평생교육시설에대한 면제(지특법44조)':{},
                     '박물관 등에대한 면제(지특법44조의2)':{},
                     '노인복지시설(지특법20조)':{},
                     '어린이집 및 유치원에대한 감면(지특법19조)':{},
                     '아동복지시설에대한 감면(지특법19조의2)(2018년이후)':{},
                     '청소년단체에대한 감면':{},
                     '사회적기업에대한 감면(85조2항)':{},
                     '민영교도소(지특법85조2항)':{},
                     '정당에 대한 면제(지특법89조)':{}
                     },
                 '감면 제외대상(지특법177조)':{
                     '취득후 사치성재산이 된 경우 세율 적용':{},
                     '합병이후 사치성재산이 된경우 세율적용':{}
                     },
                 '지방세 감면 상한제(최소납부제)':{
                     '면제의 의미':{},
                     '감면율의 의미':{},
                     '적용시기':{},
                     '지방세 감면 상한제 배제':{}
                     },
                 '중복감면의 배제':{
                     '개요':{},
                     '"동일한 과새대상"의 의미':{},
                     '지방세법상의 세율특례도 중복감면배제 규정 적용 여부':{},
                     '세목별로 중복감면 배제규정 적용':{},
                     '감면시한 경과후 다른 감면규정의 적용시한이 남아 있는 경우':{},
                     '추징시 중복감면 배제로 인한 감면받지 아니한 규정 적용여부':{}
                     },
                 '지방세 감면,축소,조정에 따른 부칙(부칙13조)':{}
                 }
             },
         '비영리법인 소멸과 회계,세무':{
             '소멸일반':{
                 '해산':{
                     '해산사유':{},
                     '해산등기와 신고':{}
                     },
                 '허가취소':{
                     '취소요건':{},
                     '청문':{},
                     '취소처분에대한 구제':{}
                     },
                 '잔여재산처분 허가':{
                     '잔여재산처분의 허가대상':{},
                     '허가신청':{}
                     },
                 '청산':{
                     '청산기관':{},
                     '청산사무':{},
                     '청산종결의 등기와 신고':{}
                     }
                 },
             '소멸세무':{
                 '법인세':{
                     '비영리법인의 납세의무':{},
                     '청산과 부동산 처분':{}
                     },
                 '상속세및증여세':{
                     '해산시 과세관계':{},
                     '공익법인에대한 과세':{},
                     '잔여재산의 귀속자에 대한 과세':{}
                     }
                 }
             }
         }