# -*- coding: utf-8 -*-
"""
Created on Fri Aug 31 16:40:21 2018

@author: SAMSUNG 11
"""

법인세액납부및환급={
                '세액의 납부방법':{},
                '전자납부절차 및 요령':{},
                '세액의 환급':{},
                }
법인세납부세액의계산={
            '산출세액의 계산':{
                '법인세율':{},
                '산출세액 계산 사례':{},
                },            
            '공제감면세액의 계산':{
                '면제(감면)세액':{},
                '세액공제':{},
                '공제감면세액의 공제순위':{},
                },
            '최저한세의 계산':{
                '적용대상 법인':{
                    '내국법인':{},
                    '외국법인':{},
                    },
                '적용범위':{},
                '최저한세의 계산구조':{
                    '각종 감면 후의 세액':{},
                    '각종 감면 전의 과세표준':{},
                    '최저한세 계산 후의 금액에 추가하여 납부하여야 하는 가산세 등의 범위':{},
                    '최저한세 계산 후에 공제하는 외국납부세액 등의 범위':{},
                    '각종 감면규정의 적용 배제 순서':{},
                    '최저한세 적용으로 감면배제되는 세액의 처리':{},
                    '최저한세 조정계산 사례':{},
                    },
                '해운기업의 비해운소득에 대한 감면적용시 최저한세':{},
                },
            '결손금 소급공제에 의한 환급':{
                '적용대상 법인':{},
                '환급신청 방법':{},
                '환급세액의 결정 및 환급':{},
                '환급신청 세액의 계산':{},
                '환급세액의 추징':{},                
                },
            }