# -*- coding: utf-8 -*-
#Created on 2018-12-24 @author: 권달현
손비={
	'...':{},
	}
법인세={
        '판매한 상품 드의 매입액과 그 부대비용':{},
        '양도자산의 장부가액 ':{},
        '특수관계인간 사업양도 양수시 시가미달 취득분 고정자산의 감가상각비상당액 ':{},
        '자산의 임차료 ':{},
        '자산의 평가차손 ':{},
        '조합 또는 협회의 회비 ':{},
        '광산업의 탐광비 ':{},
        '무료진료권 또는 새마을진료권에 의하여 행한 무료진료의 가액 ':{},
        '무상기증하는 잉여식품의 장부가액 ':{},
        '업무와 관련이 있는 해외시찰훈련비 ':{},
        '주식매수선택권 등 행사시 행사 지급비용 보전금액 ':{},
        '그밖의 손비로 법인에 귀속되었거나 귀속될 금액 ':{},
}