# -*- coding: utf-8 -*-
#Created on 2018-12-24 @author: 권달현
유형별손익의귀속시기={
        "자산의 양도":{},
        "자산의 임대":{},
        "장기할부조건 판매 양도":{},
        "건설 제조 그밖의 용역(도급공사 예약매출 포함)의 제공":{},
        "이자소득 등(수입이자,수입보험료,부금,수입보증료,수입수수료)":{},
        "법인이 지급하는 이자 할인액":{},
        "수입배당금":{},
        "금전등록기 설치 사용법인:현금주의":{},
        "리스료":{},
        "법인이 아닌 조합 등으로부터 받는 분배이익금":{},
        "징발재산의 양도 및 매출채권 받을어음의 배서양도":{},
        "차액 정산 파생상푸 거래손익":{},
        "기타":{},
        }
기업회계={
        "국제회계기준":{},
        "일반기업회계기준":{},
        "기준간 비교":{},
        "상품(부동산 제외) 제품 또는 기타의 생산품의 판매손익 귀속시기":{},
        "상품 등 이외의 자산처분손익의 귀속시기":{},
        "용역제공 등에 관한 손익귀속시기":{},
        "KIFRS수익관련 회계처리 및 세무조정":{},
        }
법인세={#법인세
        "국세청":{
            "  각 사업연도 소득의 귀속시기를 기업 스스로 조절할 수 있도록 허용할 경우 법인세 부담의 조작 및 회사간 과세의 불공평 등과 같은 많은 문제점이 야기되므로 법인세법에서는 과세소득계산의 공평을 기하기 위하여 익금과 손금을 어느 사업연도로 귀속시킬 것인가에 관하여 특별히 규정하고 있습니다.": {},
            "  법인세법상 익금과 손금의 귀속시기는 원칙적으로 그 익금과 손금이 확정된 날이 속하는 사업연도로 하고 있으며, 거래형태별 손익의 귀속사업연도는 시행령 및시행규칙 등에서 이를 개별적으로 규정하고 있습니다.": {},
            "  법인이 익금과 손금의 귀속사업연도에 관하여 일반적으로 공정  타당 하다고 인정되는 기업회계의 기준이나 관행을 계속적으로 적용하여 온 경우로서 세법에서 달리 규정하고 있는 경우를 제외하고는 당해 기업회계의 기준 또는 관행에 의할수 있습니다. ": {},

            "※ 기업회계기준과 관행의 범위(법령§79) ": {},
            " 국제회계기준  주식회사의 외부감사에 관한 법률 제13조제1항제2호 및 같은 조 제4항에 따라 한국회계기준원이 정한 회계처리기준  증권선물위원회가 정한 업종별 회계처리준칙 <예> 리스회계처리준칙, 건설업회계처리준칙, 은행업회계처리준칙  공공기관의 운영에 관한 법률에 따라 제정된 공기업 준정부기관 회계규칙  기타 법령에 의하여 제정된 회계처리기준으로서 기획재정부장관의 승인을 얻은 것 ": {},

            "가. 익금의 귀속사업연도 ": {
                "(1) 자산의 판매수익 (법령§68)": {

                    "① 상품(부동산 제외) 제품 또는 기타 생산품의 판매수익 ": {},
                    "  상품 등을 인도한 날 - 납품계약 또는 수탁가공계약에 의한 경우에는 당해 물품을 계약상 인도하여야할 장소에 보관한 날다만, 검수조건부인 때에는 검사가 완료된 날 - 수출의 경우 수출물품을 계약상 인도하여야 할 장소에 보관한 날 ": {},
                    "② 상품 등의 시용판매 수익 ": {},
                    "  상대방이 그 상품 등에 대한 구입의 의사를 표시한 날다만, 일정기간내에 반송하거나 거절의 의사를 표시하지 아니하면 특약 등에 의하여그 판매가 확정되는 경우에는 그 기간의 만료일 ": {},
                    "③ 상품 등 외의 자산의 양도로 인한 수익 ": {},
                    "  대금청산일과 소유권 이전등기일 인도일 또는 사용수익일 중 빠른 날 ": {},
                    "④ 위탁매매로 인한 수익 등：수탁자가 위탁자산을 매매한 날 ": {},
                    "⑤  자본시장과 금융투자에 관한 법률  제8조의2제4항제1호에 따른 증권시장에서 같은법 제393조제1항에 따른 증권시장업무규정에 따라 보통거래방식으로 한 유가증권의 매매：매매계약을 체결한 날 ": {},
                    "⑥ 장기할부조건부 판매수익 등 ": {},
                    "  자산의 판매 또는 양도(국외거래에 있어서는 소유권이전조건부 약정에 의한 자산의 임대포함)로서 ": {},

                    "  판매금액 또는 수입금액을 월부 연부 기타의 지불방법에 따라 2회이상 분할하여 수입하는 것 중 목적물 인도일의 다음날부터 최종의 할부금의 지급일까지의 기간이 1년 이상인 경우": {},
                    "  판매수익 - ① 및 ③의 시기를 원칙으로 하되, 장기할부조건에 따라 회수하였거나 회수할 금액을 결산상 수익으로 계상한 경우에는 당해 회수하였거나 회수할 날 (결산반영시 세무조정 불가) - 다만, 중소기업은 장기할부조건에 따라 회수하였거나 회수할 날로 신고조정 선택 가능(2010.12.30.이 속하는 사업연도 분부터) ": {},
                    "☞ 인도일 이전에 회수하였거나 회수할 금액은 인도일에 회수한 것으로 보며, 법인이 할부기간 중에 폐업한 경우에는 폐업일 현재 익금에 산입하지 아니한 금액을 폐업일이 속하는 사업연도에 익금에 산입 ": {},
                    "  현재가치할인차금 - 장기할부조건 등으로 자산을 판매하거나 양도함으로써 발생한 채권에 대해 기업회계기준에 의한 현재가치할인차금을 계상한 경우 - 당해 현재가치할인차금 상당액은 당해 채권의 회수기간동안 기업회계 기준이 정하는 바에 따라 환입하였거나 환입할 금액을 각 사업연도의 익금에 산입 ": {},

                },
                "(2) 용역제공 등에 의한 수익 (법령§69) ": {
                    "  적용대상 - 건설 제조 기타 용역(도급공사 및 예약매출 포함) ": {},
                    "* 예약매출：매매목적물의 견본이나 안내서와 함께 판매조건을 매수희망자에게 제시하고 매수희망자가 이를 구입하기로 약정한 경우에 그 대금의 일부 또는 전부를 수수하는 판매방식 (예)아파트분양, 선박제조 등 ": {},
                    "  귀속사업연도 - 작업진행률 기준을 원칙으로 하되, - 다만, 장부미비 등으로 작업진행률 계산을 할 수 없거나 법법§51의2①항 각호에 해당하는 법인으로서 국제회계기준 적용 법인이 수행하는 예약매출은 목적물의 인도일, 용역제공 완료일 ": {},

                    "* 작업진행률 = ": {},
                    "- 다만, 기업회계기준에 따라 그 목적물의 인도일이 속하는 사업연도의 수익과 비용으로 계상한 경우 및 중소기업이 수행하는 계약기간 1년 미만인 건설 등의 경우에는 인도기준 선택 가능 ": {},
                    "* 기업회계기준에 따른 인도기준 허용은 2012.2.2.이후 최초 신고분부터 적용가능 ": {},
                    " 익금산입액 = 계약금액 × 작업진행률 － ": {},
                    "직전 사업연도말까지 수입계상액 ": {},
                    "당해 사업연도말까지 발생한 총공사비누적액 총공사예정비": {},
                    "* 총공사예정비는 건설업회계처리준칙을 적용하여 계약당시 추정한 공사원가에 당해 사업연도말 까지의 변동상황을 반영하여 합리적으로 추정한 공사원가임.": {},
                    "* 작업진행률은 기업회계기준에 의한 생산량기준법 투입량기준법으로 산정가능": {},
                    " 손금산입액 〓 당해 사업연도에 발생한 총비용 ": {},
                },
                "(3) 이자수입 등 (법령§70)": {
                    "① 금융보험업 영위법인의 영업수익 ": {

                        "  영업수익인 수입이자, 수입보험료, 부금, 수입보증료, 수입수수료 → 실제로 수입된 사업연도(현금주의)": {},
                        "  선수입이자 보험료, 선수입부금, 선수입보증료, 선수수수료 등 → 당기 수익계상 불가함. ": {},
                        "☞ 금융보험업 영위법인(법령§111②)이 결산을 확정함에 있어서 이미 경과한 기간에 대응하는 수입이자(법법§73의 규정에 의하여 원천징수되는 이자 등은 제외)· 보험료상당액 등을 수익으로 계상한 경우에는 그 계상한 사업연도의 익금으로 합니다. → 세무조정불가 ": {},
                        "  자본시장과 금융투자업에 관한 법률에 따른 투자매매업자 또는 투자 중개업자가 정형화된 거래방식으로 증권을 매매하는 경우 그 수수료 → 매매계약체결일이 속하는 사업연도": {},
                        "  투자회사 등이 결산을 확정함에 있어서 증권의 투자와 관련된 수익 중 이미 경과한 기간에 대응하는 이자 등과 배당소득을 수익으로 계상한 경우에는 그 계상한 사업연도의 익금으로 함. ": {},

                    },
                    "② 금융보험업 법인 이외 법인의 수입이자 ": {

                        "  소득세법§16①12호의 이자와 할인액：약정에 의한 상환일. 다만, 기일 전에 상환하는 때에는 그 상환일 ": {},
                        "* 소득세법§16①12호：소득세법§16①1호 내지 11호의 소득과 유사한 소득으로서 금전의 사용에 따른 대가의 성격이 있는 것 ": {},
                        "  소득세법§46①의 규정에 의한 채권 - 무기명인 것의 이자와 할인액：그 지급을 받은 날 - 기명인 것의 이자와 할인액：약정에 의한 지급일 ": {},
                        "* 소득세법§46 ①：국가 지방자치단체, 내국법인, 외국법인의 국내지점 또는 국내영업소, 외국법인이 발행한 채권 또는 증권 및 다른 사람에게 양도가 가능한 증권 등 ": {},
                        "  보통예금 정기예금 적금 또는 부금의 이자 - 실제로 이자를 지급받는 날 - 원본에 전입하는 뜻의 특약이 있는 이자는 그 특약에 의하여 원본에 전입된 날 - 해약으로 인하여 지급되는 이자는 그 해약일 - 계약기간을 연장하는 경우에는 그 연장하는 날 - 정기예금연결적금의 경우 정기예금의 이자는 정기예금 또는 정기적금이 해약되거나 정기저축의 저축기간이 만료되는 날": {},
                        "  통지예금의 이자：인출일": {},
                        "  채권 또는 증권의 환매조건부 매매차익 - 약정에 의한 당해 채권 또는 증권의 환매수일 또는 환매도일 (기일 전에 환매수 또는 환매도하는 경우 환매수일 또는 환매도일)": {},
                        "  저축성보험의 보험차익 - 보험금 또는 환급금의 지급일(기일전에 해지 시 그 해지일)": {},
                        "  비영업대금의 이익 - 약정에 의한 이자지급일(이자지급일의 약정이 없거나 약정일 이전에 이자를 지급받는 경우에는 그 이자지급일) ": {},
                        "Ⅱ ": {},
                        "Ⅱ. 각 사업연도 소득의 계산 153 ": {},
                        "※ 법인이 결산을 확정함에 있어서 이미 경과한 기간에 대응하는 이자 및 할인액(법법§73의 규정에 의하여 원천징수되는 이자 등은 제외)을 해당 사업연도의 수익으로 계상한 경우에는 그 계상한 사업연도의 익금으로 합니다. → 세무조정불가 ": {},

                    },
                    "③ 수입배당금 ": {
                        "  잉여금처분에 의한 배당(주식배당 포함)：잉여금처분결의일   주식의 소각 감자에 의한 의제배당：주식의 소각 감자를 결정한 날   퇴사 탈퇴로 인한 의제배당：퇴사 또는 탈퇴한 날   잉여금의 자본전입에 의한 의제배당금：자본전입을 결정한 날   해산으로 인한 의제배당：잔여재산가액의 확정일   합병 또는 분할로 인한 의제배당：합병등기일, 분할등기일 ": {},
                    },
                },
                "(4) 임대료 등 기타 수익 (법령§71)": {
                    "① 임대료 수익 ": {

                        "  계약에 의하여 지급기일이 정해진 경우에는 그 지급일, 지급기일이 정하여지지 아니한 경우에는 그 지급받은 날 ": {},
                        "☞ 결산시 이미 경과한 기간에 대응하는 임대료상당액을 수익으로 계상한 경우 및 임대료 지급기간이 1년을 초과하는 경우 이미 경과한 기간에 대응하는 임대료상당액과 비용은 각각 당해 사업연도의 익금과 손금으로 합니다. → 세무조정불가 ": {},

                    },
                    "② 금전등록기를 설치 사용하는 경우의 수입금액 ": {
                        "  소득세법§162 및 부가가치세법§36④의 규정을 적용받는 업종을 영위하는 법인이 금전등록기를 설치 사용하는 경우 그 수입하는 물품대금과 용역 대가는 그 금액이 실제로 수입된 사업연도 ": {},
                    },

                    "③ 리스료 수입 ": {
                        "  리스이용자가 리스로 인하여 수입하거나 지급하는 리스료의 익금과 손금은 기업회계기준이 정하는 바에 따름. ": {},
                    },

                    "④ 법인이 아닌 조합 등으로부터 받는 분배이익금 ": {
                        "  당해 조합 등의 결산기간이 종료하는 날 ": {},
                    },

                    "⑤ 징발재산의 매도에 따른 익금 ": {
                        "  징발재산정리에 관한 특별조치법에 의해 징발된 재산을 국가에 매도하고 징발보상 증권을 받은 경우": {},
                        "- 상환조건에 따라 상환 받았거나 상환받을 금액을 해당 사업연도에 익금산입 (상환비율에 상당하는 매도자산의 원가는 손금산입)": {},
                        "- 징발보상증권을 국가로부터 전부 상환받기 전에 양도한 경우   양도한 때에 상환받은 것으로 보고, 익금과 손금을 계상 ": {},
                    },

                    "⑥ 자산유동화에 관한 법률 제13조에 따른 방법에 의하여 보유자산을 양도하는 경우 및매출채권 또는 받을어음을 배서양도하는 경우 ": {
                        "  기업회계기준에 의한 손익인식방법에 따라 관련 손익의 귀속사업연도를 정함 ": {},
                        "☞ K-IFRS 도입에 따른 세무조정 부담을 완화하기 위하여 자산의 매각으로 처리하던 종전의 방식을 기업회계기준에 따라 차입 매각거래로 처리할 수 있도록 변경(2012.2.2.이후 최초 신고분부터 적용) ": {},
                    },

                    "⑦ 법인이 법인세법 시행령 §24①2 바목에 따른 개발비로 계상하였으나 해당 제품의 판매 또는 사용이 가능한 시점이 도래하기 전에 개발을 취소한 경우에는 다음 각 호의 요건을 모두 충족하는 날이 속하는 사업연도의 손금에 산입 ": {
                        "  해당 개발로부터 상업적인 생산 또는 사용을 위한 해당 재료 장치  제품 공정 시스템 또는 용역을 개선한 결과를 식별할 수 없을 것": {},
                        "  해당 개발비를 전액 손금으로 계상하였을 것 ": {},
                        "☞ 2012.2.2.이후 최초 신고분부터 적용 ": {},
                    },

                    "⑧ 계약의 목적물을 인도하지 아니하고 목적물의 가액변동에 따른 차액을 금전으로 정산하는 파생상품의 거래로 인한 손익 ": {
                        "  그 거래에서 정하는 대금결제일이 속하는 사업연도의 익금과 손금으로 함. ": {},
                        "☞ 2012.2.2.이후 최초로 계약을 체결하는 분부터 적용 ": {},
                    },

                    "⑨ 기타 익금 ": {
                        "  관세환급금 - 수출과 동시에 환급받을 금액이 확정되는 경우에는 당해 수출을 완료한 날 - 수출과 동시에 환급받을 관세 등이 확정되지 아니하는 경우에는 환급금의 결정통지일 또는 환급일 중 빠른날": {},
                        "  국고보조금：교부통지를 받은 날": {},
                        "  보험차익：보험금 지급이 확정된 날": {},
                        "  수용에 따른 보상금：지급이 확정된 날 또는 기업자가 대금을 공탁한 날 (이의신청 등으로 손실보상액이 조정된 경우의 차액은 조정금액이 확정된 날)": {},
                        "  물품매도확약서 발행업의 수익：당해 물품 선적일 (단, 물품매도확약서 발행에 관한 장부와 제 증빙서류를 비치하지 아니한 경우에는 신용장 개설일이 속하는 사업연도)": {},
                        "  조세 등의 결정취소로 인한 환급금 및 이자：취소결정이 확정된 날(통지를 요하는 경우는 통지받은 날)이 속하는 사업연도": {},
                        "  국내사업장이 있는 외국법인이 외국에서 자기가 생산 매입한 물품을 국내판매 시의 수익 - 인도조건이 외국항구 선적조건인 경우 계약금 영수에 불구하고 외국항구에서 선적된 날": {},
                        "  공사계약의 해약에 따른 수입금액 - 당초 작업진행률에 의하여 계상한 수입금액이 공사계약의 해약으로 인하여 수입금액으로 확정된 금액과 차액이 발생한 경우 해약일이 속하는 사업연도의 손금 또는 익금으로 함. ": {},
                        "* 2012.2.2. 시행령 개정시 계약해약의 경우 손익귀속시기를 명확히 규정(법령§69③) ": {},
                        "  가입회비(입회금) - 반환의무가 없는 경우：수입이 확정되는 날이 속하는 사업연도(일시에 미리 받는 경우에는 이용 가능한 기간으로 안분한 금액을 각 사업연도의 익금으로 함) ": {},
                        "* 해약이나 탈퇴시 전액 반환하기로 하는 보증금：수입으로 계상하지 아니하고 부채계정으로 처리 ": {},

                        "- 회원자격 기간을 일정기간으로 한정하고 회원가입시에 일정액을 받는 가입 회비로서, 자격기간 중에 탈퇴하면 잔여기간에 상당하는 가입회비를 반환할 것을 명백히 약정하고 있는 경우에는 그 가입회비를 회원자격기간에 균등하게 안분 하여 각사업연도의 익금에 산입합니다.": {},
                        "  손해배상금": {},
                        "- 법원의 판결에 의하여 지급하거나 지급받는 손해배상금 등은 판결이 확정된 사업연도의 익금 또는 손금으로 함 (법원의 판결이 확정된 날：대법원 판결일자 또는 당해 판결에 대하여 상소를 제기하지 아니한 때에는 상소제기의 기한이 종료한 날의 다음날) ": {},
                    },
                },
            },
            "나. 손금의 귀속사업연도 ": {

                "① 수입금액에 대응하는 비용 ": {},
                "  당해 수입금액이 확정되어 익금에 산입하는 때 ": {},
                "② 기타의 손비 ": {},
                "  매출할인 - 상대방과의 약정에 의한 지급기일(그 지급기일이 정하여 있지 아니한 경우에는 지급한 날)이 속하는 사업연도의 매출액에서 차감함.": {},
                "  지급이자 - 소득세법시행령§45의 규정에 의한 수입시기에 해당하는 날 ": {},
                "☞ 결산을 확정함에 있어서 경과기간에 대한 이자 등을 당해 사업연도의 손금으로 계상한 경우에는그 계상한 사업연도의 손금으로 합니다. ": {},
                "  자산의 평가손실(법법§42③) - 당해 감액사유가 발생한 사업연도(법령§78③) ": {},

                "  기부금 - 가지급금 등으로 이연계상한 경우  지출한 사업연도의 기부금으로 하고, 그 후의 사업연도에 있어서는 기부금으로 보지 아니함.": {},
                "- 미지급금으로 계상한 경우  실제로 지출할 때까지는 기부금으로 보지 아니함. ": {},
                "☞ 어음으로 지급한 기부금은 그 어음이 실제로 결제된 날에 기부금이 지출된 것으로 보며, 수표의 경우 교부한 날에 지출된 것으로 봄. ": {},
                "  장기손해보험계약 관련 보험료의 손금산입 - 보험기간 만료후 만기환급금을 지급하는 약정이 있는 손해보험의 보험료는 그보험료액 중 적립보험료 부분은 자산처리하고, 소멸되는 부분은 기간의 경과에 따라 손금산입함.": {},
                "  고정자산 매입대금의 지급지연에 따른 지급이자의 처리 - 고정자산의 매입가격을 결정한 후 대금 중 일부를 지급지연함으로써 그 금액이 실질적인 소비대차로 전환된 경우의 지급이자 중   건설이 준공된 날  까지의 이자는 건설자금이자로, 이후의 이자는 각 사업연도의 손금에 산입 ": {},
                "*  준공된 날 이라 함은(법령§52 ⑥) 건축물의 경우는 소득세법상의 취득일과 사용개시일 중 빠른날을 말하며, 토지·건물외의 기타 사업용고정자산의 경우에는 사용개시일을 말함. ": {},
                "  원자재구입에 따른 지급이자 - 원자재구입을 위하여 금융지원을 받았을 경우에 동 자금에 대한 지급이자는 당해 사업연도의 손금으로 보며 - 법인세법 시행규칙§37에 규정하는 연지급수입 등에 따른 이자를 취득가액과 구분하여 지급이자로 계상한 금액에 대하여도 당해사업연도 손금으로 봄. ": {},
                "☞ 종전에는 은행 신용공여방식(Banker's Usance)에 의한 이자만 손금계상 가능하였으나 2007.": {},
                "3.30. 이후 수입하는 분부터는 D/A방식과 수출자 신용공여방식(Shipper's Usance)에 의한 이자의 경우도 비용처리 가능 ": {},
                "158 2018 법인세 신고안내 ": {},
                "  추가 납부한 산재보험료 - 산재보험료의 개산보험료를 납부한 후 확정보험료와의 차액을 추가로 납부하는 경우 추가 납부 보험료가 확정된 날": {},
                "  조세 공과금 - 그 확정일을 기준으로 판단함.": {},
                " 인지세：과세문서에 인지를 첩용한 날  재산세 균등할주민세 및 종합토지세：고지일  등록세：등기일(취득원가에 산입)  취득세：취득세 자진신고 납부기한(취득원가에 산입)  증권거래세：대금결제일 주권인도일 권리이전일  추가로 확정된 세액：당해 세액 고지일(원칙), 의제매입세액 추가 납부는 사유 발생일(서면2팀-460, 2004.03.16.) ": {},

                "참고：통칙 및 예규 ": {},
                " 아파트 등을 분양하는 경우의 작업진행률 계산(통칙 40-69…7) ": {},
                "① 주택 상가 또는 아파트 등의 예약매출로 인한 익금과 손금의 귀속사업연도를 영제69조 제2항의 규정에 의하는 경우에 당해 아파트 등의 부지로 사용될 토지의 취득원가는 규칙 제34조의 규정에 의한 작업진행률 계산시 산입하지 아니함.": {},
                "② 제1항의 토지 취득원가는 동항의 규정에 의하여 계산된 작업진행률에 의하여 안분하여 손금에 산입함. ": {},
                " 받을어음 할인료의 손금 처리방법(통칙19-19…44) ": {},
                "법인이 금융기관에 받을어음을 할인한 경우 상환청구권 부여 여부에 불구하고 그 거래가 기업회계기준에 의한 매각거래에 해당하는 경우에는 그 할인액을 매각일이 속하는 사업연도의 소득금액 계산시 손금에 산입함. ": {},
                " 사용수익 약정일이 없는 경우의 사용수익일(통칙40-68…4) ": {},
                "영 제68조 제1항 제3호에서 규정하는 “사용수익일”이라 함은 당사자간의 계약에 의하여 사용수익을 하기로 약정한 날을 말하는 것이나, 별도의 약정이 없는 경우에는 자산을 양도하는 법인의 사용승낙으로 인하여 매수인이 당해 자산을 실질적으로 사용할 수 있게된 날을 말함. ": {},
                " 분할등기일 이후 확정된 수입배당금의 귀속(통칙40-70…2) ": {},
                "분할등기일 후 주주총회 결의에 따라 배당이 확정되어 분할신설법인이 수령하는 배당금은 분할법인의 권리와 의무를 승계받은 분할신설법인의 익금으로 함(2009.11.10. 신설) ": {},
                " 경과기간에 발생한 이자수익의 손익귀속시기": {},
                " 법인세법 시행령  제70조제1항제1호 단서의 규정에 따라 결산을 확정함에 있어서 경과한 이자를 해당 사업연도의 수익으로 계상하였다면 경과기간에 발생한 이자상당액 전액을 해당 사업연도의 익금으로 하는 것임(기획재정부 법인세제과-107, 2011.2.16.) ": {},
                " 대손사유가 발생하여 비용계상한 대손금의 손익귀속시기 ": {},
                "법인이 결산서에 비용계상한 대손금이 법인세법 시행령 제19조의2 제1항에 의한 대손사유에 해당되지 않는 경우 세무조정으로 손금불산입 하여야 하는 것이며, 이후 대손사유를 충족한 경우 같은 조 제3항에 따라 손금산입하는 것이나, ": {},
                "160 2018 법인세 신고안내 ": {},
                "같은 법 시행령 제19조의2 제1항제8호의 대손사유에 해당되어 회수할 수 없는 채권을 결산서에 대손금으로 비용계상한 경우에는 그 비용계상한 날이 속하는 사업연도의 손금에 해당되는 것임(법인세과-1155, 2010.12.15.) ": {},
                " 추계경정 다음 사업연도의 기초 재고자산 인식 ": {},
                "법인이 직전 사업연도의 장부 또는 증빙서류 미비 등의 사유로 과세관청으로 부터 법인세법 시행령 제104조제2항제1호의 방법에 따라 각 사업연도 소득금액을 추계경정 받은 경우로서, 추계경정 사업연도의 기말에 실지조사에 의하여 확인된 재고자산은 그다음 사업연도의 기초 재고자산으로 인식하는 것임(법인세과-1041, 2010.11.8.) ": {},
                " 매출액 기준으로 지급받는 로열티의 손익귀속시기 ": {},
                "거래당사자간의 구체적인 계약내용이 없어 정확한 회신은 곤란하나, 법인이 다른 법인에게 자동차 부품생산에 특화된 기술적 지식 등의 노하우를 제공하고 제공받는 법인의 일정기간의 매출 액에 사전약정된 비율의 로열티를 지급받기로 한 경우 상대방 법인의 로열티 산정기준이 되는 매출액 발생기간이 종료되는 날이 속하는 사업연도에 로열티 수입을 익금에 산입하는 것임(법인세과-402, 2010.4.23.) ": {},
                " 사후정산 조건부 거래시 손익귀속시기 ": {},
                "내국법인이 보유하고 있는 비상장주식을 양도하는 경우 손익의 귀속사업연도는 그 대금을 청산한 날, 주식을 인도한 날 또는 명의개서일 중 빠른 날이 속하는 사업연도로 하는 것으로, 법인이 보유중인 다른 법인의 주식을 양도함에 있어 양도일 현재 매매당사자가 합의 결정한 기준가액 으로 양도한 이후 양도일로 부터 일정기간이 경과한 시점에 당해 주식의 시가와 기준가액의 차액을 양도가액에서 가감하기로 약정한 사후정산 조건부 거래의 경우에는 양도일 이후 양도가액과의 정산차액을 그 정산일이 속하는 사업연도의 익금 또는 손금에 산입하는 것임(법인-875, 2009.7.31.) ": {},
                " 아파트 공사시행사의 작업진행률 ": {},
                "시공회사와 도급계약에 의하여 아파트를 신축분양하는 내국법인이  법인세법 시행규칙  제34조 제1항 제1호를 적용함에 있어 “해당 사업연도말까지 발생한 총공사비누적액”은 당해 법인이 직접 부담한 공사원가의 누적액과 당해 법인이 시공회사에 지급할 도급금액의 총액에 시공회사의 작업진행률을 적용하여 계산한 금액의 합계액을 말하는 것임(법인-760, 2009.7.2.) ": {},
                " 선수임대료의 손익 귀속시기 ": {},
                "법인이 부동산을 임대하면서 임대차계약에 따라 임대료 지급기간을 1년으로 하여 임대계약기간 개시 전에 연간 임대료를 일시에 지급받은 경우로서 그 지급받은 ": {},

                "사업연도의 결산 확정시 미경과 기간에 대한 임대료 상당액을 선수임대료로 계상한 경우에는 이를 당해 사업연도의 익금에 산입하지 아니하고 임대계약기간이 속하는 사업연도의 익금으로 하는 것임(서면2팀-2144, 2007.11.23.) ": {},
                " 사용인에 대한 성과상여금의 손익 귀속시기 ": {},
                "법인이 노사간의 단체협약에 의하여 ‘법인세 차감후 영업순이익 및 이익경비율 목표 달성’을 기준으로 사용인에게 지급하기로 한 성과배분 상여금은 그 성과배분 기준일이 속하는 사업연도의 손금에 산입하는 것임(법인세과-706, 2011.9.28. → 법규과 -1246, 2011.9.21.) ": {},
                " 종합부동산세의 손익 귀속시기": {},
                " 법인세법  제40조의 규정에 의한 손익의 귀속사업연도를 정함에 있어서 법인이  종합부동산세법  제16조 제1항의 규정에 의하여 과세표준과 세액을 신고하는 종합 부동산세의 손익 귀속시기는 동 과세표준과 세액을 신고한 날이 속하는 사업연도의 손금에 산입하는 것임(서면2팀-300, 2006.2.6.) ": {},
                " 중간정산 퇴직금을 지연 지급하는 경우 ": {},
                "법인이 근로기준법 제34조 제3항의 규정에 의한 퇴직금 중간정산을 실시함에 있어 재원부족 등으로 중간정산 퇴직금을 지연 지급함에 따라 중간정산 기준일과 실제의 지급일간의 기간에 대한 소정의 보상액을 추가로 지급하는 경우 당해 보상액을 실제로 지급하는 때에 손금에 산입하는 것임(재법인-280, 2004.4.29.) ": {},
                " 의제매입세액 추가납부시 손금귀속 시기 ": {},
                "법인이 부가가치세법 제17조 제3항 규정에 의해 공제받은 매입세액을 동법 시행령 제62조 제2항의 규정에 의해 추가납부하는 경우 당해 추가납부세액 (가산세 제외)은 추가납부 사유가 발생한 날이 속하는 사업연도에 손금산입하는 것임(서면2팀-460, 2004.3.16.) ": {},
                " 관세의 추가고지 ": {},
                "관세법의 규정에 의하여 관세를 신고납부한 후 세율적용 착오 등의 사유로 추가 고지되는 관세는 세관장이 경정결정하는 날이 속하는 사업연도의 손금 또는 수입물품의 취득원가에 가산하는 것임(서면2팀-2428, 2004.11.24.) ": {},
                " 할인카드 누적포인트에 대한 손금 귀속시기 ": {},
                "법인이 고객과 사전약정에 의하여 일정기간의 구매금액에 따라 차등 적용되는 구매포인트를 해당기간 경과후 일시 적립하여 그 적립된 누적포인트에 상당하는 금액을 ": {},
                "162 2018 법인세 신고안내 ": {},
                "구매금액에서 할인하여 주거나 사은품을 지급하는 할인카드 누적포인트 제도를 시행하는 경우 동 누적포인트의 손금 귀속시기는 당해 고객이 누적 포인트를 실제로 사용한 날이 속하는 사업연도임(서이46012-11711, 2002.9.13.) ": {},
                " 작업진행률을 계산할 수 없는 용역의 제공에 대한 손익귀속시기 ": {},
                "부동산 등에 대한 감정평가업무를 주업으로 하는 내국법인이 국토해양부로부터 공동 주택가격 조사·산정업무, 표준지 공시지가 및 표준주택가격 조사·평가업무 용역 등(이하 “부동산가격조사 업무”라 함)을 위임 받아 수행함에 있어,": {},
                "일반 감정평가업무를 수행하면서 추가로 부동산가격조사 업무를 병행하고 있으나 구분경리하지 못함에 따라 부동산가격조사 업무에 대한 업무수행 시간·업무수행일수 및업무수행원가 파악이 불가능하여  법인세법 시행규칙  제34조제6항의 작업진행률을 계산할 수 없는 사유에 해당하는 경우에는  법인세법 시행령  제69조제2항제1호에 따라그 용역의 제공을 완료한 날이 속하는 사업연도에 익금으로 산입하는 것임(법규법인 2012-33, 2012.4.4.) ": {},
                " 지분제 형태 공사계약에 있어 분양대금 감소로 시공사의 수입금액이 감소된 경우의 세무 처리 ": {},
                "건설업을 영위하는 법인이 재건축조합과 지분제계약을 맺어 도급금액(수입 금액)을 조합원분담금과 일반분양금액을 합산한 금액에서 조합의 사업경비를 제외한 금액으로 받기로 약정하고 건설용역을 제공한 경우로서, 해당건설 용역이 완료된 시점에 당초 분양예정가액으로 수입금액을 계상 하였으나 이후 미분양주택의 할인분양에 따라 당초 수입금액과 실제 수입금액과의 차액이 발생한 경우, 그 차액은 그 가액이 확정된 날이 속하는 사업연도의 손금으로 계상하는 것임(법규-1429, 2012.11.30.) ": {},
                " 도시개발사업조합 조합원의 조합 대여금 추가부담 사업비의 처리방법": {},
                " 도시개발법 에 따라 환지방식으로 도시개발사업을 수행하는 도시개발사업 조합의 조합원으로 동 도시개발구역에서 주거용 건물 개발 및 공급업을 영위하는 법인이 도시개발구역 내의 토지를 조합에 제공하고 도시개발사업에 관한 공사가 끝난 후 새로이 조성된 토지를 취득하는 경우에 해당 법인이 조합에 사업비를 대여한 경우 해당 금액은  법인세법 시행령  제19조의2에 따라 대손으로 확정되는 때 손금산입 하는 것이며,  도시개발법  제16조에 따라 도시개발사업에 소요되는 비용을 추가로 부담한 경우에 해당 금액은 토지의 자본적 지출로 보는 것임 이 경우 조합에 사업비를 대여한 금액인지 도시 개발사업에 소요되는 비용을 추가로 부담한 금액인지는 사실판단할 사항임(기획재정부 법인세제과-1214, 2012.12.7.) ": {},

                " K-IFRS 도입에 따른 유동화자산 거래 세무처리 방법 ": {},
                "내국법인이  자산유동화에 관한 법률  제13조에 따른 방법에 의하여 보유자산을 양도한 경우 관련 손익의 귀속사업연도를 정함에 있어  법인세법 시행령 (2012.2.2. 대통령령 제23589호로 개정된 것) 제71조 제4항의 개정규정은 같은 령 부칙 제14조제1항에 따라 2012.2.2 이후 최초로 신고하는 사업연도에 양도한 유동화자산부터 적용하는 것임(법규-955, 2012.8.24.) ": {},
                " 채권발행 법인의 청산절차 진행시 채권에 대한 유가증권감액손실금액의 손금 귀속시기 ": {},
                "채권을 발행한 해외법인이 해당국가의 관보에 주주 및 채권자를 대상으로 해산관련 공시를 하고 청산을 위한 주주총회를 개최하는 등 해산 및 청산절차를 진행 중인 경우 해당 채권을 보유한 내국법인은 그 채권에 대한 유가증권 감액손실금액을 손금에 산입할수 없는 것이며, 해당 채권 발행법인에 대한 해산 및 청산절차의 완료에 따라 해당국가에서의 기업등록이 말소되고 배분 가능한 잔여재산가액이 없는 것으로 확인되는 때에 그 유가증권 감액손실금액을 손금에 산입하는 것임(법규법인2012-175, 2012.5.15.) ": {},
                " K-IFRS에 따라 자본의 차감항목으로 계상한 신종자본증권 발행비용의 손금 귀속시기 등 ": {},
                "내국법인이  상법 의 규정에 따라 사채의 형태로 발행한 신종자본증권(“해당증권”)을 한국채택국제회계기준(K-IFRS)에 따라 자본으로 분류하고 관련원가를 자본의 차감항목으로 계상하는 경우, 해당증권의 발행과 관련하여 발생한 주간사 인수수수료등 직접발행비용은 해당증권의 할인발행차금을 구성하는 것으로 해당증권의 만기상환시에 신고조정으로 손금산입하는 것이며, 해당증권의 발행과 유통을 원활하게 하기 위해 해당증권의 투자자에게 풋옵션을 제공한 외국법인에게 지급하는 보증수수료는  법인세법 시행령  제69조에 규정된 날이 속하는 사업연도에 신고조정으로 손금산입하는 것임(법규법인2013-62, 2013.5.15.) ": {},
                " 과세관청의 경정결정으로 손익귀속시기가 바뀌는 것이 후발적 경정청구 사유인지 여부 ": {},
                "납세의무자가 유형자산처분손실을 손실이연목적으로 매각한 사업연도 이후 사업연도의 손금으로 계상하였으나 과세관청에서 해당 유형자산처분손실을 손금불산입한 경우 해당 과세관청의 결정 또는 경정은 국세기본법  제45조의2 제2항제4호에 따른 경정 청구사유에 해당하지 아니하는 것임(서면-2015-법령해석기본-22259, 2015.12.16.) ": {},

            },
        },
        "귀속시기의 의의":{},
        "법인세법상 손익의 귀속시기":{
                "일반원칙":{
                        '권리의무확정주의':{},
                        '기업회계기준과 관행의 세법상 적용 범위':{},
                        },
                "유형별 손익의 귀속시기":유형별손익의귀속시기,
                "유상사급":{
                        "유상사급의 수익인식":{},
                        "세무조정":{},
                        },
                },
        "기업회계상 손익의 귀속시기":기업회계,
        "기업회계상 전기오류수정손익과 세무조정":{
                "전기오류수정손익":{},
                "세무조정":{},
                },
        "세무조정서식":{},
        }
양도소득세={#양도소득세
    '취득 또는 양도의 시기의 의의':{},
    '일반적인 거래':{
            '대금청산일이 분명한 경우': {},
            '대금청산일이 불분명한 경우': {},
            '대금청산전에 소유권이전등기한 경우': {},
            '장기할부조건의 경우': {},
            '자기가 건설한 건축물의 경우': {},
            '상속 또는 증여의 경우': {},
            '점유부동산의 경우': {},
            '공익사업에 따른 수용의 경우': {},
            '미완성 목적물의 경우': {},
            '환지처분': {},
            '주식': {},
            '취득시기가 불분명한 경우': {},
            '양도가액의 수입시기': {},
            '기타': {},
    },
    '기타의 거래':{
            '당초 취득일을 적요한 경우': {},
            '"부동산 소유권이전등기에 관한 특별조치법"에 의하여 취득한 경우': {},
            '이혼위자료,대물변제': {},
            '이혼시 재산분할청구권에 따른 취득시기': {},
            '잔금을 어음이나 기타 이에 준하는 증서로 받은 경우': {},
            '경락자산의 경우': {},
            '가등기에 의한 본등기': {},
            '법인에 현물출자': {},
            '부동산을 현물출자': {},
            '교환': {},
            '부동산을 취득할 수 있는 권리': {},
            '재개발,재건축아파트': {},
            '직장,지역 조합 아파트': {},
            '토지거래 허가없이 양도': {},
            '조건부매매': {},
            '환매권 행사로 이전등기': {},
            '임차인의 명도 문제로 잔금을 변제공탁한 경우': {},
            '기타': {},
    },
    '취득시기의 의제':{}
}
증여세={
        '일반적인 증여재산의 취득시기':{},
        '증여예시,증여추정,증여의제 재산의 취득시기':{}
}
_={
    "유형별손익의귀속시기": 유형별손익의귀속시기,

    "기업회계": 기업회계,
    "법인세":법인세,
    #"조세특례제한법":조세특례제한법,
    "증여세":증여세,
    "양도소득세":양도소득세,
    #"농어촌특별세":{},
}
tax=_;제목='손익의귀속시기'
import wx
class MyFrame(wx.Frame):
    def __init__(self):
        wx.Frame.__init__(self,parent=None,title=제목)
        self.SetSize(420,320*2)
        self.mainPanel=wx.Panel(self)
        self.expandButton=wx.Button(self.mainPanel,label='펼침')
        self.tree=wx.TreeCtrl(self.mainPanel)
        root=self.tree.AddRoot(제목)
        for i in tax:
            ii=self.tree.AppendItem(root,i)
            for j in tax[i]:
                jj=self.tree.AppendItem(ii,j)
                for k in tax[i][j]:
                    kk=self.tree.AppendItem(jj,k)
                    for m in tax[i][j][k]:
                        mm=self.tree.AppendItem(kk,m)
                        for n in tax[i][j][k][m]:
                            nn=self.tree.AppendItem(mm,n)
                            for p in tax[i][j][k][m][n]:
                                pp=self.tree.AppendItem(nn,p)
                                for q in tax[i][j][k][m][n][p]:
                                    qq=self.tree.AppendItem(pp,q)
                                    for r in tax[i][j][k][m][n][p][q]:
                                        rr=self.tree.AppendItem(qq,r)

        self.staticText =wx.TextCtrl(self.mainPanel,style=wx.TE_MULTILINE)


        self.vtBoxSizer=wx.BoxSizer(wx.VERTICAL)
        self.vtBoxSizer.Add(self.expandButton,0,wx.EXPAND|wx.ALL,5)
        self.vtBoxSizer.Add(self.tree        ,5,wx.EXPAND|wx.ALL,5)
        self.vtBoxSizer.Add(self.staticText  ,0,wx.EXPAND|wx.ALL,5)


        self.mainPanel.SetSizer(self.vtBoxSizer)

        self.Bind(wx.EVT_BUTTON          ,self.OnExpandButton,self.expandButton)
        self.Bind(wx.EVT_TREE_SEL_CHANGED,self.OnNodeSelected,self.tree)
    def OnExpandButton(self,e):
        self.tree.ExpandAll()
    def OnNodeSelected(self,e):
        selected=self.tree.GetSelection()
        self.staticText.SetLabel(self.tree.GetItemText(selected))

        self.mainPanel.Layout()
if __name__=='__main__':
    app=wx.App()
    frame=MyFrame()
    frame.Show()
    app.MainLoop()