# -*- coding: utf-8 -*-
#Created on 2018-12-24 @author: 권달현
import 손익의귀속사업연도
법인세={
    '자산의 양도 등에 의한 수입금액 귀속시기':{},
    '장기할부판매 수입금액 조정':{},
    '용역제공 등에 의한 수입금액조정':{},
    '수입금액조정명세서 작성사례':{},
    '손익의 귀속사업연도':손익의귀속사업연도.법인세,
    "국세청":{

                "기업회계기준 또는 일반적으로 공정 타당하다고 인정되는 관행에 따라 각종 수익을 인식한 경우에도 그 귀속사업연도가 세법에서 정한 것과 다른 경우에는 세법이 정하는 바에 따라 세무조정을 하여야 합니다. ": {},
                "조정에 필요한 내용 ": {},
                "(1) 자산의 양도 등에 의한 수입금액 귀속시기 (법령§68)": {

                    "① 상품 제품 등의 판매：상품 등을 인도한 날 ": {

                        "제품 상품 등의 경우 기업회계기준에 따라 인도기준으로 수익을 인식한 경우에는 대부분 별도의 세무조정이 필요 없으나, 세법상 “인도”의 범위가 일반적인 인도의 개념과 다를 수 있으므로 소득금액 조정시 유의하시기 바랍니다(법령§68①). ": {},
                        "  ‘상품 등을 인도한 날’의 범위(법칙§33)": {},
                        "- 국내판매：납품계약 또는 수탁가공계약에 의하여 물품을 납품하거나 가공하는 경우에는 당해 물품을 계약상 인도하여야 할 장소에 보관한 날. 다만, 계약에 따라 검사를 거쳐 인수 및 인도가 확정되는 물품은 검사가 완료된 날": {},
                        "- 수출：수출물품을 계약상 인도하여야 할 장소에 보관한 날계약상 별단의 명시가 없는 한 선적을 완료한 날을 말하며, 선적완료일이 분명하지 아니한 때에는 수출할 물품을  관세법  제155조 제1항 단서의 규정에 의하여 보세구역이 아닌 다른 장소에 장치하고 통관절차를 완료하여 수출 면장을 발급받은 때(통칙40-68…2) ": {},

                        "- 물품판매에 의한 손익 귀속시기는 세금계산서 발행일자에 불구하고 인도일이 속하는 사업연도임(대법82누114, 1982.10.12.)(통칙40-68…1). ": {},
                    },

                    "② 시용판매：상대방이 상품 등에 대한 구입의사를 표시한 날": {
                        "- 다만, 일정기간 내에 반송하거나 거절의 의사 표시를 하지 아니하면 특약 등에 의하여 그 판매가 확정되는 경우에는 그 기간의 만료일 ": {},
                    },
                    "③ 상품 등외의 자산의 양도로 인한 수익 ": {

                        "- 대금청산일과 소유권 이전등기일 인도일 또는 사용수익일 중 빠른 날 ": {},
                    },
                    "④ 위탁판매：수탁자가 위탁자산을 매매한 날 ": {},
                    "⑤  자본시장과 금융투자에 관한 법률 에 따른 유가증권시장 및 코스닥시장에서 보통거래방식으로 한 유가증권의 매매：매매계약을 체결한 날 ": {

                        "* 2012.1.1. 이후 최초로 개시하는 사업연도 분부터 적용(법령§68①5호 신설, 2012.2.2.) ": {},
                        "- 정형화된 유가증권의 양도：매매계약 체결일(재법인46012-71, 2001.3.28.) ": {},
                    },
                    "⑥ 매출할인(법령§68⑤) ": {

                        "- 상대방과의 약정에 의한 지급기일(지급기일이 정하여 있지 아니한 경우에는 지급한 날)이 속하는 사업연도 매출액에서 차감 ": {},
                    },
                    "⑦ 매출에누리：매출에누리 금액이 확정된 날(법인46012-3117, 1997.12.3.) ": {},
                    "⑧ 판매장려금：약정에 따라 지급하기로 한 날(서면2팀-526, 2005.4.11.) - 거래수량, 금액에 따라 확정되는 장려금：판매한 날(법인22601-215, 1987.1.27.) ": {},

                },
                "(2) 장기할부판매 수입금액 조정 ": {

                    "  장기할부조건으로 자산을 판매하거나 양도한 경우로서 인도일이 속하는 사업연도의 결산확정시 장기할부조건에 따라 회수하였거나 회수할 금액과 이에 대응하는 비용을 각각 수익과 비용으로 계상한 경우에는 앞부분 [1]의 인도기준으로 세무조정할 수 없습니다.": {},
                    "- 다만, 중소기업은 결산상 인도기준으로 인식한 경우에도 회수기준으로 신고조정할 수 있습니다(법령§68②.단서, 2010.12.30. 신설). ": {},
                    "* K-IFRS에서는 회수기준 선택이 금지되어 있어, K-IFRS를 적용하는 중소기업은 회수기준이 불가능한 점을 감안(K-GAAP과의 형평성 제고 차원에서 개정)": {},
                    "※ 장기할부판매의 요건(법령§68④) － 판매금액 또는 수입금액을 월부 연부 기타의 지불방법에 따라 2회이상 분할하여 수입하고 － 목적물 인도기일의 다음날부터 최종할부금 지급기일까지의 기간이 1년 이상인 것 ": {},
                    "사 례 ": {

                        "  장기할부조건에 따라 당해 사업연도에 회수하여야 할 금액이 600,000원이나, 실제로 회수한 금액은 차기분 포함 700,000원인 경우": {},
                        "- 장기할부조건에 따라 당해 사업연도에 회수하여야 할 금액인 600,000원과 이에 대응하는 비용을 익금과 손금에 산입함.": {},
                    },
                    "  세무조정시 유의사항": {

                        "- 국외거래에 있어서 소유권이전 조건부 약정에 의한 자산의 임대는 자산의 양도에 포함함(법령§68④).": {},
                        "- 장기할부판매계약시 인도일 이전에 회수하였거나 회수할 금액은 인도일에 회수한 것으로 보아 세무조정 하여야 함(법령§68③).": {},
                        "- 장기할부 기간 중에 폐업한 경우에는 그 폐업일 현재 익금에 산입하지 아니한 금액과 이에 대응하는 비용을 폐업일이 속하는 사업연도의 익금과 손금에 각각 산입함(법령§68③).": {},
                        "- 장기할부조건 등에 의해 자산을 판매하거나 양도함으로써 발생한 채권에 대하여 기업회계기준에 따라 현재가치로 평가하여 현재가치할인차금을 계상한 경우 해당 현재가치할인차금 상당액은 당해 채권의 회수기간동안 기업회계기준이 정하는 바에 따라 환입하였거나 환입할 금액을 각 사업연도의 익금에 산입함(법령§68⑥). ": {},

                    },
                },
                "(3) 용역제공 등에 의한 수입금액조정 (법령§69) ": {

                    "  내국법인의 건설 제조 기타 용역(도급공사 및 예약매출 포함)의 제공으로 인한 익금과 손금은 그 목적물의 건설 등 착수일이 속하는 사업연도부터 그 목적물의 인도일(용역제공의 경우에는 그 제공을 완료한 날을 말함)이 속하는 사업연도까지 작업진행률을 기준으로 하여 계산한 수익과 비용을 각각 해당 사업연도의 익금과 손금에 산입합니다.": {},
                    "- 다만, 다음 중 어느 하나에 해당하는 경우에는 그 목적물의 인도일이 속하는 사업연도의 익금과 손금에 산입할 수 있습니다.": {},
                    " 중소기업인 법인이 수행하는 계약기간이 1년 미만인 건설 등의 경우": {},
                    " 기업회계기준에 따라 그 목적물의 인도일이 속하는 사업연도의 수익과 비용으로 계상한 경우 → 2012.2.2. 이후 최초로 신고하는 분부터 적용(법령 부칙§14①, 2012.2.2.)": {},
                    "- 작업진행률에 의한 익금 손금이 공사계약의 해약으로 인하여 확정된 금액과 차액이 발생된 경우에는 그 차액을 해약일이 속하는 사업연도의 익금 또는 손금에 산입합니다. ": {},
                    "* 법인통칙(40-69…4)을 영에 명시하여 명확화 하였음 ": {},
                    "  작업진행률을 계산할 수 없다고 인정되는 경우 * 나 국제회계기준을 적용하는 법법§51의2 적용대상 법인(부동산투자회사 등)은 그 목적물의 인도일이 속하는 사업연도의 익금과 손금에 산입합니다(법령§69②, 2010.12.30. 개정). ": {},
                    "* 법인이 비치 기장한 장부가 없거나 비치 기장한 장부의 내용이 불충분하여 실제로 소요된 총공사비 누적액 또는 작업시간 등을 확인할 수 없는 경우(규칙§34④) ": {},
                    "  작업진행률에 의한 수입금액 계산방법(법칙§34) - 익금(각사업연도소득) = [계약금액×작업진행률] - 직전사업연도말까지 익금에 산입한 금액 - 손금 = 당해 사업연도에 발생한 총비용 ": {},
                    "※ 작업진행률 = ": {},
                    "당해 사업연도말까지 발생한 총공사비 누적액 총공사예정비 ": {},

                    "  2007.3.30. 이후 최초로 건설 제조 기타 용역을 제공하는 분부터는 수익실현이 작업시간 작업일수 또는 기성공사의 면적이나 물량 등과 비례관계가 있고, 전체 작업시간 등에서 이미 투입되었거나 완성된 부분이 차지하는 비율을 객관적으로 산정할 수 있는 경우 그 비율로 계산할 수 있습니다. ": {},
                    "수입금액 조정명세서 작성시 유의할 사항 ": {
                        " 부가가치세 신고상황과 비교하여 차액의 원인이 타당한지 확인  직전기 “자본금과 적립금 조정명세서”를 검토하여 익금불산입 유보 처분된 수입금액 등을 조정에 반영하였는지 확인  개별소비세 주세 해당물품：반출 및 판매 현황과 비교 검토  기타사항 ": {},
                        "- 재무상태표일 전 후에 이루어진 매출의 기간귀속의 적정여부 확인 - 본 지점간 내부미실현이익을 적정하게 조정하였는지 확인 - 수입금액 판매장려금 누락분, 수정신고분, 조사분 반영 여부 등 확인 ": {},
                    },
                },
                "참고：통칙 및 예규 ": {

                    " 예약매출 계산방법 ": {

                        "예약매출에 대해 K-IFRS 도입에 따라 인도기준으로 회계처리를 변경한 경우 해당 손익은그 인도일이 속하는 사업연도의 익금과 손금에 산입할 수 있는 것임(법령해석법인-5899": {},
                        "(2017.2.21.) ": {},
                    },
                    " 작업진행률 계산방법 ": {

                        "작업진행률 계산시 ‘총공사예정비’는  법인세법 시행규칙  제34조제2항에 따라 기업회계 기준을 준용하여 계약당시에 추정한 공사원가에 해당 사업연도말 까지의 변동상황을 반영하여 합리적으로 추정한 공사원가로 하는 것으로,": {},
                        "해당 법인이 아파트 준공시 지출하는 보존등기비용(취득세,등록세)은 총공사 예정비에 포함되는 것임(법인세과-1018, 2010.10.29.) ": {},

                    },
                    " 아파트 분양계약이 취소된 경우 손익의 인식 ": {},
                    "아파트를 신축 분양하는 내국법인이 법인세법 시행령 제69조의 규정에 따라 작업 진행률에 의해 계산한 수익과 비용을 각 사업연도의 익금과 손금으로 산입한 이후 계약상대방으로부터 분양계약 취소 및 분양대금 반환청구의 소가 제기된 경우에는 당해 소송이 확정되어 그 계약이 해제된 경우 당해 아파트의 분양수입과 분양원가 상당액을 계약의 해제일이 속하는 사업연도의 손익에 반영하는 것임(법인세과 -1280, 2009.11.16.) ": {},
                    " 수용에 따른 손실보상금 및 철거이전보상금의 귀속시기 ": {},
                    "토지 등의 수용에 따른 손실보상금은 보상금의 지급이 확정되거나 기업자가 대금을 공탁한 날이 속하는 사업연도에 귀속되며 철거이전보상금 및 철거이전비용은 철거이전이 확정되는 사업연도에 귀속됨(법인세과-3964, 2008.12.12.) ": {},
                    " 토지거래계약에 관한 허가를 받지 못한 경우 ": {},
                    "잔금 청산 후 토지거래계약에 관한 허가를 받지 아니한 경우에는 계약의 효력이 발생하지 아니하여 자산의 양도 또는 취득으로 보지 아니하는 것이므로 잔금청산일이 속하는 사업연도 법인세 신고분을 수정신고 또는 경정청구하는 것임(서면2팀-1457, 2006.7.31.) ": {},
                    " 계약기간이 다른 경우 아파트 동별로 장 단기여부를 적용함. ": {},
                    "건설용역의 손익귀속시기 적용시 각 동별로 건설 등의 계약기간이 다른 경우 각 동별로 장 단기도급공사인지의 여부를 판단함(서이46012-10169, 2003.1.23.) ": {},
                    " 건설업법인의 하자보수비는 총공사예정비 및 누적액에 포함 ": {},
                    "법인세법시행규칙 제14조의3(현행 제34조) 제1항 규정의 작업진행률을 계산함에 있어 건설업회계처리기준에 따라 예상되는 하자보수비는 총공사 예정비에 포함하고 공사가 완료되는 사업연도의 총공사비누적액에도 포함하는 것임(법인46012-312, 1998.2.6) ": {},

                },
                "(4) 수입금액조정명세서 작성사례 ": {

                    "수입금액 조정명세서(사업연도 2017. 1. 1.∼ 12. 31., 중소기업 아님)를 작성해 봅시다. ": {},
                    "자 료 ": {},
                    "① 결산서상 수입금액 내역 ": {},
                    " 제품매출：800,000,000원  공사매출：675,000,000원 ": {},
                    "② 공사현장별 공사현황 ": {},
                    "공사명 ": {},
                    "A ": {},
                    "B ": {},
                    "공사계약 체 결 일 ": {},
                    "2016.11.10. ": {},
                    "2017. 7.20. ": {},
                    "도급계약기간 도급금액 ": {},
                    "2017.2.1.∼2018.5.17. ": {},
                    "2017.8.10.∼2018.9.30 . ": {},
                    "700,000,000 ": {},
                    "400,000,000 ": {},
                    "당해연도총공사비 (총공사예정비) ": {},
                    "460,000,000": {},
                    "(600,000,000) 160,000,000": {},
                    "(300,000,000) ": {},
                    "손익계산서상 수익계상액 ": {},
                    "470,000,000 ": {},
                    "205,000,000 ": {},
                    "계 － － 1,100,000,000 620,000,000 675,000,000 ": {},
                    "③ 사업용 고정자산인 기계를 다음과 같이 매각하였음.": {},
                    "- 계약일 및 인도일：2017. 3. 31.": {},
                    "- 계약금액：18,000,000원 - 대금결제조건：2017. 3. 31. 계약금 3,000,000원을 받고, 6개월 경과시 마다 3,000,000원씩 5회에 나누어 받기로 함.": {},
                    "- 회사는 기계매각대금 총액(18,000,000원) 및 장부가액(15,000,000원) 전액을 당기의 수입금액 및 대응원가로 각각 계상하여 결산하였으며 - 2017. 9. 30.에 회수하여야 할 부불금 3,000,000원이 아직 결제되지 아니하였음.": {},
                    "④ 제품재고액 중 Y제품 8,000,000원은 타인에게 위탁판매하기 위한 위탁품 (적송품)으로서 2017. 12. 31.에 수탁자가 10,000,000원에 판매한 것임": {},
                    "⑤ 2016년도 거래실적이 우수한 대리점에게 사전약정에 의하여 2017년 1/4분기중에 매출에누리 하여준 금액 5,000,000원을 영업외 비용으로 계상함. ": {},
                    "224 2018 법인세 신고안내 ": {},
                    "세무조정계산 ": {},
                    "① 공사수익의 계산 ": {},
                    "공사명 ①도급금액 ": {},
                    "A B ": {},
                    "②당해사업 연도말 총공사비 누적액 ": {},
                    "③총공사 예정비 ": {},
                    "④진행률 (②/③) ": {},
                    "익금산입액⑤ (①×④) ": {},
                    "⑥회사수익 계상액 ": {},
                    "⑦조정액 (⑤－⑥) ": {},
                    "700,000,000": {},
                    "400,000,000 ": {},
                    "460,000,000": {},
                    "160,000,000 ": {},
                    "600,000,000": {},
                    "300,000,000 ": {},
                    "76.6% 53.3% ": {},
                    "536,200,000": {},
                    "213,200,000 ": {},
                    "470,000,000": {},
                    "205,000,000 ": {},
                    "66,200,000": {},
                    "8,200,000": {},
                    "계 1,100,000,000 620,000,000 900,000,000 749,400,000 675,000,000 74,400,000 ": {},
                    "- 공사수익 세무조정": {},
                    "세무상 공사수익 ： 749,400,000": {},
                    "장부상 공사수익 ： 675,000,000 ": {},
                    "                                     ": {},
                    "익 금 산 입 ： 74,400,000(유보)": {},
                    "② 장기할부매각 수입금액 및 대응원가 계산 - 법인이 인도기준으로 결산조정 신고하였으므로 별도의 세무조정은 아니함.": {},
                    "③ 위탁판매 수입금액 조정계산 - 위탁판매액 10,000,000원은 익금산입, 원가 8,000,000원은 손금산입": {},
                    "④ 기업회계기준상 매출에누리는 매출에누리한 사업연도의 수입금액에서 제외 하므로동 에누리금액을 2016사업연도 수입금액에서 차감 ": {},
                    "조정내용정리 ": {},
                    "- 수입금액에 가산할 내용": {},
                    "① 공사매출  작업진행률에 의한 수입금액 조정액 ：74,400,000원": {},
                    "② 제품매출  위탁판매 수입계상 누락액 ：10,000,000원": {},
                    "－ 수입금액에서 차감할 사항": {},
                    "① 제품매출  매출에누리 금액(손금산입하는 것은 아님)： 5,000,000원 ": {},
                    "조정내용 정리사항으로  수입금액조정명세서 를 작성하고, 작성이 끝나면  조정후 수입금액명세서  (별지 제17호 서식)를 작성하여야 합니다. ": {},

                    "사 업 연 도 ": {},
                    "2017. 1. 1.": {},
                    "∼ 2017. 12. 31. ": {},
                    "수입금액조정명세서 ": {},
                    "[별지 제16호 서식] (2011.2.28. 개정) ": {},
                    "법 인 명 (주) 가 나사업자등록번호 101-81-12345 ": {},
                    "1. 수입금액 조정계산": {},
                    "계 정 과 목 ③ 결산서상 수입금액 ": {},
                    "조 정 ⑥ 수 정 후수입금액 (③＋④－⑤) ": {},
                    "비 고": {},
                    "① 항 목 ② 과 목 ④ 가 산 ⑤ 차 감": {},
                    "매 출 제품매출 800,000,000 10,000,000 5,000,000 805,000,000": {},
                    "공사매출 675,000,000 74,400,000 749,400,000 ": {},
                    "계 1,475,000,000 84,400,000 5,000,000 1,554,400,000": {},
                    "2. 수입금액 조정명세 가. 작업진행률에 의한 수입금액 ": {},
                    "작 업 진 행 률 계 산 ": {},
                    "⑦공사명 ⑧도급자 ⑨도급금액 ": {},
                    "    총공사 ": {},
                    "    진행률 ": {},
                    "    누적익금 ": {},
                    "산입액 (⑨×     ": {},
                    "    전기말 ": {},
                    "누적수입 계상액 ": {},
                    "    조정액 ": {},
                    "(    －     －    ) ": {},
                    " 당기 ": {},
                    "    조정액 ": {},
                    "    근거법령": {},
                    " 항 목  과 목 ": {},
                    "( - ) ": {},
                    "    해당사업 ": {},
                    "     당기 회사수입 계 상 액 ": {},
                    "연도말총공 사비누적액 (작업시간 등) ": {},
                    "예정비 (작업시간 등) ": {},
                    "(    /    )": {},
                    "A 갑 700,000,000 460,000,000 600,000,000 76.6% 536,200,000 0 470,000,000 66,200,000": {},
                    "B 을 400,000,000 160,000,000 300,000,000 53.3% 213,200,000 0 205,000,000 8,200,000": {},
                    "계 1,100,000,000 620,000,000 900,000,000 749,400,000 675,000,000 74,400,000": {},
                    "나. 중소기업 등 수입금액 인식기준 적용특례에 의한 수입금액계 정 과 목  세법상 당기 수입금액 ": {},
                    "회사수입금액 계상액 ": {},
                    "계다. 기타 수입금액     구 분     근 거 법 령     수 입 금 액     대 응 원 가 비 고위 탁 판 매 10,000,000 8,000,000 ": {},
                    "계 10,000,000 8,000,000 ": {},
                    "210mm×297mm[일반용지 70g/㎡(재활용품)] ": {},
                    "226 2018 법인세 신고안내 ": {},
                },
            }
}


#___________________________________________________
제목='수입금액의조정'
_={
    #"지방소득세_법인세분 가산세": 지방소득세_법인세분,
    #"기업회계":기업회계,
    "법인세":법인세,
    #"조세특례제한법":조세특례제한법,
    #"증여세":증여세,
    #"상속세":상속세,
    #"양도소득세":양도소득세,
    #"농어촌특별세":{},
}
tax=_
import wx
class MyFrame(wx.Frame):
    def __init__(self):
        wx.Frame.__init__(self,parent=None,title=제목)
        self.SetSize(420,320*2)
        self.mainPanel=wx.Panel(self)
        self.expandButton=wx.Button(self.mainPanel,label='펼침')
        self.tree=wx.TreeCtrl(self.mainPanel)
        root=self.tree.AddRoot(제목)
        for i in tax:
            ii=self.tree.AppendItem(root,i)
            for j in tax[i]:
                jj=self.tree.AppendItem(ii,j)
                for k in tax[i][j]:
                    kk=self.tree.AppendItem(jj,k)
                    for m in tax[i][j][k]:
                        mm=self.tree.AppendItem(kk,m)
                        for n in tax[i][j][k][m]:
                            nn=self.tree.AppendItem(mm,n)
                            for p in tax[i][j][k][m][n]:
                                pp=self.tree.AppendItem(nn,p)
                                for q in tax[i][j][k][m][n][p]:
                                    qq=self.tree.AppendItem(pp,q)
                                    for r in tax[i][j][k][m][n][p][q]:
                                        rr=self.tree.AppendItem(qq,r)
        self.staticText =wx.TextCtrl(self.mainPanel,style=wx.TE_MULTILINE)

        self.vtBoxSizer=wx.BoxSizer(wx.VERTICAL)
        self.vtBoxSizer.Add(self.expandButton,0,wx.EXPAND|wx.ALL,5)
        self.vtBoxSizer.Add(self.tree        ,5,wx.EXPAND|wx.ALL,5)
        self.vtBoxSizer.Add(self.staticText  ,0,wx.EXPAND|wx.ALL,5)
        self.mainPanel.SetSizer(self.vtBoxSizer)
        self.Bind(wx.EVT_BUTTON          ,self.OnExpandButton,self.expandButton)
        self.Bind(wx.EVT_TREE_SEL_CHANGED,self.OnNodeSelected,self.tree)
    def OnExpandButton(self,e):
        self.tree.ExpandAll()
    def OnNodeSelected(self,e):
        selected=self.tree.GetSelection()
        self.staticText.SetLabel(self.tree.GetItemText(selected))
        #self.
        self.mainPanel.Layout()
if __name__=='__main__':
    app=wx.App()
    frame=MyFrame()
    frame.Show()
    app.MainLoop()
#___________________________________________________