매출전표_문제={
    "신용카드매출전표상에 공급가액만 표기되고 부가가치세가 별도로 표기되지 않는 경우, 매입세액공제가 가능한가? ":{},
    "개인사업자는 사업용 신용카드를 반드시 등록하라":{},
    "신용카드매출전표를 받아도 매입세액불공제 사업자 ":{},
    "신용카드매출전표를 받아도 매입세액불공제 거래":{},
    "신용카드매출전표를 분실한 경우 월이용대금명세서 제출":{},
    "과세기간 이후에 교부받은 신용카드매출전표 등의 매입세액공제":{},
    "후불교통카드로 통행료를 결제하는 경우 매입세액공제":{},
    "신용카드업자로부터 거래내역을 전송받는 경우 매입세액공제":{},
    "타인 명의 신용카드매출전표 매입세액 공제불가":{},
    "전자상거래 매입관련 신용카드 결제 분 매입세액공제":{},
    "복리후생목적의 소비 및 사무용품의 구입 시 신용카드매 출전표를 발급받은 경우 매입세액공제":{},
    "종업원 카드로 사용한 신용카드의 매입세액공제":{},
    "가족명의 신용카드 등의 사용 시 매입세액공제":{},
}


