# -*- coding: utf-8 -*-
#Created on 2018-11-5 @author: 권달현
양도소득세={
    '양도소득세 계산흐름':{
        '양도소득세 계산구조':{},
        '양도소득금액의 구분계산':{},
        '양도차손의 통산방법':{}
    },
    '양도차익의 산정방법':{
        '양도가액 및 취득가액 적용방법':{},
        '실지거래가액':{},
        '매매사례가액':{},
        '감정가액':{},
        '환산취득가액(환산한 취득가액)':{},
        '의제취득일 전에 취득한 자산의 취득가액 계산 특례':{},
        '토지 건물 등을 함께 거래하는 경우':{},
        '실지거래가액을 허위기재 신고한 경우':{}
    },
    '특수한 경우의 양도차익 산정':{
        '부담부 증여':{},
        '1세대1주택인 고가주택':{},
        '환지예정지 등':{},
        '재개발 재건축 입주권':{},
        '재개발 재건축 아파트 실가 계산':{},
        '양도소득의 부당행위계산':{},
        '상속 증여받은 자산에 대한 취득가액 의제': {},
        '부동산 등에 대한 취득가액(실지거래가액)의제': {},
        '가업상속공제를 적용받은 자산에대한 이월과세': {},
        '배우자 등으로 부터 증여받은 자산에 대한 이월과세': {},
    },
    '양도가액의 계산':{
        '양도가액의 의의':{},
        '양도가액의 계산':{},
        '양도가액의 범위':{},
        '특수한 경우의 양도가액':{}
    },
    '양도소득 과세표준의 계산': {
        '다른 소득과 구분계산':{},
        '양도소득금액 계산':{},
        '양도소득 과세표준 계산':{},
    },
    '양도소득세액 계산의 순서': {
        '양도소득세 산출세액의 계산':{},
        '양도소득세 결정세액의 계산': {},
        '양도소득세 총결정세액의 계산': {},
        '차감납부할 세액': {},
    },
    '양도차익의 산정': {
        '양도차익의 산정 원칙':{},
        '토지와 건물 등을 함께 양도한 경우의 안분계산': {},
        '양도소득금액의 구분 계산 및 결손금 통산 등': {},
        '교환하는 경우': {},
        '양도가액 포함 여부': {},
        '실지거래가액의 의미': {},
        '장부가액 인정 여부': {},
        '토지와 건물을 일괄양도한 경우': {},
        '임지와 임목을 함께 양도한 경우': {},
        '지하수 개발,이용권 등과 토지 등을 함께 양도한 경우': {},
        '토지와 지장물 등을 함께 양도한 경우': {},
        '부동산을 취득할 수 있는 권리의 양도': {},
        '주택청약예금통장의 양도': {},
        '실지거래가액의 결정 사례': {},
        '토지가래허가지역에서 양도한 경우': {},
        '': {},
    },
    '양도가액의 산정': {
        '실지거래가액의 결정 등': {},
    },
    '고가,저가 양도 및 취득시의 가액 의제': {
        '고가양도시 의제양도가액(시가를 양도실가로 보는 경우)': {},
        '저가양수시 의제취득가액(이중과세 조정)': {},
    },
    '부담부증여': {
        '양도차익 산정': {},
        '부담부증여시 유상대가로 보는 채무액의 안분': {},
        '고가주택을 부담부증여한 경우': {},
        '부담부증여시 중과세율 적용 여부': {},
    },
    '상속 또는 증여받은 자산의 취득가액 의제': {
        '취득가액 의제': {},
        '일방 실가(환산취득가) 적용여부': {},
        '상증법상 평가가액': {},
        '피상속인이 취득한 가액을 시가로 보는 경우': {},
        '증여자의 취득가액을 시가로 보는 경우': {},
        '소급감정한 겨우': {},
        '상속세 등이 부과된 토지 등을 물납한 경우': {},
        '상속등기후 신고기한내 협의분할한 경우의 증여세 과세 여부': {},
        '피상속인이 부동산매매계약을 체결하고 잔금을 청산하기 전에 사망한 경우': {},
    },
    '고가주택의 양도차익': {
        '양도차익 등의 계산': {},
        '토지,건물 보유기간이 다른 경우': {},
        '기준면적(5배)을 초과하는 1세대1주택의 고가주택인 경우': {},
        '고가주택의 수용시 보상금 지급시기가 다른 경우': {},
        '겸용주택': {},
        '지분으로 양도한 경우': {},
        '지분 소유 고가주택을 전부 양도한 경우': {},
        '고가주택을 국외이주후 양도한 경우': {},
        '1세대1주택 고가주택이면서 감면대상 주택인 경우': {},
        '재건축아파트 입주권': {},
        '고가주택의 양도차손': {},
        '': {},
    },
    '실가추정 및 추계결정': {
        '무신고한 자의 실가 추정': {},
        '허위계약서 등 확인된 실가 경정': {},
        '추계조사결정': {},
        '추계경정사유': {},
        '환산한 취득가액': {},
        '추계산정방법': {},
    },
    '의제취득가액의 산정': {
        '전소유자의 양도가액을 현소유자의 취득가액으로 의제': {},
        '의제취득일 전에 취득한 경우': {},
        '의제취득일 전에 취득한 자산의 취득당시 실지거래가액': {},
    },
    '양도소득의 부당행위계산 및 양도의제 등': {
        '부당행위계산': {},
        '특수관계인이 개입된 증여시의 양도의제': {},
        '배우자 등에게 양도한 재산의 증여추정': {},
    },
    '배우자 또는 직계존비속의 증여자산에 대한 이월과세': {
        '이월과세 적용대상': {},
        '이월과세 적용배제': {},
        '보유기간 계산 등': {},
        '가업상속공제자산의 이월과세': {},
        '필요경비로 산입되는 증여세 상당액 계산 등': {},
        '배우자 증여자산에 대한 이월과세 사례': {},
        '부당행위계산(양도의제)과 배우자 또는 직계존비속의 이월과세 비교': {},
        '증여재산으로 보는 자산 양도시 이중과세 조정': {},
    },
    '재개발,재건축 입주권의 양도차익의 산정': {
        '양도차익의 산정': {},
        '상속,증여로 취득한 경우': {},
    },
    '재개발,재건축아파트 기준시가에 의한 경우': {
        '양도차익의 산정': {},
    },
    '재개발,재건축 준공 후의 양도차익 산정': {
        '양도차익의 산정': {},
        '환지처분의 정의': {},
        '조합원입주권 승계취득한 경우의 보유기간 기산일': {},
        '양도일에 청산금이 확정되지 아니한 경우': {},
        '재개발,재건축사업의 양도차익 산정시 인가일 전후 통산 여부': {},
    },
    '직잡(지역)조합주택의 양도차익 산정': {
        '양도차익의 산정': {},
    },
    '환지예정지 등의 양도차익 산정': {
        '환지예정지 등의 양도': {},
        '환지청산금 수령한 경우': {},
        '양도일 현재 환지확정이 되지 아니한 경우의 취득실가 안분': {},
        '소유자가 상이한 연접필지가 공동소유 환지예정지로 지정된 경우의 각 소유자별 토지면적 계산': {},
        '환지청산금과 환지징수금이 발생된 경우 각 필지별로 각각 양도차익 산정': {},
        '1필지의 토지가 환지처분후 4필지로 분할되어 청산금징수 및 교부가 동시에 발생된 경우 종전의 토지면적 계산방법': {},
    },
    '주식의 양도차익': {
        '결정원칙(쌍방 실가)': {},
        '취득가액 불분명한 경우(일방 실가)': {},
        '필요경비 공제방법': {},
        '주식거래 내역 등의 금융조회': {},
        '대주주의 주식거래내역 기장방법 및 불성실 가산세': {},
        '취득가액의 산정 사례': {},
        '양도가액 등의 산정 사례': {},
        '법인이 자기주식을 취득하는 경우': {},
    },
    '기타자산의 양도차익': {
        '': {},
    },
    '파생상품의 양도차익':{
        '파생상품의 양도차익 계산방법':{},
        '코스피200선물': {},
        '코스피200옵션': {},
        '유사한 파생상품': {},
        '파생결합증권': {},
        '선입선출': {},
        '파생상품의 거래 또는 행위로부터의 소득계산': {},
    },
}

제목='양도차익'
_={
    #"기업회계":기업회계,
    #"법인세":법인세,
    #"조세특례제한법":조세특례제한법,
    #"증여세":증여세,
    "양도소득세":양도소득세,
    #"농어촌특별세":{},
}
tax=_
import wx
class MyFrame(wx.Frame):
    def __init__(self):
        wx.Frame.__init__(self,parent=None,title=제목)
        self.SetSize(420,320*2)
        self.mainPanel=wx.Panel(self)
        self.expandButton=wx.Button(self.mainPanel,label='펼침')
        self.tree=wx.TreeCtrl(self.mainPanel)
        root=self.tree.AddRoot(제목)
        for i in tax:
            ii=self.tree.AppendItem(root,i)
            for j in tax[i]:
                jj=self.tree.AppendItem(ii,j)
                for k in tax[i][j]:
                    kk=self.tree.AppendItem(jj,k)
                    for m in tax[i][j][k]:
                        mm=self.tree.AppendItem(kk,m)
                        for n in tax[i][j][k][m]:
                            nn=self.tree.AppendItem(mm,n)
                            for p in tax[i][j][k][m][n]:
                                pp=self.tree.AppendItem(nn,p)
                                for q in tax[i][j][k][m][n][p]:
                                    qq=self.tree.AppendItem(pp,q)
                                    for r in tax[i][j][k][m][n][p][q]:
                                        rr=self.tree.AppendItem(qq,r)

        self.staticText =wx.TextCtrl(self.mainPanel,style=wx.TE_MULTILINE)


        self.vtBoxSizer=wx.BoxSizer(wx.VERTICAL)
        self.vtBoxSizer.Add(self.expandButton,0,wx.EXPAND|wx.ALL,5)
        self.vtBoxSizer.Add(self.tree        ,5,wx.EXPAND|wx.ALL,5)
        self.vtBoxSizer.Add(self.staticText  ,0,wx.EXPAND|wx.ALL,5)


        self.mainPanel.SetSizer(self.vtBoxSizer)

        self.Bind(wx.EVT_BUTTON          ,self.OnExpandButton,self.expandButton)
        self.Bind(wx.EVT_TREE_SEL_CHANGED,self.OnNodeSelected,self.tree)
    def OnExpandButton(self,e):
        self.tree.ExpandAll()
    def OnNodeSelected(self,e):
        selected=self.tree.GetSelection()
        self.staticText.SetLabel(self.tree.GetItemText(selected))

        self.mainPanel.Layout()
if __name__=='__main__':
    app=wx.App()
    frame=MyFrame()
    frame.Show()
    app.MainLoop()