# -*- coding: utf-8 -*-
#Created on 2018-12-24 @author: 권달현
법인세={
        '업무용승용차 및 관련비용의 범위':{},
        '업무용승용차 관련비용의 손금불산입':{},
        '업무용승용차 감가상각비(상당액)':{},
        '업무용승용차 관련비용의 손금불산입 금액 계산':{},
        '업무용승용차 매각손실 손금불산입':{},
        '기타사항':{},
        '업무용승용차 관련비용 세무조정 사례':{},
        "업무용승용차 관련비용의 손금불산입 등 특례 ": {

                "(1) 업무용승용차 및 관련비용의 범위": {

                    "① 업무용승용차 ": {

                        "  「개별소비세법」제1조 제2항 제3호에 해당하는 승용자동차(법법§27의2)": {},
                        "  제외되는 승용자동차 - 「부가가치세법 시행령」제19조 각 호에 해당하는 업종 또는 「여신전문금융업법」 제2조 제9호에 따른 시설대여업에서 사업상 수익을 얻기 위하여 직접 사용하는 승용자동차 - 「통계법」제22조에 따라 작성된 한국표준산업분류표 중 장례식장 및 장의관련 서비스업을 영위하는 법인 및 사업자가 소유하거나 임차한 운구용 승용차 ": {},

                    },
                    "② 업무용승용차 관련비용 ": {

                        "  업무용승용차에 대한 감가상각비, 임차료, 유류비, 보험료, 수선비, 자동차세, 통행료및 금융리스부채에 대한 이자비용 등 업무용승용차의 취득 유지를 위하여 지출한 비용(법령§50의2②) ": {},

                    },
                    "③ 업무전용자동차보험(상품명：임직원운전자 한정운전 특약) ": {

                        "  해당 사업연도 전체 기간(임차한 승용차의 경우 해당 사업연도 중에 임차한 기간을 말함)동안 해당 법인의 임원 또는 사용인이 직접 운전한 경우 또는 계약에 따라 타인이 해당 법인의 업무를 위하여 운전하는 경우만 보상하는 자동차보험(법령§50의2④)": {},
                        "  2016.4.1. 이후 기존에 가입했던 자동차 보험의 만기시 업무전용자동차보험으로 갱신하면, ’16.1.1.에 가입한 것으로 보고, ’16.4.1. 이전 업무용승용차를 처분하거나 임차계약이 종료된 경우에는 ’16.1.1.부터 가입한 것으로 봄(법인세법 부칙 제14조, 제26981호) ": {},

                        "  일부 기간만 업무전용자동차보험 가입시 손금산입 방법 - 해당 사업연도의 업무용승용차 관련비용 × 업무사용비율 × (해당 사업연도에 실제로 업무전용자동차보험에 가입한 일수 ÷ 해당 사업연도에 업무전용 자동차 보험에 의무적으로 가입하여야 할 일수)": {},
                        "  업무전용자동차보험 가입 간주 - 시설대여업자 외의 자동차대여사업자로부터 임차한 승용차로서 임차계약기간이 30일 이내인 경우(해당 사업연도에 임차계약기간의 합이 30일을 초과하는 경우는 제외) 아래에 해당하는 사람을 운전자로 한정하는 임대차 특약을 체결한 경우에는 업무전용자동차보험에 가입한 것으로 봄  해당 법인의 임원 또는 사용인  계약에 따라 해당 법인의 업무를 위하여 운전하는 사람 ": {},

                    },
                },
                "(2) 업무용승용차 관련비용의 손금불산입": {

                    "① 손금인정요건 ": {
                        "  업무전용자동차보험을 가입하고 운행기록부 상 확인되는 업무사용 비율 만큼 인정(원칙) ": {},
                    },
                    "② 손금인정액 ": {

                        "  업무용승용차 관련비용의 일정금액[1천만원(500만원)] * 을 인정하되, 업무용 승용차 운행기록 등을 작성시 업무사용비율만큼 추가 인정": {},
                        "  운행기록 등을 작성하지 않은 경우 대당 1천만원(500만원) * 한도내에서 업무용승용차 관련비용 인정 ": {},
                        "* 부동산 임대업을 주업으로 하는 법인 등(법령§39③)의 내국법인의 경우에는 500만원으로 함 * 취득(보유) 기간에 따라 월할계산：1천만원(500만원) × (보유월수÷사업연도 월수) * 해당 사업연도가 1년 미만인 경우 1천만원(500만원)에 해당 사업연도의 월수를 곱하고 이를 12로 나누어 산출한 금액을 말함 ": {},

                    },
                    "③ 업무사용비율 ": {

                        "  업무용 사용거리란 제조 판매시설 등 해당 법인의 사업장 방문, 거래처  대리점 방문, 회의 참석, 판촉 활동, 출 퇴근 등 직무와 관련된 업무수행을 위하여 주행한 거리를 의미함": {},
                        "  업무사용비율은 법인세법시행규칙으로 정하는 운행기록 등에 따라 확인되는 총주행거리 중 업무용 사용거리가 차지하는 비율을 뜻함 ": {},
                    },
                    "④ 업무용승용차 운행기록부 ": {

                        "  업무용승용차별로 운행기록 등을 작성 비치하여야 하며, 납세지 관할 세무서장이 요구할 경우 이를 즉시 제출하여야 함(법령§50의2⑥) ": {},
                    },
                },
                "(3) 업무용승용차 감가상각비(상당액)": {

                    "① 감가상각 ": {

                        "  2016.1.1.이후 개시하는 사업연도에 취득하는 업무용승용차는 법인세법 시행령 제26조 제1항 제2호 및 법인세법시행령 제28조 제1항 제2호에 불구하고 정액법을 상각방법으로 하고 내용연수를 5년으로 하여 계산한 금액을 강제상각 ": {},

                    },
                    "② 감가상각비상당액 ": {

                        "  리스차량은 리스료 중 보험료 자동차세 수선유지비를 차감한 잔액을 감가상각비 상당액으로 하되, 수선유지비를 구분하기 어려운 경우에는 리스료(보험료와 자동차세 제외금액)의 7%로 계산": {},
                        "  렌트차량은 렌트료의 70%를 감가상각비 상당액으로 함 ": {},
                    },
                    "③ 감가상각비(상당액) 손금산입 한도 ": {

                        "  업무용승용차별 감가상각비(상당액) 한도액은 해당 사업연도에 800만원 (400만원) * 을한도로 함 ": {},

                        "* 부동산 임대업을 주업으로 하는 법인 등(법령§39③)의 내국법인의 경우에는 400만원으로 함 * 취득(보유) 기간에 따라 월할계산：800만원(400만원) × (보유월수÷사업연도 월수) * 해당 사업연도가 1년 미만인 경우 800만원(400만원)에 해당 사업연도의 월수를 곱하고 이를 12로 나누어 산출한 금액을 말함 ": {},
                        "  해당 사업연도의 다음 사업연도부터 800만원(400만원)을 균등하게 손금에 산입하되, 해당 업무용승용차의 업무사용금액 중 감가상각비가 800만원 (400만원)에 미달하는 경우 그 미달하는 금액을 한도로 하여 손금으로 추인": {},
                        "- 임차한 경우 등은 해당 사업연도의 다음 사업연도부터 해당 업무용승용차의 업무사용금액 중 감가상각비 상당액이 800만원(400만원)에 미달하는 경우 그미달하는 금액을 한도로 손금에 산입. 다만, 임차를 종료한 날부터 10년이 경과한 날이 속하는 사업연도(과세기간)에는 남은 금액을 모두 손금에 산입 ": {},

                    },
                },
                "(4) 업무용승용차 관련비용의 손금불산입 금액 계산": {

                    "① 업무사용금액 계산방법 ": {

                        "  업무전용자동차보험을 가입하고 운행기록부를 작성한 경우 ：업무용승용차 관련비용 × 운행기록상 업무사용비율": {},
                        "  업무전용자동차보험을 가입하고 운행기록부를 작성하지 아니한 경우 ：업무용승용차 관련비용에 아래 비율을 곱한 금액 - 해당 사업연도의 업무용승용차 관련비용이 1천만원(500만원) * 이하인 경우：": {},
                        "100분의 100": {},
                        "- 해당 사업연도의 업무용승용차 관련비용이 1천만원(500만원)을 초과하는 경우 1천만원(500만원)을 업무용승용차 관련비용으로 나눈 비율 ": {},
                        "* 부동산 임대업을 주업으로 하는 법인 등(법령§39③)의 내국법인의 경우에는 500만원으로 함 * 취득(보유) 기간에 따라 월할계산：1천만원(500만원) × (보유월수÷사업연도 월수) * 해당 사업연도가 1년 미만인 경우 1천만원(500만원)에 해당 사업연도의 월수를 곱하고 이를 12로 나누어 산출한 금액을 말함 ": {},
                        "  업무전용자동차보험을 가입하지 않은 경우：업무사용금액 없음 ": {},

                        "* 다만, 업무전용자동차보험에 가입하지 아니한 승용차의 업무사용비율에 대하여 기획재정부 장관이 정하여 고시하는 조사 확인 방법에 따라 별도로 확인을 받은 경우에는 그 확인된 업무사용비율에 업무용승용차 관련비용을 곱한 금액으로 함 ": {},

                    },
                    "② 손금불산입액의 계산 ": {
                        "업무용승용차 관련비용 - 업무사용금액 ": {},
                    },
                    "③ 손금불산입액의 소득처분 ": {

                        "  업무외 사용금액은 사용자에게 소득 처분함   업무용 사용금액 중 감가상각비 한도[800만원(400만원)] * 초과액은 유보 처분함 - 단 감가상각비상당액 한도초과의 경우 기타사외유출 처분(법령§106①3다) ": {},
                        "* 부동산 임대업을 주업으로 하는 법인 등(법령§39③)의 내국법인의 경우에는 400만원으로 함": {},
                        "* 취득(보유) 기간에 따라 월할계산：800만원(400만원) × (보유월수÷사업연도 월수) * 해당 사업연도가 1년 미만인 경우 800만원(400만원)에 해당 사업연도의 월수를 곱하고 이를 12로 나누어 산출한 금액을 말함 ": {},
                        "  업무용승용차 처분손실은 기타사외유출 처분함(법령§106①3다) ": {},
                    },
                },
                "(5) 업무용승용차 매각손실 손금불산입": {

                    "① 업무용승용차 매각손실 처리방법 ": {

                        "  업무용승용차를 처분하여 발생하는 손실로서 업무용승용차별로 800만원 (400만원) * 을 초과하는 금액은 해당 사업연도의 다음 사업연도부터 800만원 (400만원)을 균등하게 손금에 산입하고 ": {},
                        "* 부동산 임대업을 주업으로 하는 법인 등(법령§39③)의 내국법인의 경우에는 400만원으로 함 * 해당 사업연도가 1년 미만인 경우 800만원(400만원)에 해당 사업연도의 월수를 곱하고 이를 12로 나누어 산출한 금액을 말함 ": {},

                        "  남은 금액이 800만원(400만원) 미만인 사업연도 또는 해당 업무용승용차를 처분한 날부터 10년이 경과한 날이 속하는 사업연도에 남은 금액을 모두 손금에 산입함 ": {},

                    },
                    "② 해산에 따른 매각손실 등 처리방법 ": {

                        "내국법인이 해산(합병 분할 또는 분할합병에 따른 해산 포함)한 경우에는 감가상각 비상당액, 매각손실에 따른 이월된 금액 중 남은 금액을 해산등기일 (합병 분할 또는 분할합병에 따라 해산한 경우에는 합병등기일 또는 분할등기일을 말함)이 속하는 사업연도에 모두 손금에 산입함 ": {},

                    },
                },
                "(6) 기타사항": {

                    "① 관련서류 작성 보관 제출 ": {

                        "  업무용승용차 관련비용 또는 처분손실을 손금에 산입한 법인은 「법인세법」 제60조에 따른 신고 시 업무용승용차 관련비용 명세서를 첨부하여 납세지 관할 세무서장에게 제출하여야 하고,": {},
                        "- 업무용승용차 운행기록부를 작성하고 과세관청의 요청시 운행기록부와 관련된 증명서류로 업무사용목적을 소명하여야 함 ": {},

                    },
                    "② 적용시기 ": {

                        "  ’16.1.1. 이후 개시하는 사업연도에 지출ㆍ발생하는 분부터 적용 - 업무사용비율은 ’16.4.1. 이후 적용. 다만, 감가상각 의무화는 ’16.1.1. 이후 개시하는 사업연도에 신규 취득하는 승용차부터 적용 ": {},

                    },
                },
                "(7) 업무용승용차 관련비용 세무조정 사례": {

                    "① 차량운행기록부 작성, 차량관련 비용이 1천만원을 초과하는 경우 ": {

                        "  A법인 * (12월말 법인)이 ’17.1.10. 2억원의 승용차를 구입한 후, 임원이 ’17년 업무전용자동차보험에 가입하고 차량 운행기록부를 작성하고 ": {},
                        "* 부동산 임대업을 주업으로 하는 법인 등(법령§39③)의 내국법인에 해당하지 않음 ": {},
                        "- ’17년 운행기록부 내역 중 업무용사용비율 70%, 대표자 사적 사용분 30%로 확인된 경우 ": {},

                        "- 해당연도 차량관련비용 자동차보험료 2,000,000원, 유류비 16,000,000원, 자동차세 2,000,000원을 계상하였고, 감가상각비 * 는 미계상 하였으나 총 차량관련 비용은 60,000,000원임 ": {},
                        "* 200,000,000원 ÷ 5년 = 40,000,000원 ": {},
                        "  (세무조정) 차량운행기록부를 작성한 경우, 업무용승용차 관련비용 중 업무사용비율 만큼 손금 인정(감가상각비 8백만원 한도) ": {},
                        "차량유지 비용 세무조정 ": {},
                        "- 차량 관련 유지비 사적 사용액 6,000,000원 * , 손금불산입(상여) * 차량유지비용 (20,000,000원) × 사적사용 (30%) = 6,000,000원 ": {},
                        "감가상각비 세무조정 ": {},
                        " 감가상각비 미계상 세무조정：40,000,000원 * 손금산입(유보) * 200,000,000원 ÷ 5년 = 40,000,000원 ": {},
                        " 차량 감가상각비 사적 사용액 12,000,000원 * , 손금불산입(상여) * 감가상각비 (40,000,000원) × 사적사용 (30%) = 12,000,000원 ": {},
                        " 업무용 감가상각비 한도초과액 20,000,000 * 원, 손금불산입(유보 ** ) * 【감가상각비 (40,000,000)×70%】 - Min【(40,000,000원×70%), 상각한도 (8,000,000)】 ** 한도 초과분은 누적잔액이 800만원 미만인 사업연도까지 이월 공제 ": {},

                    },
                    "② 차량운행기록부 미작성, 차량관련 비용이 1천만원을 초과하지 않는 경우 ": {

                        "  B법인 * (12월말 법인)이 ’17.1.10. 2천만원 승용차를 구입한 후, 임원이 ’17년 업무전용자동차 보험에 가입하고 차량 운행기록부를 미작성, 해당연도 차량관련비용 자동차보험료 500,000원, 유류비 2,000,000원, 자동차세 500,000원, 감가상각비 4,000,000 ** 원 계상하여 총 차량관련 비용은 7,000,000원임 ": {},
                        "* 부동산 임대업을 주업으로 하는 법인 등(법령§39③)의 내국법인에 해당하지 않음 ** 20,000,000원 ÷ 5년 = 4,000,000원 ": {},
                        "  (세무조정) 회사가 계상한 차량관련 유지비용 7,000,000원 * 은 총 인정비용 1천만원(감가상각비 한도 8백만원) 한도내이므로 세무조정 없이 전액 인정 ": {},
                        "* 500,000원 + 2,000,000원 + 500,000원 + 4,000,000원 = 7,000,000원 ": {},
                    },
                    "③ 차량운행기록부 미작성, 차량관련 비용이 1천만원을 초과하는 경우 ": {

                        "  C법인 * (12월말 법인)이 ’17.1.10. 2억원의 승용차를 구입한 후, 임원이 '17년 업무전용자동차 보험에 가입하고 차량 운행기록부를 미작성, 해당연도 차량관련비용 자동차보험료 2,000,000원, 유류비 16,000,000원, 자동차세 2,000,000원을 계상하였고, 감가상각비 ** 는 미계상한 경우 ": {},
                        "* 부동산 임대업을 주업으로 하는 법인 등(법령§39③)의 내국법인에 해당하지 않음 ** 200,000,000원 ÷ 5년 = 40,000,000원 ": {},
                        "  (세무조정) 1천만원 한도내에서 손금인정하므로 차량관련비용이 1천만원을 초과하는 경우 차량유지비와 감가상각비용을 안분계산하여 초과분 세무조정 ": {},
                        "차량유지비 세무조정 ": {},
                        " 간주업무사용비율：16.7% * ": {},
                        "* 1천만원(10,000,000) / 총비용(60,000,000) ": {},
                        " 차량관련 유지비 손금 부인액 16,666,667원 * 손금불산입(상여) * 총 유지비(20,000,000) -[총 유지비(20,000,000)× 간주업무사용비율(16.7%)] ": {},
                        "감가상각비 세무조정 ": {},
                        " 감가상각비 회사 미계상 세무조정 40,000,000원 손금산입(유보)": {},
                        " 차량 감가상각비 사적 사용액 33,333,334원 * , 손금불산입(상여) * 감가상각비 (40,000,000원) - [감가상각비(40,000,000) × 간주업무사용비율(16.7%)] ": {},
                        " 업무용 감가상각비는 감가상각비 한도액(800만원) 이내로 세무조정 없음 * [감가상각비(40,000,000) × 간주업무사용비율(16.7%)] = 6,666,666원 ": {},
                    },
                },
                "참고：예규 ": {

                    " 업무용승용차 범위 및 손금인정 방법 ": {},
                    "「법인세법」 제27조의2를 적용받는 내국법인의 승용자동차는 「부가가치세법시행령」 제19조 각 호에 해당하는 업종, 「여신전문금융업법」 제2조 제9호에 따른 시설대여업, 한국표준산업 분류표 중 장례식장 및 장의관련 서비스업을 영위하는 법인이 사업상 수익을 얻기 위하여 직접 사용하는 승용자동차를 제외한 「개별소비세법」 제1조제2항 제3호에 해당하는 승용자동차를 말하는 것임": {},
                    "또한, 해당 사업연도 전체 기간(임차한 승용차의 경우 해당 사업연도 중에 임차한 기간을 말함)동안 해당 법인의 임원 또는 사용인이 직접 운전한 경우 또는 계약에 따라 타인이 해당 법인의 업무를 위하여 운전하는 경우만 보상하는 자동차보험(업무전용자동차보험)에 가입하지 아니한 경우에는 「법인세법 시행령」 제50조의2 제4항 제2호를 적용하여 해당 사업연도의 소득금액을 계산하는 것임(법인세과-1819, 2016.07.12) ": {},
                    " 업무용승용차의 접대관련 운행이 업무용사용거리에 해당하는지 여부 ": {},
                    "「법인세법」제27조의2【업무용승용차 관련비용의 손금불산입 등 특례】를 적용함에 있어 내국법인이 취득 임차한 업무용승용차를 직무와 관련된 업무수행에 사용한 경우 동주행거리는 같은 법 시행규칙 제27조의2제4항에 따른 업무용 사용거리에 해당하는 것임(법령해석과-2338, 2016.07.18) ": {},
                    " 업무용승용차 관련비용의 범위 ": {},
                    "내국법인이 외부업체로부터 업무용승용차의 운전기사를 제공받고 지급하는 용역대가는  법인세법 시행령  제50조의2 제2항에 따른 “업무용승용차 관련 비용”에 포함되지 않는 것임(사전-2016-법령해석법인-0539, 2016.11.21) ": {},
                    " 업무용승용차 관련비용의 손금불산입 특례 적용 여부 ": {},
                    "내국법인이 국외 사업장에서 보유 운영하고 있는 승용차는 「법인세법」 제27조의2 규정이 적용되지 않는 것임": {},
                    "차량정비업을 영위하는 내국법인이 차량수리 고객에게 수리기간 동안 빌려주는 임차차량은 「법인세법」 제27조의2 규정이 적용되는 것임": {},
                    "차량운행과 관련한 위탁용역을 체결한 위탁법인이 수탁법인에 지급하는 차량운행 업무위탁 대가는 「법인세법」 제27조의2 규정이 적용는 것이며, 수탁법인이 차량운행 위탁용역과 관련하여 지출하는 비용(차량리스료, 유류대, 통행료 등)은 「법인세법」 제27조의2 규정이 적용되지 아니하는 것임 ": {},

                    "법인이 자동차대여사업자와 일정기간 대여계약을 체결하고 임직원전용보험에 가입한 임차한 차량을 운행하였으나 사업연도 중간에 계약이 해지된 경우 업무용으로 사용한 기간 동안의 차량임차료 중 운행기록 등 증명서류에 의해 업무에 사용한 것으로 입증되는 금액은 손금으로 하는 것임": {},
                    "업무용승용차 사적 사용자가 사업연도 중간에 퇴직하는 경우 해당 퇴직자에 대한 소득처분 금액은 해당 사업연도 개시일부터 퇴직시까지 발생한 업무용승용차 관련비용에동 기간의 사적사용비율(해당 퇴직자의 사적사용거리 ÷ 총주행거리)을 곱하여 산출한 금액으로 하는 것임(기획재정부 법인세제과-320, 2017.3.6) ": {},
                    " 제3자명의 임직원전용보험 가입 시 업무전용자동차보험에 가입의제 여부 ": {},
                    "내국법인이 업무용승용차를 리스계약으로 이용하면서 해당 내국법인이 아닌 제3자를 계약자로 하여 자동차보험에 가입한 경우에는 「법인세법시행령」 제50조의2제4항 제1호에서 규정하는 업무전용자동차보험에 가입한 경우에 해당하지 않는 것임(서면-2017": {},
                    "-법령해석법인-1401, 2017.9.26) ": {},
                    " 임원명의로 보험 가입 시 업무전용자동차보험 가입의제 여부 ": {},
                    "내국법인이 업무용승용차를 법인과 임원의 공동명의로 취득하고 임원을 보험의 계약자및 피보험자로 하여 자동차보험에 가입한 경우에는 「법인세법시행령」 제50조의2제4항 제1호에서 규정하는 업무전용자동차보험에 가입한 경우에 해당하지 않는 것임(서면 -2016-법령해석법인-5680, 2017.6.28) ": {},

                },
                "국세청고시 제2016-12호(2016. 4. 1.) ": {

                    "업무용승용차 운행기록 방법에 관한 고시 ": {},
                    "「법인세법」제27조의2제2항, 같은 법 시행령 제50조의2제5항, 같은 법 시행규칙 제27조의2 제2항의 위임에 따라 업무용승용차 운행기록 방법을 다음과 같이 제정하여 고시합니다.": {},
                    "2016년 4월 1일 국 세 청 장 ": {},
                    "제1조(목적) 이 고시는 「법인세법」 제27조의2제2항, 같은 법 시행령 제50조의2제5항, 같은 법시행규칙 제27조의2제2항에서 국세청장에게 위임한 업무용승용차 운행기록 방법을 정함을 목적으로 한다. ": {},
                    "제2조(운행기록 방법 및 서식) 업무용승용차 운행기록 방법은 별지 서식 「업무용승용차 운행기록부」를 작성하는 것으로 하되, 별지 서식상의 차종, 자동차등록번호, 사용일자, 사용자, 운행내역이 포함된 별도의 서식으로 작성할 수 있다. ": {},
                    "제3조(업무목적 소명) 법인은 과세관청의 요청시 업무용승용차 관리 규정,출장명령서 등을 통하여 업무목적을 소명하여야 한다. ": {},
                    "제4조(재검토 기한) 「훈령ㆍ예규 등의 발령 및 관리에 관한 규정」(대통령 훈령 제334호)에 따라이 고시 발령 후의 법령이나 현실여건의 변화 등을 검토하여 이 고시의 폐지, 개정 등의 조치를 하여야 하는 기한은 2019년 3월 31일까지로 한다. ": {},
                    "※ 부칙(2016. 4. 1. 국세청 고시 제2016-12호) ": {},
                    "제1조(시행일) 이 고시는 고시한 날부터 시행한다. ": {},
                    "제2조(적용례) 이 고시는 고시한 날 이후 발생하는 업무용승용차 취득  유지함으로써 생기는 비용분부터 적용한다. ": {},
                    "제3조(경과규정) 이 고시 시행 전 ’16.1.1.∼’16.3.31.까지 업무용승용차를 운행한 기록에 대하여는 관련 증빙서류를 보관하고, 「업무용승용차 운행기록부」를 작성할 수 있다. ": {},

                },
            },
}


#___________________________________________________
제목='업무용승용차 및 관련비용'
_={
    #"지방소득세_법인세분 가산세": 지방소득세_법인세분,
    #"기업회계":기업회계,
    "법인세":법인세,
    #"조세특례제한법":조세특례제한법,
    #"증여세":증여세,
    #"상속세":상속세,
    #"양도소득세":양도소득세,
    #"농어촌특별세":{},
}
tax=_
import wx
class MyFrame(wx.Frame):
    def __init__(self):
        wx.Frame.__init__(self,parent=None,title=제목)
        self.SetSize(420,320*2)
        self.mainPanel=wx.Panel(self)
        self.expandButton=wx.Button(self.mainPanel,label='펼침')
        self.tree=wx.TreeCtrl(self.mainPanel)
        root=self.tree.AddRoot(제목)
        for i in tax:
            ii=self.tree.AppendItem(root,i)
            for j in tax[i]:
                jj=self.tree.AppendItem(ii,j)
                for k in tax[i][j]:
                    kk=self.tree.AppendItem(jj,k)
                    for m in tax[i][j][k]:
                        mm=self.tree.AppendItem(kk,m)
                        for n in tax[i][j][k][m]:
                            nn=self.tree.AppendItem(mm,n)
                            for p in tax[i][j][k][m][n]:
                                pp=self.tree.AppendItem(nn,p)
                                for q in tax[i][j][k][m][n][p]:
                                    qq=self.tree.AppendItem(pp,q)
                                    for r in tax[i][j][k][m][n][p][q]:
                                        rr=self.tree.AppendItem(qq,r)
        self.staticText =wx.TextCtrl(self.mainPanel,style=wx.TE_MULTILINE)

        self.vtBoxSizer=wx.BoxSizer(wx.VERTICAL)
        self.vtBoxSizer.Add(self.expandButton,0,wx.EXPAND|wx.ALL,5)
        self.vtBoxSizer.Add(self.tree        ,5,wx.EXPAND|wx.ALL,5)
        self.vtBoxSizer.Add(self.staticText  ,0,wx.EXPAND|wx.ALL,5)
        self.mainPanel.SetSizer(self.vtBoxSizer)
        self.Bind(wx.EVT_BUTTON          ,self.OnExpandButton,self.expandButton)
        self.Bind(wx.EVT_TREE_SEL_CHANGED,self.OnNodeSelected,self.tree)
    def OnExpandButton(self,e):
        self.tree.ExpandAll()
    def OnNodeSelected(self,e):
        selected=self.tree.GetSelection()
        self.staticText.SetLabel(self.tree.GetItemText(selected))
        #self.
        self.mainPanel.Layout()
if __name__=='__main__':
    app=wx.App()
    frame=MyFrame()
    frame.Show()
    app.MainLoop()
#___________________________________________________
