# -*- coding: utf-8 -*-
#Created on 2018-11-5 @author: 권달현
import 세율 , 기준시가 ,주택, 농지
양도소득세={
    "양도소득세의 세율": 세율.양도소득세,
    "기준시가 고시일": 기준시가.양도소득세,
    "주택의 비과세 및 감면": {
        "비과세":주택.양도소득세_비과세,
        "감면":주택.양도소득세_감면,
    },
    "농지의 감면": {
        "비과세":농지.양도소득세_비과세,
        "감면":농지.양도소득세_감면,
    },
    "공익사업용 토지 등에 대한 감면율": {},
    "개발제한구역 지정에 따른 매수대상 토지 등에 대한 양도소득세의 감면": {},
    "국가에 양도하는 산지에 대한 양도소득세의 감면": {},
    "연도별,월별 생산자물가지수표(2010년 기준)": {},
    "토지등급가액표": {},
    "상속세 세율": {},
    "상속세(증여세) 연부연납 가산금의 가산율": {},
    "증여재산공제액": {},
    "증여세 세율": {},
    "증여추정 배제기준 등": {},
    "종합소득세의 세율": {},
    "부동산 임대보증금에 대한 간주임대료 계산시 정기예금 이자율": {},
    "법인세 세율": {},
    "양도소득세 관련 농어촌특별세": {},
    "제1종 국민주택채권 매입대상자 및 매입기준": {},
    "납세자의 현장 확인 청구 및 금융증빙조회청구제도": {},
}