# -*- coding: utf-8 -*-
#Created on 2018-11-28@author: 권달현
import 비거주자
법인세={#법인세
    "법인세의 원천징수":{
        "원천징수 대상":{},
        "원천징수 세율": {},
        "소액부징수": {},
        "원천징수 대상이 아니 소득": {},
        "원천징수의무의 대리,위임": {},
        "원천징수시기 및 귀속연도": {},
        "원천징수세액의 납부": {},
        "원천징수의무의 승계": {},
        "원천징수불이행의 경우": {},
        "원리금의 일부를 변제한 경우 이자소득의 계산": {},
    },
    "신탁재산 귀속 소득에 대한 원천징수":{},
    "채권 등의 보유기간 이자상당액에 대한 원천징수":{
        "보유기간 이자상당액":{},
        "보유기간이자상당액에 대한 원천징수영수증의 교부 및 원천징수세액의 공제":{},
        "실물양도 등 집합증권의 중도매도시 보유기간이자상당액":{},
        "선이자지급방식의 채권 등 중도매도시 기공제 원천징수세액의 조정":{},
    },
}
개요={
    "1. 원천징수":{
        "원천징수대상 소득을 지급하는 자(국가, 법인 및 개인사업자, 비사업자 포함)가 소득 지급시 소득자의 세금을 징수,납부":{},
        "원천징수에 의해 소득세(법인세), 농어촌특별세를 납부":{},
    },
    "2. 원천징수의무자":{
        "원천징수의무자는 국내에서 거주자나 비거주자, 법인에게 세법에 따른 원천징수 대상 소득 또는 수입금액을 지급하는 개인이나 법인임":{},
        "- 이자,근로,퇴직,기타소득을 지급하는 자가 사업자등록번호 또는 고유번호가 없는 개인인 경우에도 원천징수의무자에 해당되어, 원천징수한 세금을 신고,납부및 지급명세서 제출의무가 있음 ":{},
        "사 례 : 사업자등록번호가 없는 개인이 법인에게 차입하여 이자(비영업대금 이익)를 지급하는 경우, 개인은 원천징수의무자에 해당되어 이자 지급 시 법인세(법인의 소득이므로 법인세임)를 원천징수하여 납부 ":{},
    },
    "3. 원천징수 대상 및 방법":{
        "가. 소득세 또는 법인세상 원천징수 대상 소득":{
            "소득세법 거주자 : 이자소득, 배당소득, 사업소득, 근로소득, 연금소득, 기타소득(종교인소득 포함), 퇴직소득":{},
            "소득세법 비거주자 : 국내원천소득 중 원천징수 대상 소득 (이자소득, 배당소득, 부동산소득, 선박 등의 임대소득, 사업소득, 인적용 역소득, 근로소득, 퇴직소득, 연금소득, 토지건물의 양도소득, 사용료소득, 유가증권양도소득, 기타소득)":{},
            "법인세법 내국법인 : 이자소득 배당소득(집합투자기구로부터의 이익 중 투자신탁의 이익에 한정)":{},
            "법인세법 외국법인 : 내원천소득 중 원천징수 대상 소득 (이자소득, 배당소득, 부동산소득, 선박 등의 임대소득, 사업소득, 인적용역 소득, 토지건물의 양도 소득, 사용료소득, 유가증권양도소득, 기타소득)": {},
        },
        "나. 농어촌특별세":{
            "납부 대상":{
                "원천징수대상 소득이 다음과 같이 농어촌특별세액 과세대상에 해당하는 경우 원천징수의무자는 농어촌특별세를 징수하여 신고․납부":{},
                "이자․배당소득 : 조세특례제한법에 의해 소득세를 감면받은 경우 (다만, 농어촌특별세법 제4조 제4호의 감면은 비과세)":{},
                "근로소득 : 주택자금차입금 이자세액공제를 적용받는 근로자":{},
            },
            "과세표준 및 세액계산":{
                "이자․배당소득 : 조세특례제한법에 의하여 감면받은 이자․배당소득에 대한 소득세의 감면세액의 10%":{},
                "주택자금차입금 이자세액공제 : 주택자금차입금 이자세액공제금액의 20%":{},
            },
            "신고․납부방법":{},
        },
        "다. 지방소득세 특별징수":{},
    },
    "4. 원천징수세율":{},
    "5. 원천징수 제외 대상":{},
    "6. 원천징수 시기":{},
    "7. 원천징수영수증 교부시기":{},
    "8. 원천징수세액의 납세지":{},
    "9. 원천징수 관련 가산세":{},
    "10. 신규 사업자가 알아야 할 원천징수 제도":{},
    "11. 국가기관 등의 원천징수 유의사항":{},
}
신고및납부={
    "1. 원천세 신고?납부 절차":{},
    "2. 원천세 신고?납부 방법":{},
    "3. 매월 납부 사업자의 원천징수이행상황신고서 작성방법 ":{},
    "4. 분납 및 환급신청":{},
    "5. 반기별 납부 사업자의 원천징수이행상황신고서 작성방법":{},
    "6. 수정신고 및 경정청구":{},
    "7. 납부서 작성방법":{},
    "8. 원천세 전자신고":{},
}
지급명세서제출={
    "1. 제출시기와 제출방법":{},
    "2. 지급명세서제출불성실가산세":{},
    "3. 퇴직소득 지급명세서 제출":{},
    "4. 연금계좌 지급명세서 제출":{},
    "5. 기타소득 지급명세서 제출":{},
    "6. 사업소득 지급명세서 제출":{},
    "7. 금융소득 지급명세서 제출":{},
    "8. 비거주자 및 외국법인의 지급명세서 제출":{},
    "9. 지급명세서 전자제출 방법":{},
    "10. 직접작성 제출방식과 변환제출방식":{},
    "11. 전자신고한 지급명세서 삭제":{},
    "12. 지급명세서 전자제출 Q&A":{},
}
근로소득={
    "1. 근로소득의 범위":{},
    "2. 근로소득 원천징수방법(간이세액표)":{},
    "3. 일용근로소득":{},
    "4. 근로소득에서 제외되는 소득":{},
    "5. 벤처기업 주식매수선택권 행사이익":{},
    "6. 실비변상적 급여의 비과세":{},
    "7. 생산직 근로자 등의 비과세 급여":{},
    "8. 국외근로소득의 비과세":{},
    "9. 그 밖의 비과세 근로소득":{},
    "10. 외화나 물품으로 받은 근로소득":{},
    "11. 근로소득 수입시기":{},
    "12. 외국인과 비거주자의 연말정산":{},
    "13. 외국인거주자와 비거주자의 연말정산 소득,세액공제 비교":{},
    "14. 연말정산 세액계산방법":{},
    "15. 근로소득금액":{},
    "16. 인적공제":{},
    "17. 연금보험료 공제":{},
    "18. 특별소득공제":{},
    "19. 그 밖의 소득공제":{},
    "20. 과세표준과 산출세액":{},
    "21. 세액감면":{},
    "22. 근로소득,자녀,연금계좌 세액공제":{},
    "23. 보험료,의료비,교육비,기부금 세액공제":{},
    "24. 월세액 세액공제":{},
    "25. 농어촌특별세":{},
    "26. 편리한 연말정산" :{},
}
퇴직소득={
    "1. 퇴직급여제도":{},
    "2. 퇴직소득의 범위":{},
    "3. 세법상 퇴직판정":{},
    "4. 퇴직소득 수입시기":{},
    "5. 퇴직소득세 계산방법":{},
    "6. 퇴직소득 세액정산":{},
    "7. 퇴직소득세의 이연":{},
    "8. 퇴직소득 원천징수 방법":{},
    "9. 임원 퇴직소득금액":{},
}
연금소득={
    "1. 연금소득의 범위":{},
    "2. 비과세 연금소득":{},
    "3. 연금소득의 수입시기":{},
    "4. 연금소득 원천징수방법":{},
    "5. 연금소득금액 계산방법":{},
}
기타소득={
    "1. 기타소득의 종류":{},
    "2. 비과세 기타소득":{},
    "3. 기타소득의 수입시기":{},
    "4. 기타소득의 원천징수방법":{},
    "5. 기타소득의 과세최저한":{},
    "6. 기타소득의 필요경비":{},
    "7. 원천징수세율":{},
    "8. 종합과세와 분리과세":{},
    "9. 원천징수영수증 교부":{},
}
종교인소득={
    "1. 종교인소득":{},
    "2. 종교관련종사자":{},
    "3. 종교단체":{},
    "4. 종교인이 지급받은 금액에 대한 소득구분":{},
    "5. 종교인소득 과세표준":{},
    "6. 종교인소득 원천징수":{},
    "7. 종교인소득에 대한 연말정산" :{},
}
사업소득={
    "1. 원천징수 대상 사업소득":{},
    "2. 원천징수의무자":{},
    "3. 사업소득 원천징수방법":{},
    "4. 원천징수영수증 발급":{},
    "5. 사업소득 연말정산":{},
}
금융소득={
    "1. 이자소득의 범위":{},
    "2. 배당소득의 범위":{},
    "3. 이자소득 주요 포인트":{},
    "4. 배당소득 주요 포인트":{},
    "5. 집합투자기구로부터의 이익":{},
    "6. 비과세되는 주요 금융소득":{},
    "7. 고배당기업 주식의 배당소득에 대한 과세특례":{},
    "8. 금융소득의 수입시기":{},
    "9. 금융소득 원천징수시기":{},
    "10. 소득세 원천징수 방법":{},
    "11. 법인세 원천징수 방법":{},
    "12. 원천징수영수증 교부 ":{},
}
비거주자외국법인={
    "1. 비거주자":{},
    "2. 과세대상소득":{},
    "3. 원천징수의무자":{},
    "4. 원천징수세액의 납세지":{},
    "5. 원천징수시기":{},
    "6. 과세표준 계산방법":{},
    "7. 원천징수세율":{},
    "8. 조세조약상 비과세,면제 적용신청":{},
    "9. 원천징수영수증의 교부":{},
}
_={
    "원천징수 총론":{
        "원천징수제도 이론":{},
        "비거주자 및 외국법인 원천징수 이론":{},
        "2018년 원천징수 관련 개정세법":{},
        "2018년 귀속 원천세 신고안내":{
            "제1장 원천징수 개요":개요,
            "제2장 원천세 신고 및 납부":신고및납부,
            "제3장 지급명세서 제출":지급명세서제출,
            "제4장 근로소득 원천징수":근로소득,
            "제5장 퇴직소득 원천징수":퇴직소득,
            "제6장 연금소득 원천징수":연금소득,
            "제7장 기타소득 원천징수":기타소득,
            "제8장 종교인소득 원천징수":종교인소득,
            "제9장 사업소득 원천징수":사업소득,
            "제10장 금융소득 원천징수":금융소득,
            "제11장 비거주자,외국법인의 원천징수":비거주자외국법인,
            "부 록 2018년 원천세 관련 개정세법":{},
        },
    },
    "거주자 및 내국법인에 대한 원천징수":{
        "근로소득 원천징수 실무": {},
        "퇴직소득 원천징수 실무": {},
        "금융소득 원천징수 실무": {
            "이자소득": {},
            "배당소득": {},
        },
        "연금소득 원천징수 실무": {},
        "사업소득 원천징수 실무": {},
        "기타소득 원천징수 실무": {
            "봉사료": {},
        },
        "지방소득세의 특별징수": {},
        "사업소득 원천징수 실무": {},
        "농어촌특별세의 원천징수 ": {},
    },
    "비거주자 및 외국법인 원천징수": {
        "비거주자의 납세의무": {
            "양도소득세_비거주자양도소득원천징수":비거주자.양도소득세_원천징수,
        },
        "외국법인의 납세의무": {},
        "조세조약": {},
        "외국법인의 과세방법": {},
        "국내원천소득": {},
        "세액계산 및 신고,납부 등": {},
    },
}
#___________________________________________________
제목='원천징수'
tax=_
import wx
class MyFrame(wx.Frame):
    def __init__(self):
        wx.Frame.__init__(self,parent=None,title=제목)
        self.SetSize(420,320*2)
        self.mainPanel=wx.Panel(self)
        self.expandButton=wx.Button(self.mainPanel,label='펼침')
        self.tree=wx.TreeCtrl(self.mainPanel)
        root=self.tree.AddRoot(제목)
        for i in tax:
            ii=self.tree.AppendItem(root,i)
            for j in tax[i]:
                jj=self.tree.AppendItem(ii,j)
                for k in tax[i][j]:
                    kk=self.tree.AppendItem(jj,k)
                    for m in tax[i][j][k]:
                        mm=self.tree.AppendItem(kk,m)
                        for n in tax[i][j][k][m]:
                            nn=self.tree.AppendItem(mm,n)
                            for p in tax[i][j][k][m][n]:
                                pp=self.tree.AppendItem(nn,p)
                                for q in tax[i][j][k][m][n][p]:
                                    qq=self.tree.AppendItem(pp,q)
                                    for r in tax[i][j][k][m][n][p][q]:
                                        rr=self.tree.AppendItem(qq,r)

        self.staticText =wx.TextCtrl(self.mainPanel,style=wx.TE_MULTILINE)


        self.vtBoxSizer=wx.BoxSizer(wx.VERTICAL)
        self.vtBoxSizer.Add(self.expandButton,0,wx.EXPAND|wx.ALL,5)
        self.vtBoxSizer.Add(self.tree        ,5,wx.EXPAND|wx.ALL,5)
        self.vtBoxSizer.Add(self.staticText  ,0,wx.EXPAND|wx.ALL,5)


        self.mainPanel.SetSizer(self.vtBoxSizer)

        self.Bind(wx.EVT_BUTTON          ,self.OnExpandButton,self.expandButton)
        self.Bind(wx.EVT_TREE_SEL_CHANGED,self.OnNodeSelected,self.tree)
    def OnExpandButton(self,e):
        self.tree.ExpandAll()
    def OnNodeSelected(self,e):
        selected=self.tree.GetSelection()
        self.staticText.SetLabel(self.tree.GetItemText(selected))

        self.mainPanel.Layout()
if __name__=='__main__':
    app=wx.App()
    frame=MyFrame()
    frame.Show()
    app.MainLoop()
#___________________________________________________