# -*- coding: utf-8 -*-
# 2018-12-24 권달현
법인세={# To: 과세표준
        '결손금의 범위':{},
        "결손금의 소급공제":{},
        '결손금의 이월공제(=이월결손금)':{
            "이월결손금의 공제와 소멸":{},
            "익금불산입사항으로 충당된 이월결손금의 공제,소멸":{},
            "익금산입사항으로 충당된 이월결손금의 공제,소멸":{},
        },
        '공제대상 결손금':{
            '당해 사업연도 개시일 전 10년이내에 개시한 사업연도에서 발생한 결손금 중 공제되지 아니한 금액':{},
            '한도':{
                '당해 소득금액 등의 80%':{},
                '당해 소득금액 등의 100%':{},
                },
            },
        "추계결(경)정시 이월결손금의 배제":{},
        "세무조정서식":{},
        }