# -*- coding: utf-8 -*-
#Created on 2018-12-24 @author: 권달현
법인세={
        '이전가격세제의 개요':{
            '정상가격에 의한 과세조정(이전가격세제) ':{},
            '국외특수관계인이란?':{},
            '정상가격이란?':{
                '비교가능 제3자 가격방법':{},
                '재판매가격방법':{},
                '원가가산방법':{},
                '이익분할방법':{},
                '거래순이익률방법':{},
                '그 밖에 거래의 실질 및 관행에 비추어 합리적이라고 인정되는 방법':{},               
                },
            },
        '해외현지기업 지급보증대가의 이전가격 조정':{
            '지급보증과 이전가격 과세조정':{},
            '지급보증 정상가격 결정방법':{},
            '지급보증 세무조정 방법':{
                '직접보증':{},
                '간접보증':{},
                },
            },
        '소득금액 조정에 따른 소득처분 및 반환이자 계산':{
            '소득처분':{},
            '반환이자 계산':{},
                },
        '국제거래에 대한 자료제출 의무':{
            '개요':{},
            '정상가격 산출방법 신고서':{},
            '원가등의 분담액 조정명세서':{},
            '국제거래명세서':{},
            '국제거래정보 통합보고서':{},
            '국외특수관계인의 요약손익계산서':{},
            '거래가격 조정신고서':{},
            '국제거래에 대한 자료제출 의무관련 과태료':{},
                },
        '정상가격산출방법 사전승인제도':{
            '의 의':{},
            '절 차':{
                '사전승인신청서의 제출':{},
                '사전승인신청의 심사':{},
                '사전승인 절차의 진행':{},
                '사전승인':{},
                '연례보고서의 제출':{},
                '사전승인의 취소 등':{},
                },
            '납세의무자 참고사항':{},
            },
        }