# -*- coding: utf-8 -*-
#Created on 2018-12-24 @author: 권달현
법인세={
    '자본거래로 인한 수익의 익금불산입': {
        '주식발행액면초과액 등': {},
        '감자차익': {},
        '합병차익': {},
        '분할차익': {},
    },
    '평가이익 등의 익금불산입': {
        '자산의 평가이익': {},
    },
    '이월익금 ': {},
    '법인세 또는 지방소득세 법이세분의 환급 또는 충다액 ': {},
    '국세 또는 지방세의 과오납금의 환급금에 대한 이자 ': {},
    '부가가치세의 매출세액 ': {},
    '이월결손금에 충당된 자산수증익과 채무면제익 ': {},
    '연결모법인이 연결자법인으로부터 지급받았거나 받을 법인세 상당액 ': {},
    '자본준비금을 감액하여 받는 배당 ': {},
    '수입배당금액': {
        '지주회사 수입배당금액의 익금불산입': {},
        '일반법인 수입배당금액의 익금불산입': {},
        '상생협력중소기업으로부터 받은 수입배당금액': {},
    },

    "국세청":{
                "  법인의 순자산을 증가시키는 거래로 인하여 발생한 수익의 항목이지만 세법에 의해 익금에서 제외하는 항목은 다음과 같습니다.": {},
                "- 법인세법에 규정한 내용(법법§17,§18,§18의2,§18의3 및 §62) ": {},
                "① 자본거래로 인한 수익의 익금불산입  주식발행액면초과액(단, 2012.4.15.이후 발행되는 무액면주식의 경우 주식의 발행가액 중 자본금으로 계상한 금액을 초과하는 금액)  주식의 포괄적 교환 이전차익, 감자차익  합병 분할차익 ": {},
                "② 평가이익 등의 익금불산입  자산의 평가차익 (보험업법 기타 법률에 의한 고정자산의 평가차익 및법령§73 규정의 자산을 법령§74∼§76에 의하여 평가함으로써 생긴 평가차익 제외) ": {},
                " 이월익금  법인세 또는 법인지방소득세를 환급받았거나 환급받을 금액을 다른 세액에 충당한 금액  국세 또는 지방세의 과오납금의 환급금에 대한 이자  부가가치세 매출세액  이월결손금의 보전에 충당한 자산수증익 및 채무면제익  연결자법인으로부터 법법§76의19 ②에 따라 지급받았거나 지급받을 금액   상법  제461조의2에 따라 자본준비금을 감액하여 받는 배당. 다만, 제16조제1항제2호 각 목에 해당하지 아니하는 자본준비금의 배당은 제외": {},
                "③ 지주회사가 자회사로부터 받은 배당소득금액 중 일정금액 ": {},
                "*( )는 비상장법인 ": {},
                "지 분 율 100% 40(80)% 초과 20(40)∼40(80)% ": {},
                "익금 불산입률 ": {},
                "Ⅱ ": {},
                "2007년 100% 90% 70% 2008년 100% 90% 80% 2009년 이후 100% 100% 80%": {},
                "＊ 지주회사는 금융지주회사를 포함하며, 2008년부터 산학협력기술지주회사 포함 ": {},

                "④ 법인이 내국법인으로부터 받는 수입배당금 중 일정금액 ": {},
                "*( )는 비상장법인 ": {},
                "지 분 율 100% 30(50)% 초과 30(50)% 이하 ": {},
                "익금불산입률 100% 50% 30% ": {},
                "⑤ 비영리내국법인이 이자소득을 법법§62에 따라 법인세 과세표준 신고를 하지 아니하고 원천납부로 종결하는 금액(비영업대금의 이익은 제외)": {},
                "⑥ 회생계획인가 결정 등을 받은 법인이 채무를 출자전환하는 경우로서 주식 등의 시가(시가가 액면가액에 미달하는 경우 액면가액)를 초과하여 발행된 금액(출자전환채무면제익) ⇒ 향후 발생하는 결손금 보전에 충당가능 ": {},
                "- 조세특례제한법에 규정한 내용 ": {},
                "① 연구개발 목적으로 정부출연금을 수령하고 당해연도에 사용하지 못하는 경우 출연금 수령시점에 익금불산입(조특법§10의2) - 추후 출연금을 지출하여 손비 처리하는 시점에 익금산입": {},
                "② 무역조정지원기업이 영위하던 사업을 법법§6③에 열거한 업종으로 전환하기 위해 사업용 고정자산을 2018.12.31.까지 양도하고 양도일로부터 1년 이내에 전환 사업에 직접 사용할 사업용 고정자산을 취득하는 경우 양도차익 익금불산입 (조특법§33①) - 양도일이 속하는 사업연도 종료일 이후 3년이 되는 날이 속하는 사업연도 부터 3년간 균분한 금액 이상 익금산입": {},
                "③ 기업이 재무구조개선을 위해 2018.12.31. 이전에 자산을 양도하고 양도일로 부터 3개월 이내에 채무를 상환한다는 내용을 포함한 재무구조개선계획에 따라 자산을 양도하는 경우 양도차익 중 채무상환액 상당액 익금불산입 (조특법§34①) - 해당연도와 해당사업연도의 종료일 이후 3년간 익금에 산입하지 않고 그다음 3년간 균분한 금액 이상 익금산입 ": {},
                "130 2018 법인세 신고안내 ": {},
                "④ 내국법인이 외국자회사의 주식 등을 현물출자하여 새로운 외국법인을 설립하거나 이미 설립된 외국법인에 현물출자하는 경우 그로 인하여 발생한 외국자회사 주식 등의 양도차익 익금불산입(조특법§38의3①) - 양도일로부터 4년이 되는 날이 속하는 연도부터 3년간 균등액 익금산입": {},
                "⑤ 재무구조개선계획 등에 따라 내국법인의 지배주주인 법인주주와 특수 관계자의 주식을 전부 양도하여 주식발행 법인의 채무를 인수 변제하는 경우 해당 내국법인의 채무감소액 익금불산입(조특법§39②) - 해당연도와 해당사업연도의 종료일 이후 3년간 익금에 산입하지 않고 그다음 3년간 균분한 금액 이상 익금산입": {},
                "⑥ 내국법인이 주주 또는 출자자로부터 2018.12.31. 이전에 재무구조개선계획 등의 일정요건을 갖추어 자산을 무상으로 받는 경우 결손금 초과하는 자산가액 익금불산입(조특법§40①) - 수증일이 속하는 사업연도 종료일 이후 3년간 익금에 산입하지 않고 그다음 3년간 균분한 금액 이상 익금산입 ": {},
                "※ 법인주주가 소유자산을 양도하고 양도대금을 해당 내국법인에게 증여하는 경우의 양도차익상당액 익금불산입(조특법§40③) ": {},
                "⑦ 회생계획인가 등의 결정을 받은 법인이 채권금융기관으로부터 채무의 면제를 받은 경우 면제받은 채무액 중 이월결손금을 차감한 금액은 익금불산입 (조특법§44①) - 해당연도와 해당사업연도의 종료일 이후 3년간 익금에 산입하지 않고 그다음 3년간 균분한 금액 이상 익금산입": {},
                "⑧ 2012.12.31. 이전에 재무구조개선계획에 따라 주주 등으로부터 해당 법인의 주식 등을 무상으로 받아 소각하는 경우 해당 주식가액 중 결손금 초과금액 익금불산입(조특법§45①)": {},
                "⑨ 내국법인의 지배주주인 법인 등이 2017.12.31. 이전 * 에 재무구조개선 계획에 따라 소유주식 등을 전부양도하고 다른 법인의 주식 등을 양수하는 경우 주식 등 양도차익 상당액 익금불산입(조특법§46①) - 양수 주식 등을 처분할 때 익금산입 ": {},
                "* 2014.12.31. 기간 개정(종전 2012.12.31.) ": {},
                "⑩ 제약업 등 * 을 경영하는 내국법인간에 2018.12.31.까지 합병함에 따라 발생하는 중복자산을 처분하여 다른 자산을 대체 취득한 경우 발생하는 양도차익에 대해 익금불산입(조특법§47의4①) - 양도일이 속하는 사업연도 종료일 이후 3년이 되는 날이 속하는 사업 연도부터 3년간 균분액 이상 익금산입 ": {},
                "* 의료용 물질 및 의약품 제조업, 의료용 기기 제조업, 건설업, 해상 운송업, 선박 건조업, 1차 철강 제조업, 기초유기화학물질 제조업, 합성고무 및 플라스틱 물질 제조업 ": {},
                "⑪ 공장의 대도시 밖 이전 본사의 수도권과밀억제권역 밖 이전 공장 및 본사의 수도권 밖 이전 시 양도차익 익금불산입(조특법§60②, §61③, §63의2⑤) - 양도일이 속하는 사업연도 종료일 이후 5년이 되는 날이 속하는 사업 연도부터 5년간 균분한 금액 이상 익금산입": {},
                "⑫ 행정중심복합도시 안에서 공장시설을 갖추고 사업을 영위하던 내국 법인이 지방으로 이전하기 위해 공장을 사업시행자에게 양도함으로써 발생하는 양도차익 익금불산입(조특법§85의2) - 양도일이 속하는 사업연도 종료일 이후 5년이 되는 날이 속하는 사업연도부터 5년간 균분한 금액 이상 익금산입": {},
                "⑬ 기업도시개발사업전담기업에게 구역 내의 토지를 현물출자함에 따라 발생한 양도차익에 대해 취득주식 처분 시까지 익금불산입(조특법§85의3①)": {},
                "⑭ 경제자유구역의 외국인투자기업인 개발사업시행자가 보유토지를 2014.12.31.": {},
                "까지 내국법인에 현물출자함에 따른 양도차익 익금불산입(조특법 §85의4①) - 현물출자 취득주식을 처분할 때 익금산입": {},
                "⑮ 직장보육시설 운영 자가 종전보육시설을 2009.12.31.까지 양도하고 양도일부터 1년 내에 새로운 보육시설을 취득하는 경우 종전보육시설 양도차익 익금 불산입(조특법§85의5①) - 양도일이 속하는 사업연도 종료일 이후 3년이 되는 날이 속하는 사업 연도부터 3년간 균분한 금액 이상 익금산입 ": {},

                "     공익사업지역 안에서 2년 이상 가동한 공장을 공익사업시행자에게 양도함에 따라 발생한 양도차익의 익금불산입(조특법§85의7①) - 양도일이 속하는 사업연도 종료일 이후 3년이 되는 날이 속하는 사업연 도부터 3년간 균분한 금액 이상 익금산입": {},
                "     10년 이상 공장을 영위한 중소기업이 수도권과밀억제권역 밖으로 이전하기 위해 2017.12.31.까지 공장을 양도함에 따라 발생한 양도차익 익금불산입 (조특법§85의8①) - 양도일이 속하는 사업연도가 끝나는 날 이후 2년이 되는 날이 속하는 사업연도부터 2년간 균분한 금액 이상 익금산입      어업협정에 따라 어업인 등이 지급받은 어업보조금은 익금불산입(조특법 §104의2②) - 당해 어업보조금을 지출하거나 어업보조금으로 취득한 사업용자산에 대하여 감가상각하는 때에 손금불산입": {},
                "     사업재편계획 * 에 대한 과세특례 ": {},
                "*  기업활력 제고를 위한 특별법 에 따라 주무부처의 승인을 받은 사업재편계획 ": {},
                "- 재무건전성 목표 달성을 위해 자산을 양도하여 금융채무상환자금 충당 시자산양도차익 익금불산입(4년거치 3년분할 익금산입, 조특법§121의26) - 모회사가 자회사의 구조조정을 위해 자회사의 금융채무를 인수 변제 시자회사의 채무면제이익 익금불산입(4년거치 3년분할 익금산입, 조특법 §121의27) - 주주등이 재무건전성 목표 달성을 위해 자산을 무상증여 시 수증법인의 자산수증이익 익금불산입(4년거치 3년분할 익금산입, 조특법 §121의28) - 사업재편 과정에서 금융기관으로부터 채무를 면제받는 경우 면제법인의 채무면제이익 익금불산입(4년거치 3년분할 익금산입, 조특법 §121의29) - 기업간 사업재편을 위해 주식 교환 시 주식 양도차익에 대한 법인세 과세를 교환주식 처분시까지 이연(조특법 §121의30) - 사업재편을 위해 합병 후 중복자산을 처분하고 새로운 사업용고정자산 취득 시 모든 업종간 합병에 대해 자산양도차익 익금불산입(3년거치 3년분할 익금산입, 조특법 §121의31) ": {},

                "참고：기본통칙 예규 ": {},
                " 이월결손금의 보전에 충당한 채무면제익 등의 익금불산입(통칙 18-18…1) ": {},
                "채무면제익 등을 소멸한 이월결손금에 보전한 경우에도 이를 익금에 산입하지 아니함.": {},
                "이 경우 “소멸한 이월결손금”이라 함은 법 제14조 제2항의 결손금으로서 법 제13조 제1호의 규정에 의한 공제시한이 경과됨으로써 그 후의 각 사업연도의 과세표준 계산에 있어서 공제되지 아니한 금액을 말함. ": {},
                " 채무면제익 등을 이월결손금의 보전에 충당한 경우의 처리(통칙 18-18…2) ": {},
                "법 제18조 제8호 규정의 “이월결손금의 보전에 충당된 금액”에는 무상으로 받은 자산의 가액과 채무의 면제 또는 소멸로 인한 부채의 감소액을 기업회계기준에 따라 특별이익으로 계상한 법인이 자본금과적립금 조정명세서(규칙 별지 제50호 서식)에 동금액을 이월결손금의 보전에 충당한다는 뜻을 표시하고 세무조정으로 익금불산입한 경우동 금액을 포함함.": {},
                "- 경정청구로 자산수증익의 이월결손금 보전에 충당 가능 여부 내국법인이 자산수증이익을 법인세법 제18조제6호에 따라 이월결손금의 보전에 충당한 경우에 해당 자산수증이익은 각사업연도 소득금액을 계산할 때 익금에 산입하지 아니하는 것이며, 자산수증이익을 해당 사업연도 이월결손금에 충당하지 아니하고 법인세를 신고한 경우에는 국세기본법 제45조의2에 따른 경정 등의 청구에 의하여 이월결손금 보전에 충당하고 익금에 산입하지 아니할 수 있는 것임(기준-2013-법령해석법인-16762, 2015.03.10.)": {},
                "- 채무의 출자전환시 채무면제이익 계산  법인세법  제17조제1항제1호 단서의 규정을 적용함에 있어 내국법인이 채무의 출자전환으로 발행하는 주식의 시가가 액면가액에 미달하는 경우에는 액면 가액을 초과하여 발행된 금액을 채무면제이익으로 보아 익금에 산입하는 것이므로 액면가액과 시가와의 차액은 익금에 산입하지 않는 것임(법인세과-36, 2011.1.13.)": {},
                "- 수입배당금 익금불산입 출자비율 산정  법인세법  제18조의2【지주회사 수입배당금액의 익금불산입】규정을 적용함에 있어 지주회사의 자회사에 대한 출자비율은 자회사의 발행주식총수 중 지주회사가 자회사에 출자한 주식 전체가 차지하는 비율로 산정하는 것임(법인세과-788, 2011.10.21.": {},
                "→ 법규과-1320, 2011.10.6.) ": {},
                "134 2018 법인세 신고안내 ": {},
                "- 수입배당금 익금불산입액 계산시 차감하는 지급이자의 범위 한국채택국제회계기준을 적용하는 내국법인이 보유자산을 양도함에 있어  자산유동화에 관한 법률  제13조 각 호의 요건을 갖추지 못하여 차입거래로 회계처리하는 경우그 차입거래에 따른 할인료 등은  법인세법  제18조의3 제1항에 따른 수입배당금의 익금불산입액 계산시 차감할 차입금의 이자에 포함하는 것임(법인-760, 2012.12.7.) ": {},

            },
}
조세특례제한법={
            '연구개발 관련 출연금 등의 과세특례':{
                        '개요':{},
                        '환입(익금산입)시기와 방법':{},
                        '제출서류':{},
                        },
            '사업전환 무역조정지원기업에 대한 과세특례':{},
            '기업의 금융채무 상환을 위한 자산매각에 대한 과세특례 등':{},
}


#___________________________________________________
제목='익금불산입'
_={
    #"지방소득세_법인세분 가산세": 지방소득세_법인세분,
    #"기업회계":기업회계,
    "법인세":법인세,
    "조세특례제한법":조세특례제한법,
    #"증여세":증여세,
    #"상속세":상속세,
    #"양도소득세":양도소득세,
    #"농어촌특별세":{},
}
tax=_
import wx
class MyFrame(wx.Frame):
    def __init__(self):
        wx.Frame.__init__(self,parent=None,title=제목)
        self.SetSize(420,320*2)
        self.mainPanel=wx.Panel(self)
        self.expandButton=wx.Button(self.mainPanel,label='펼침')
        self.tree=wx.TreeCtrl(self.mainPanel)
        root=self.tree.AddRoot(제목)
        for i in tax:
            ii=self.tree.AppendItem(root,i)
            for j in tax[i]:
                jj=self.tree.AppendItem(ii,j)
                for k in tax[i][j]:
                    kk=self.tree.AppendItem(jj,k)
                    for m in tax[i][j][k]:
                        mm=self.tree.AppendItem(kk,m)
                        for n in tax[i][j][k][m]:
                            nn=self.tree.AppendItem(mm,n)
                            for p in tax[i][j][k][m][n]:
                                pp=self.tree.AppendItem(nn,p)
                                for q in tax[i][j][k][m][n][p]:
                                    qq=self.tree.AppendItem(pp,q)
                                    for r in tax[i][j][k][m][n][p][q]:
                                        rr=self.tree.AppendItem(qq,r)
        self.staticText =wx.TextCtrl(self.mainPanel,style=wx.TE_MULTILINE)

        self.vtBoxSizer=wx.BoxSizer(wx.VERTICAL)
        self.vtBoxSizer.Add(self.expandButton,0,wx.EXPAND|wx.ALL,5)
        self.vtBoxSizer.Add(self.tree        ,5,wx.EXPAND|wx.ALL,5)
        self.vtBoxSizer.Add(self.staticText  ,0,wx.EXPAND|wx.ALL,5)
        self.mainPanel.SetSizer(self.vtBoxSizer)
        self.Bind(wx.EVT_BUTTON          ,self.OnExpandButton,self.expandButton)
        self.Bind(wx.EVT_TREE_SEL_CHANGED,self.OnNodeSelected,self.tree)
    def OnExpandButton(self,e):
        self.tree.ExpandAll()
    def OnNodeSelected(self,e):
        selected=self.tree.GetSelection()
        self.staticText.SetLabel(self.tree.GetItemText(selected))
        #self.
        self.mainPanel.Layout()
if __name__=='__main__':
    app=wx.App()
    frame=MyFrame()
    frame.Show()
    app.MainLoop()
#___________________________________________________