# -*- coding: utf-8 -*-
#Created on 2018-12-24 @author: 권달현
import 수입금액의조정

익금항목의조정={
	'...':{},
	}
법인세={
            '수입금액의 조정':수입금액의조정.법인세,
            '각종 준비금,충당금 환입액의 익금조정':{},
            '임대보증금 등의 간주익금조정':{
                    '간주익금의 계산대상법인':{},
                    '간주익금의 계산방법':{},
                    },
            '가지급금 등에 대한 인정이자의 익금조정':{
                    '가지급금 인정이자 배제 대상':{},
                    '“가중평균차입이자율”의 계산':{},
                    '당좌대출이자율이란':{},
                    '특수관계인의 범위':{},
                    },
            }
