# -*- coding: utf-8 -*-
#Created on 2018-11-5 @author: 권달현
법인세={
    "개요":{},
    "이자율":{
        "이자율의 적용":{},
        "당좌대출이자율":{},
        "가중평균차입이자율":{},
    },
    "인정이자의 계산":{},
    "세무조정":{},
    "가지급금 및 가수금의 상계 및 미수이자 계상의 허용 여부":{},
    "미회수 가지급금 및 미수이자 등의 세무조정":{
        "회수지연시의 처리":{},
        "회수지연에 따른 상대방의 처리":{},
    },
    "가수금과 미수이자의 대손처리":{},
    "가지급금 인정이자의 귀속시기":{},
    "가지급금 등에 대한 인정이자의 익금조정 ": {

                "  특수관계자에게 무상 또는 시가보다 낮은 이율로 금전을 대여한 경우에는 가중평균차입이자율(적용이 불가능한 경우 당좌대출이자율 선택 허용)로 계산한 이자 상당액을 익금으로 계상하여야 합니다(법령§88①.6, §89③). ": {},
                "  선택한 비율은 해당되는 모든 거래에 대하여 적용하고, 가중평균차입이자율 적용이 불가능한 사유가 있는 경우 해당 대여금 또는 차입금에 한정하여 당좌대출이자율을 적용할 수 있으며, ": {},

                "- 법인세 신고와 함께 당좌대출이자율 적용을 선택하면 3년간은 의무적으로 당좌 대출이자율을 적용하여야 합니다. ": {},
                "- 가중평균차입이자율 적용이 불가능한 사유(법칙§43③)  특수관계인이 아닌 자로부터 차입한 금액이 없는 경우  차입금 전액이 채권자가 불분명한 사채 또는 매입자가 불분명한 채권  증권의 발행으로 조달된 경우  대여법인의 가중평균차입이자율 또는 대여금리가 차입법인의 가중평균 차입이자율보다 높은 경우 ": {},
                "☞ 2012.2.2. 이후 최초로 신고하는 분부터는 대여기간이 5년을 초과하는 대여금이 있는 경우 등 기획재정부령으로 정하는 경우에는 해당 대여금 또는 차입금에 한정하여 당좌대출이자율을 시가로 하도록 개정됨(법령§89③, 2012.2.2.개정). ": {},
                "  당좌대출이자율 변경 전 약정한 대여금에 대한 시가적용 방법": {},
                "가중평균차입이자율을 적용할 수 없는 법인이 당좌대출이자율을 기준으로 하여  법인세법 시행령  제88조제1항제7호에 따른 부당행위계산 부인대상이 되지 않도록 금전대차거래 약정을 체결하였으나 이후 같은 법 시행규칙(기획재정부령 제266호 2012.2.28. 개정된 것) 제43조제2항의 당좌대출이자율이 변경된 경우, 변경된 당좌대출이자율이 시행된 후에 발생하는 이자에 대해서  법인세법 시행령  제88조제1항제7호에 따른 부당행위계산 부인 대상이 되는지를 판단함에 있어서는 변경된 당좌대출이자율을 기준으로 하는 것임(법인-431, 2012.6.28.).": {},
                "  당좌대출이자율의 3년간 의무적용 여부": {},
                "내국법인이 당좌대출이자율을 시가로 선택하여 3년간 의무적용하고 그 다음 사업연도(4년차) 법인세 신고 시 당좌대출이자율을 다시 선택한 경우, 해당 사업연도 (4년차)와 이후 2개 사업연도에도 당좌대출이자율을 시가로 하는 것임(기준-2016-법령해석법인-0205, 2016.10.12) ": {},

                "조정에 필요한 내용 ": {},
                "(1) 가지급금 인정이자 배제 대상 ": {

                    "① 미지급소득(배당소득, 상여금)에 대한 소득세 대납액(법칙§44, 1호) ": {},
                    "☞ 법인지방소득세와 미지급소득으로 인한 중간예납세액 상당액을 포함하며, 당해 소득을 실지로 지급할 때까지의 기간에 상당하는 금액에 한합니다. ": {},
                    "Ⅲ ": {},
                    "미지급소득에 대한 소득세 ": {},
                    "= ": {},
                    "종합소득 총결정세액 ": {},
                    "× ": {},
                    "미지급소득 종합소득금액 ": {},
                    "② 국외에 자본을 투자한 내국법인이 해당 국외투자법인에 종사하거나 종사할 자에게 여비 급료 기타 비용을 대신하여 부담하고 이를 가지급금 등으로 계산한 금액 (규칙§44, 2호) ": {},
                    "☞ 그 금액을 실지로 환부받을 때까지의 기간에 상당하는 금액에 한합니다. ": {},
                    "③ 우리사주조합 또는 그 조합원에게 해당 우리사주조합이 설립된 회사의 주식취득에 소요되는 자금을 대여한 금액(법칙§44, 3호) ": {},
                    "☞ 조합원간 주식을 매매하는 경우와 조합원이 취득한 주식을 교환하거나 현물출자함으로써 독점규제및공정거래에관한법률에 의한 지주회사 또는 금융지주회사법에 의한 금융지 주회사의 주식을 취득하는 경우를 포함하며, 상환할 때까지의 기간에 상당하는 금액에 한합니다. ": {},
                    "④ 국민연금법에 의해 근로자가 지급받은 것으로 보는 퇴직금전환금(법칙§44, 4호) ": {},
                    "☞ 당해 근로자가 퇴직할 때까지의 기간에 상당하는 금액에 한합니다. ": {},
                    "⑤ 사외로 유출된 금액의 귀속이 불분명하여 대표자에게 상여처분한 금액에 대한 소득세를 법인이 납부하고 가지급금으로 계상한 금액(법칙§44, 5호) ": {},
                    "☞ 특수관계가 소멸될 때까지의 기간에 상당하는 금액에 한합니다. ": {},
                    "⑥ 사용인에 대한 월정급여액 범위안의 일시적 급료 가불금(법칙§44, 6호)": {},
                    "⑦ 사용인에 대한 경조사비 또는 학자금(자녀포함)의 대여액(법칙§44, 7호)": {},
                    "⑧ 한국자산관리공사가 출자총액의 전액을 출자하여 설립한 법인에 대여한 금액 (규칙§44, 8호) ": {},

                },
                "(2) “가중평균차입이자율”의 계산 ": {

                    "  자금을 대여한 법인의 대여시점 현재 각각의 차입금 잔액(특수관계인으로 부터의 차입금은 제외)에 차입 당시의 각각의 이자율을 곱한 금액의 합계액을 해당 차입금 잔액의 총액으로 나눈 비율을 말합니다(법칙§43①).": {},
                    "- 변동금리로 차입한 경우에는 차입 당시의 이자율로 차입금을 상환하고 변동된 이자율로 동 금액을 다시 차입한 것으로 봅니다. ": {},
                },
                "(3) 당좌대출이자율이란 ": {

                    "  국세청장이 정하는 당좌대출이자율 - 2002.1.1.이후：9%(국세청고시 제2001-31, 2001.12.27.) - 2009.1.1.이후 개시하는 사업연도：8.5%(시행규칙§43②, 2009.3.30. 개정) - 2012.1.1.이후 개시하는 사업연도：6.9%(시행규칙§43②, 2012.2.28. 개정) - 2016.3.7.이후：4.6%(시행규칙§43②, 2016.3.7 개정) ": {},
                    "☞ 시행 전에 종전의 당좌대출이자율에 따라 이자를 수수하기로 약정을 체결한 경우로서 약정기간이 있는 대여금에 대해서는 개정규정에도 불구하고 해당 약정기간 만료일까지는 종전의 규정에 따릅니다(2016.3.7. 규칙 부칙 11조) ": {},

                },
                "(4) 특수관계인의 범위 (법령§87) ": {

                    "  특수관계인의 범위는 당해 법인과 아래 중 어느 하나의 관계에 있는자를 말하며, 이 경우 본인도 그 특수관계인의 특수관계인으로 봄": {},
                    "① 임원의 임면권 행사, 사업방침의 결정 등 당해 법인의 경영에 대하여 사실상 영향력을 행사하고 있다고 인정되는 자(상법§401의2 ①의 규정에 의하여 이사로 보는 자를 포함)와 그 친족": {},
                    "② 주주 등(소액주주 등 제외)과 그 친족 ": {},
                    "* 소액주주 등：발행주식총수 또는 출자총액의 1%에 미달하는 주식 또는 출자지분을 소유한 주주등(국가, 지방자치단체가 아닌 지배주주 등의 특수관계인인 자는 제외)(법령§50②) ": {},
                    "③ 법인의 임원 사용인 또는 주주등의 사용인(주주등이 영리법인인 경우에는 그임원을, 비영리법인인 경우에는 그 이사 및 설립자를 말한다)이나 사용인외의 자로서 법인 또는 주주 등의 금전 기타 자산에 의하여 생계를 유지하는 자와 이들과 생계를 함께하는 친족": {},
                    "④ 해당 법인이 직접 또는 그와 제1호부터 제3호까지의 관계에 있는 자를 통하여 어느법인의 경영에 대하여 지배적인 영향력 * 을 행사하고 있는 경우 그 법인": {},
                    "⑤ 해당 법인이 직접 또는 그와 제1호부터 제4호까지의 관계에 있는 자를 통하여 어느법인의 경영에 대하여 지배적인 영향력 * 을 행사하고 있는 경우 그 법인": {},
                    "⑥ 당해 법인에 100분의 30 이상을 출자하고 있는 법인에 100분의 30 이상을 출자하고 있는 법인이나 개인": {},
                    "⑦ 당해 법인이  독점규제 및 공정거래에 관한 법률 에 의한 기업집단에 속하는 법인인 경우 그 기업집단에 소속된 다른 계열회사 및 그 계열회사의 임원 ": {},
                    "* 지배적인 영향력을 행사하고 있는지 여부는  국세기본법 시행령  §1조의2④에 따름 ": {},
                    "Ⅲ ": {},
                    "※ 종전에는 쌍방관계를 각각 특수관계인으로 하도록 기본통칙 통칙 52-87…1에서 규정하고 있었으나, 2012.2.2. 시행령 개정시 본인도 국세기본법에 따라 특수관계인의 특수관계인으로 본다는 내용을 법령에 명문화 하고, 제2차 출자법인에 대한 출자비율을 종전 50% 이상에서 30% 이상으로 조정(법령§87①)": {},
                    "☞ 2012.2.2. 이후 최초로 거래하는 분부터 적용 ": {},
                },

                "참고：통칙 및 예규 ": {

                    " 가지급금 등에 대한 인정이자의 처분(통칙 67-106…10) ": {},
                    "② 법인이 특수관계인간의 금전거래에 있어서 상환기간 및 이자율 등에 대한 약정이 없는 대여금 및 가지급금 등에 대하여 결산상 미수이자를 계상한 경우에도 동 미수이자는 익금불산입하고 영 제89조 제3항 및 제5항의 규정에 의하여 계산한 인정이자상당액을 익금에 산입함. ": {},
                    " 당좌대출이자율의 3년간 의무적용 여부 ": {},
                    "내국법인이 「법인세법 시행령」 제88조제1항제6호 및 제7호에 따른 부당행위계산부인 규정을 적용함에 있어 「같은 법 시행령」 제89조제3항제2호에 따라 당좌대출이자율을 시가로 선택하여 3년간 의무적용하고 그 다음 사업연도(4년차) 법인세 신고 시 당좌대출 이자율을 다시 선택한 경우, 해당 사업연도(4년차)와 이후 2개 사업연도에도 당좌대출 이자율을 시가로 하는 것임(법령해석과-4875, 2016.10.12) ": {},
                    " 대손사유가 발생하기 전에 특수관계가 소멸하였다면 더 이상 비정상적으로 자금을 대여하고 있는 것이라고 볼 수 없음 ": {},
                    "특수관계자에 대한 업무무관 가지급금인지 여부는 그 대손사유가 발생할 당시를 기준으로 판단하여야 할 것임(대법원2012두6247, 2014.07.24) ": {},
                    " 상법을 위반한 자기주식 취득은 업무무관 가지급금에 해당 ": {},
                    "법인이 상법 및 기타의 법률에서 자기주식의 취득을 예외적으로 허용하는 경우 외에 자기의 계산으로 자기주식을 취득함으로써, 해당 자기주식 취득행위가  상법  제341조에 위반되어 무효에 해당하는 경우": {},
                    "해당 법인이 특수관계자인 주주에게 자기주식 취득대금으로 지급한 금액은 법률상 원인없이 지급된 것으로서 이를 정당한 사유없이 회수하지 않거나 회수를 지연한 때에는  법인세법 시행령  제53조제1항의 ‘업무무관가지급금’으로 보는 것임(법인세과-1147, 2010.12.9.   법규과-1796, 2010.12.2.). ": {},

                },
            },
}


#___________________________________________________
제목='인정이자'
_={
    #"지방소득세_법인세분 가산세": 지방소득세_법인세분,
    #"기업회계":기업회계,
    "법인세":법인세,
    #"조세특례제한법":조세특례제한법,
    #"증여세":증여세,
    #"상속세":상속세,
    #"양도소득세":양도소득세,
    #"농어촌특별세":{},
}
tax=_
import wx
class MyFrame(wx.Frame):
    def __init__(self):
        wx.Frame.__init__(self,parent=None,title=제목)
        self.SetSize(420,320*2)
        self.mainPanel=wx.Panel(self)
        self.expandButton=wx.Button(self.mainPanel,label='펼침')
        self.tree=wx.TreeCtrl(self.mainPanel)
        root=self.tree.AddRoot(제목)
        for i in tax:
            ii=self.tree.AppendItem(root,i)
            for j in tax[i]:
                jj=self.tree.AppendItem(ii,j)
                for k in tax[i][j]:
                    kk=self.tree.AppendItem(jj,k)
                    for m in tax[i][j][k]:
                        mm=self.tree.AppendItem(kk,m)
                        for n in tax[i][j][k][m]:
                            nn=self.tree.AppendItem(mm,n)
                            for p in tax[i][j][k][m][n]:
                                pp=self.tree.AppendItem(nn,p)
                                for q in tax[i][j][k][m][n][p]:
                                    qq=self.tree.AppendItem(pp,q)
                                    for r in tax[i][j][k][m][n][p][q]:
                                        rr=self.tree.AppendItem(qq,r)
        self.staticText =wx.TextCtrl(self.mainPanel,style=wx.TE_MULTILINE)

        self.vtBoxSizer=wx.BoxSizer(wx.VERTICAL)
        self.vtBoxSizer.Add(self.expandButton,0,wx.EXPAND|wx.ALL,5)
        self.vtBoxSizer.Add(self.tree        ,5,wx.EXPAND|wx.ALL,5)
        self.vtBoxSizer.Add(self.staticText  ,0,wx.EXPAND|wx.ALL,5)
        self.mainPanel.SetSizer(self.vtBoxSizer)
        self.Bind(wx.EVT_BUTTON          ,self.OnExpandButton,self.expandButton)
        self.Bind(wx.EVT_TREE_SEL_CHANGED,self.OnNodeSelected,self.tree)
    def OnExpandButton(self,e):
        self.tree.ExpandAll()
    def OnNodeSelected(self,e):
        selected=self.tree.GetSelection()
        self.staticText.SetLabel(self.tree.GetItemText(selected))
        #self.
        self.mainPanel.Layout()
if __name__=='__main__':
    app=wx.App()
    frame=MyFrame()
    frame.Show()
    app.MainLoop()
#___________________________________________________