# -*- coding: utf-8 -*-
#Created on 2018-12-3 @author: 권달현

공통사항={
    "6.3 	이 장의 적용범위에 해당하는 금융상품과 관련하여 제2절~제4절에서 정하지 않은 사항은 이 절에서 제시하는 원칙을 적용한다.":{},
    "금융상품의 최초인식 6.4":{
        "6.4 	금융자산이나 금융부채는 금융상품의 계약당사자가 되는 때에만 재무상태표에 인식한다. ":{},
        "6.4의2 	관련 시장의 규정이나 관행에 의하여 일반적으로 설정된 기간 내에 당해 금융상품을 인도하는 계약조건에 따라 금융자산을 매입하거나 매도하는 정형화된 거래의 경우 매매일에 해당 거래를 인식한다.":{},
    },
    "금융상품의 제거 6.5-6.11":{
        "6.5	금융자산(제2절 ‘유가증권’의 적용대상 금융자산은 제외)의 양도(자산 일부의 양도를 포함한다)의 경우에, 다음 요건을 모두 충족하는 경우에는 양도자가 금융자산에 대한 통제권을 이전한 것으로 보아 매각거래로, 이외의 경우에는 금융자산을 담보로 한 차입거래로 본다.": {
            "⑴ 양도인은 금융자산 양도후 당해 양도자산에 대한 권리를 행사할 수 없어야 한다. 즉, 양도인이 파산 또는 법정관리 등에 들어갈 지라도 양도인 및 양도인의 채권자는 양도한 금융자산에 대한 권리를 행사할 수 없어야 한다.": {},
            "⑵ 양수인은 양수한 금융자산을 처분(양도 및 담보제공 등)할 자유로운 권리를 갖고 있어야 한다.": {},
            "⑶ 양도인은 금융자산 양도후에 효율적인 통제권을 행사할 수 없어야 한다.": {},
        },
        "6.6 	금융자산의 이전거래가 매각거래에 해당하면 처분손익을 인식하여야 하며, 매각거래와 관련하여 신규로 취득(부담)하는 자산(부채)가 있는 경우에는 공정가치로 평가하여 장부에 계상하고 처분손익계산에 반영하여야 한다. 만약 신규로 취득(부담)하는 자산(부채)의 공정가치를 알 수 없는 경우에는 다음과 같이 평가한다.": {
            "⑴ 자산을 취득하는 경우에는 ‘0’으로 보아 처분손익을 계상한다.": {},
            "⑵ 부채를 부담하는 경우에는 처분에 따른 이익을 인식하지 않는 범위내에서 평가하여 계상한다.": {},
        },
        "6.7 	매각거래와 관련하여 취득하거나 부담하는 자산 및 부채의 예로는 금융자산 양도후 사후관리 업무를 양도인이 계속하여 보유하면서 이에 따른 위탁수수료를 받는 경우, 자산양도후 양도자산에 대해 부실이 발생하면 이를 환매하기로 약정한 경우의 환매채무 등을 들 수 있다.": {},
        "6.8 	금융자산의 이전이 담보거래에 해당하는 경우에는 해당 금융자산을 담보제공자산으로 별도 표시하여야 한다.": {},
        "6.8의2 	금융부채(또는 금융부채의 일부)는 다음 중 하나에 해당하는 경우에 소멸한다. ": {
            "⑴ 채무자가 일반적으로 현금, 그 밖의 금융자산, 재화 또는 용역을 채권자에게 제공하여 부채의 전부나 일부를 이행한 경우": {},
            "⑵ 채무자가 채권자에게서 또는 법적 절차에 따라, 부채의 전부 또는 일부에 대한 1차적 의무를 법적으로 유효하게 면제받은 경우(채무자가 보증을 제공하는 경우에도 이 조건은 여전히 충족될 수 있다).": {},
        },
        "6.9 	기존 차입자와 대여자가 실질적으로 다른 조건으로 채무상품을 교환한 경우, 최초의 금융부채를 제거하고 새로운 금융부채를 인식한다. 이와 마찬가지로, 기존 금융부채(또는 금융부채의 일부)의 조건이 실질적으로 변경된 경우(채무자의 부담이 경감되도록 변경된 경우는 제외)에도 최초의 금융부채를 제거하고 새로운 금융부채를 인식한다. ": {},
        "6.10 	소멸하거나 제3자에게 양도한 금융부채(또는 금융부채의 일부)의 장부금액과 지급한 대가(양도한 비현금자산이나 부담한 부채를 포함)의 차액은 당기손익으로 인식한다. ": {},
        "6.11 	금융부채의 일부를 재매입하는 경우, 금융부채의 장부금액은 계속 인식되는 부분과 제거되는 부분에 대해 재매입일 현재 각 부분의 상대적 공정가치를 기준으로 배분한다. 다음 ⑴과 ⑵의 차액은 당기손익으로 인식한다.": {
            "⑴ 제거되는 부분에 배분된 금융부채의 장부금액": {},
            "⑵	제거되는 부분에 대하여 지급한 대가(양도한 비현금자산이나 부담한 부채를 포함)": {},
        },
    },
    "금융자산과 금융부채의 최초 측정 6.12-":{
        "6.12 	금융자산이나 금융부채는 최초인식시 공정가치로 측정한다. 다만, 최초인식 이후 공정가치로 측정하고 공정가치의 변동을 당기손익으로 인식하는 금융자산이나 금융부채{예: 단기매매증권, 파생상품(현금흐름위험회피회계에서 위험회피수단으로 지정되는 경우는 제외)}가 아닌 경우 당해 금융자산(금융부채)의 취득(발행)과 직접 관련되는 거래원가는 최초인식하는 공정가치에 가산(차감)한다. ":{},
        "6.13	최초인식시 금융상품의 공정가치는 일반적으로 거래가격(자산의 경우에는 제공한 대가의 공정가치, 부채의 경우에는 수취한 대가의 공정가치)이다. 장기연불조건의 매매거래, 장기금전대차거래 또는 이와 유사한 거래에서 발생하는 채권․채무로서 명목금액과 공정가치의 차이가 유의적인 경우에는 이를 공정가치로 평가한다. 한편, 제공하거나 수취한 대가에 금융상품이 아닌 다른 것에 대한 대가가 포함되었다면 그 금융상품의 공정가치는 시장가격으로 평가하되 시장가격이 없는 경우에는 평가기법(현재가치평가기법 포함)을 사용하여 공정가치를 추정한다. ":{},
        "6.13의2	제공하거나 수취한 대가에 금융상품이 아닌 다른 것에 대한 대가가 포함되었더라도, 다음의 경우에는 거래가격 전체를 금융상품에 해당하는 것으로 볼 수 있다. ":{
            "⑴	자금의 사용에 따른 반대 급부(예를 들어 생산물 공급가액의 제약 등)를 부과하거나 제공하는 자금의 조달과 사용의 연계성이 확실한 경우":{},
            "⑵	임대차보증금 ":{},
        },
        "6.13의3	둘 이상의 금융상품을 일괄하여 매입(예: 분리형 신주인수권부사채의 매입)한 경우에는 공정가치를 보다 신뢰성 있게 측정할 수 있는 금융상품의 공정가치를 우선 인식한 후 매입가액의 잔여액으로 나머지 금융상품을 인식한다. 둘 이상의 금융상품 중 공정가치를 보다 신뢰성 있게 측정할 수 있는 금융상품을 식별할 수 없는 경우에는 각각의 공정가치를 기준으로 거래가격을 안분하여 인식한다.":{},
    },
    "금융자산과 금융부채의 후속 측정 6.14-":{
        "6.14	금융자산이나 금융부채는 다음을 제외하고는 상각후원가로 측정한다. ":{
            "⑴	이 장의 제2절~제4절에서 규정하고 있는 유가증권, 파생상품 및 채권․채무조정. 이에 대하여는 각 절의 규정을 적용한다. ":{},
            "⑵	당기손익인식지정항목. 이러한 금융자산 또는 금융부채는 이 장의 제2절 ‘유가증권’ 문단 6.30~6.31의 단기매매증권의 후속측정방법을 준용하여 측정한다. 다음의 항목을 당기손익인식항목으로 지정할 수 있다.":{
                "㈎	공정가치로 평가하여 공정가치 변동을 당기손익에 반영하지 않는다면, 분리하여야 하는 파생상품을 포함하는 복합계약(이 장 제3절 ‘파생상품’ 문단 6.46~6.47 참조)":{},
                "㈏	벤처캐피탈, 뮤추얼펀드, 기타 이와 유사한 기업이 소유하는 유가증권(제8장 ‘지분법’ 문단 8.2 참조) ":{},
            },
        },
        "6.14의2 	금융상품의 현금흐름에 대한 추정 변경 또는 재협상 등으로 현금흐름이 변경되는 경우에는 실제 현금흐름과 변경된 계약상 현금흐름을 반영하여 해당 금융자산의 순장부금액이나 금융부채 상각후원가를 조정한다. 다만, 해당 금융상품이 제4절 채권·채무조정에 해당되거나 대손상각비(손상차손)와 관련된 추정 변경 또는 문단 6.9에 해당되는 경우는 제외한다.":{},
        "6.15 	공정가치의 최선의 추정치는 활성시장에서 공시되는 가격이다. 금융상품에 대한 활성시장이 없다면, 공정가치는 평가기법을 사용하여 결정한다. 평가기법을 사용하는 목적은 측정일 현재 독립된 당사자 사이의 정상적인 거래에서 발생할 수 있는 거래가격을 결정하는 데 있다. 평가기법은 ⑴ 합리적인 판단력과 거래의사가 있는 독립된 당사자 사이의 최근 거래를 사용하는 방법, ⑵ 실질적으로 동일한 다른 금융상품의 현행 공정가치를 이용할 수 있다면 이를 참조하는 방법, ⑶ 현금흐름할인방법과 옵션가격결정모형을 포함한다. 금융상품의 가격을 결정하는 데 시장참여자가 일반적으로 사용하는 평가기법이 있으며, 그 평가기법이 실제 시장거래가격에 대해 신뢰할 만한 추정치를 제공한다는 사실을 제시할 수 있다면, 그 평가기법을 사용한다. 선택한 평가기법은 시장정보를 최대한 사용하고, 기업특유정보를 최소한으로 사용하여야 한다. 이러한 평가기법은 시장참여자가 가격을 결정하는 데 고려하는 모든 요소를 포함하며, 금융상품의 가격을 결정하기 위하여 일반적으로 적용되는 경제학적 방법론에 부합한다. 주기적으로 평가기법을 조정하며 동일한 금융상품(즉 수정하거나 재구성하지 아니함)의 관측가능한 현행 시장거래가격을 사용하거나 관측가능한 시장자료에 기초하여 그 타당성을 검토한다.":{},
        "6.16 	공정가치의 정의는 청산하거나, 사업규모를 중요하게 축소하거나 또는 불리한 조건으로 거래할 의도나 필요가 없는 상태인 계속기업가정을 전제로 한다. 따라서 공정가치는 강제된 거래, 비자발적인 청산 또는 재무적 어려움으로 인한 매도에서 수취하거나 지급하는 금액이 아니다. 그러나 공정가치는 금융상품의 신용수준을 반영한다.":{},
        "6.17	<삭제> ":{},
    },
    "대손충당금 6.17의2-":{
        "6.17의2 	회수가 불확실한 금융자산(제2절 ‘유가증권’ 적용대상 금융자산은 제외)은 합리적이고 객관적인 기준에 따라 산출한 대손추산액을 대손충당금으로 설정한다.":{
            "⑴ 대손추산액에서 대손충당금잔액을 차감한 금액을 대손상각비로 계상한다. 이 경우 상거래에서 발생한 매출채권에 대한 대손상각비는 판매비와 관리비로 처리하고, 기타 채권에 대한 대손상각비는 영업외비용으로 처리한다.":{},
            "⑵ 회수가 불가능한 채권은 대손충당금과 상계하고 대손충당금이 부족한 경우에는 그 부족액을 대손상각비로 처리한다.":{},
        },
    },
    "주석 공시 6.18-":{
        "6.18	다음 사항을 주석으로 공시한다. ":{
            "⑴ <삭제>":{},
            "⑵ 현금 등 금융자산을 인도하여 결제하는 금융부채의 종류별 만기분석 및 유동성위험을 관리하는 방법":{},
            "⑶ 현재가치 평가에 적용한 이자율, 이자율의 산정방법, 기간 및 회계처리방법 등":{},
            "⑷ 공정가치로 평가하는 금융상품의 주요 종류별로 공정가치 측정방법과 공정가치를 결정할 때 사용한 주요 가정(예: 할인율, 중도상환율) 등 재무제표이용자가 공정가치로 측정된 회계정보를 이해하는 데 유용한 정보":{},
        },
        "6.18의2	금융자산을 양도하거나 금융자산을 담보로 차입한 경우에는 양도(또는 담보제공)내역, 양도(또는 담보제공)조건 등 그 내역을 주석으로 기재하여야 한다.":{},
    },
    "부록A. 적용보충기준": {
        "제1절 공통사항": {
            "...": {},
        },
    },
    "일반기업회계기준 제6장 ‘금융자산·금융부채’의 제1절 ‘공통사항’의 부록": {
        "": {},
        "": {},
        "": {},
        "": {},
        "": {},
        "": {},
        "": {},
        "": {},
        "": {},
        "": {},
        "": {},
        "": {},
    },
}
유가증권={
    "6.19	유가증권과 관련하여 이 절에서 정하지 않은 내용은 이 장의 제1절의 규정을 따른다.":{},
    "유가증권의 정의 6.20-":{
        "6.20	‘유가증권’은 재산권을 나타내는 증권을 말하며, 실물이 발행된 경우도 있고, 명부에 등록만 되어 있을 수도 있다. 유가증권은 적절한 액면금액단위로 분할되고 시장에서 거래되거나 투자의 대상이 된다. 유가증권에는 지분증권과 채무증권이 포함된다.":{},
    },
    "유가증권의 최초인식 6.21-":{
        "6.21	유가증권의 최초 인식에 관한 규정은 이 장의 제1절 ‘공통사항’의 문단 6.4를 따른다.":{},
    },
    "유가증권의 분류 6.22-":{
        "6.22 	유가증권은 취득한 후에 만기보유증권, 단기매매증권, 그리고 매도가능증권 중의 하나로 분류한다. ": {},
        "6.23 	만기가 확정된 채무증권으로서 상환금액이 확정되었거나 확정이 가능한 채무증권을 만기까지 보유할 적극적인 의도와 능력이 있는 경우에는 만기보유증권으로 분류한다. ": {},
        "6.24 	다음의 경우에는 만기까지 채무증권을 보유할 적극적인 의도가 없는 것으로 본다.": {
            "⑴ 만기까지의 보유여부를 분명히 정하고 있지 아니한 경우": {},
            "⑵ 시장이자율 또는 위험의 변동, 필요한 유동성 수준의 변화(예: 은행의 경우 예금인출 또는 대출수요의 증가에 따른 유동성 확보가 필요할 때), 다른 대체적인 자산의 투자가능성이나 수익률의 변동, 자금조달원천과 조건의 변화 또는 외화위험의 변화 등의 상황이 발생할 경우에는 매도할 의도가 있는 채무증권. 다만, 위와 같은 요인이 급격하게 변동하는 등 합리적으로 예상할 수 없는 비반복적인 상황 변동에 대응하여 매도하는 경우를 제외한다.": {},
            "⑶ 채무증권의 발행자가 채무증권의 상각후취득원가보다 현저하게 낮은 금액으로 중도상환권을 행사할 수 있는 경우": {},
        },
        "6.25 	당 회계연도와 직전 2개 회계연도 중에, 만기보유증권을 만기일 전에 매도하였거나 발행자에게 중도상환권을 행사한 사실이 있는 경우, 또는 만기보유증권의 분류를 매도가능증권으로 변경한 사실이 있다면(단 이러한 사실들에 해당하는 금액이 만기보유증권 총액과 비교하여 경미한 금액인 경우는 제외), 보유 중이거나 신규로 취득하는 모든 채무증권은 만기보유증권으로 분류할 수 없다.": {},
        "6.26 	다만 다음 중 하나에 해당하는 경우에는 문단 6.25를 적용하지 아니한다.": {
            "⑴ 만기까지 잔여기간이 얼마 남지 않아서 시장이자율의 변동이 공정가치에 중요한 영향을 미치지 않을 시점(예: 3개월 이내)에 매도하거나, 또는 중도상환권 행사일까지의 잔여기간이 얼마 남지 않은 시점(예: 3개월 이내)에 매도하는 경우 ": {},
            "⑵ 채무증권의 액면금액 거의 대부분(예: 85% 이상)을 회수한 후에 그 채무증권을 매도하는 경우": {},
            "⑶ 채무증권 발행자의 신용상태가 크게 하락하였다는 증거가 발견되는 경우": {},
            "⑷ 법규 등의 변경에 의하여 불가피하게 매도하는 경우": {},
            "⑸ 중요한 기업결합 또는 주요 사업부문의 매각이 있을 때 기존의 이자율 위험관리 또는 신용위험정책을 유지하기 위하여 채무증권을 매도하는 경우": {},
            "⑹ 합리적으로 예상할 수 없는 비반복적인 상황 변동에 대응하여 그 채무증권을 매도하는 경우": {},
        },
        "6.27 	지분증권과 만기보유증권으로 분류되지 아니하는 채무증권은 단기매매증권과 매도가능증권 중의 하나로 분류한다. ": {
            "⑴ 단기매매증권은 주로 단기간 내의 매매차익을 목적으로 취득한 유가증권으로서 매수와 매도가 적극적이고 빈번하게 이루어지는 것을 말한다.": {},
            "⑵ 단기매매증권이나 만기보유증권으로 분류되지 아니하는 유가증권은 매도가능증권으로 분류한다.": {},
        },
    },
    "유가증권의 최초 측정과 후속 측정 6.28-":{
        "6.28 	유가증권의 최초 측정에 대해서는 문단 6.12를 적용한다. ":{},
        "6.29 	만기보유증권은 상각후원가로 평가하여 재무상태표에 표시한다. 만기보유증권을 상각후원가로 측정할 때에는 장부금액과 만기액면금액의 차이를 상환기간에 걸쳐 유효이자율법에 의하여 상각하여 취득원가와 이자수익에 가감한다.": {},
        "6.30 	단기매매증권과 매도가능증권은 공정가치로 평가한다. 다만, 매도가능증권 중 시장성이 없는 지분증권의 공정가치를 신뢰성있게 측정할 수 없는 경우에는 취득원가로 평가한다. ": {},
    },
    "공정가치의 변동 6.31-":{
        "6.31 	단기매매증권에 대한 미실현보유손익은 당기손익항목으로 처리한다. 매도가능증권에 대한 미실현보유손익은 기타포괄손익누계액으로 처리하고, 당해 유가증권에 대한 기타포괄손익누계액은 그 유가증권을 처분하거나 손상차손을 인식하는 시점에 일괄하여 당기손익에 반영한다. ": {},
    },
    "손상차손 6.32-":{
        "6.32 	유가증권으로부터 회수할 수 있을 것으로 추정되는 금액(이하 “회수가능액”이라 한다)이 채무증권의 상각후원가 또는 지분증권의 취득원가보다 작은 경우에는, 손상차손을 인식할 것을 고려하여야 한다. 손상차손의 발생에 대한 객관적인 증거가 있는지는 보고기간종료일마다 평가하고 그러한 증거가 있는 경우에는 손상차손이 불필요하다는 명백한 반증이 없는 한, 회수가능액을 추정하여 손상차손을 인식하여야 한다. 손상차손금액은 당기손익에 반영한다.": {},
        "6.33 	손상차손의 회복이 손상차손 인식 후에 발생한 사건과 객관적으로 관련된 경우에는 다음과 같이 회계처리한다.": {
            "⑴ 만기보유증권 또는 원가로 평가하는 매도가능증권의 경우에는 회복된 금액을 당기이익으로 인식하되, 회복 후 장부금액이 당초에 손상차손을 인식하지 않았다면 회복일 현재의 상각후원가(매도가능증권의 경우, 취득원가)가 되었을 금액을 초과하지 않도록 한다. ":{},
            "⑵ 공정가치로 평가하는 매도가능증권의 경우에는 이전에 인식하였던 손상차손 금액을 한도로 하여 회복된 금액을 당기이익으로 인식한다. ":{},
        },
    },
    "유가증권의 재분류 6.34-":{
        "6.34	유가증권의 보유의도와 보유능력에 변화가 있어 재분류가 필요한 경우에는 다음과 같이 처리한다.": {
            "⑴ 단기매매증권은 다른 범주로 재분류할 수 없으며, 다른 범주의 유가증권의 경우에도 단기매매증권으로 재분류할 수 없다. 다만, (일반적이지 않고 단기간 내에 재발할 가능성이 매우 낮은 단일한 사건에서 발생하는) 드문 상황에서 더 이상 단기간 내의 매매차익을 목적으로 보유하지 않는 단기매매증권은 매도가능증권이나 만기보유증권으로 분류할 수 있으며, 단기매매증권이 시장성을 상실한 경우에는 매도가능증권으로 분류하여야 한다.": {},
            "⑵ 매도가능증권은 만기보유증권으로 재분류할 수 있으며 만기보유증권은 매도가능증권으로 재분류할 수 있다.": {},
            "⑶ 유가증권과목의 분류를 변경할 때에는 재분류일 현재의 공정가치로 평가한 후 변경한다. ": {},
        },
    },
    "유가증권의 양도 6.34의2-":{
        "6.34의2	유가증권의 양도로 유가증권 보유자가 유가증권의 통제를 상실한 때에는 그 유가증권을 재무상태표에서 제거한다. 유가증권의 통제를 상실한 경우란 유가증권의 경제적 효익을 획득할 수 있는 권리를 전부 실현한 때, 그 권리가 만료된 때, 또는 그 권리를 처분한 때를 말한다. ": {},
        "6.34의3	유가증권 보유자가 유가증권에 대한 통제를 상실하지 않고 유가증권을 양도하는 경우, 당해 거래는 담보차입거래로 본다.": {},
        "6.34의4	유가증권에 대한 통제를 상실한 때에는 다음 ⑴과 ⑵의 차이금액에, 기타포괄손익누계액에 포함되어 있는 미실현보유이익을 가산하고 미실현보유손실을 차감한 금액을 당기손익으로 처리한다. 즉, 미실현보유손익은 이 시점에 실현된 것으로 본다.": {
            "⑴ 유가증권을 양도한 대가로 받았거나 받을 금액": {},
            "⑵ 유가증권의 장부금액": {},
        },
    },
    "주석 공시 6.35-":{
        "6.35 	이 장 제1절의 ‘공통사항’에서 요구되는 공시사항에 추가하여, 다음을 공시한다.":{
            "⑴ 매도가능증권의 공정가치를 측정할 수 없는 이유와 내용 ": {},
            "⑵ 담보로 제공한 유가증권 ": {},
            "⑶ 지분증권과 국채 및 공채 등으로 세분한 종류별 금액 ": {},
            "⑷ 보고기간말 현재 계약상의 만기일에 관한 정보 ": {},
            "⑸ 유가증권의 원가결정방법": {},
            "⑹ 미실현보유손익의 변동내용과 처분에 따른 실현손익의 내용 ": {},
            "⑺ 총이자수익금액 ": {},
            "⑻ 손상차손과 회복의 내용 ": {},
            "⑼ 손상차손을 인식한 채무증권에 대한 미수이자금액 ": {},
            "⑽ 재매수계약의 내용 ": {},
            "⑾ 재분류에 관한 정보": {},
        },
    },
    "부록A. 적용보충기준": {
        "제2절 유가증권": {
            "유가증권의 정의": {},
            "유가증권의 분류": {},
            "공정가치의 변동": {},
            "유가증권의 양도": {},
            "손상차손": {
                "상각후원가 또는 취득원가로 평가하는 유가증권의 손상차손": {},
                "공정가치로 평가하는 유가증권의 손상차손": {},
                "": {},
                "": {},
                "": {},
            },
            "유가증권의 재분류": {},
            "다른 자산과의 교환": {},
            "주석 공시": {},
            "용어의 정의": {
                "": {},
                "": {},
                "": {},
                "": {},
                "": {},
                "": {},
                "": {},
                "": {},
                "": {},
                "": {},
                "": {},
                "": {},
            },
        },
    },
    "일반기업회계기준 제6장 ‘금융자산·금융부채’의 제2절 ‘유가증권’의 부록": {
        "": {},
        "": {},
        "": {},
        "": {},
        "": {},
        "": {},
        "": {},
        "": {},
        "": {},
        "": {},
        "": {},
        "": {},
    },
}
파생상품={
    "파생상품의 정의 6.36-":{
        "6.36	파생상품은 다음의 요건을 모두 충족하는 금융상품 또는 이와 유사한 계약을 말한다.":{
            "⑴	기초변수 및 계약단위의 수량(또는 지급규정)이 있어야 한다. 다만, 기초변수가 물리적 변수(예: 온도, 강우량 등)인 경우로서 해당 금융상품 등이 거래소에서 거래되지 않는 경우는 제외되며 비금융변수인 경우에는 계약의 당사자에게 특정되지 아니하여야 한다.": {},
            "⑵	최초 계약시 순투자금액을 필요로 하지 않거나 시장가격변동에 유사한 영향을 받는 다른 유형의 거래보다 적은 순투자금액을 필요로 해야 한다.": {},
            "⑶	차액결제가 가능해야 한다.": {},
        },
        "6.37	문단 6.36에서 차액결제가 가능한 경우는 다음 중 하나를 충족하는 경우로 한다.":{
            "⑴	거래당사자는 파생상품의 계약단위의 수량을 직접 인도할 의무가 없다.": {},
            "⑵	만기이전에 시장에서의 거래 등에 의해 차액결제가 가능하다.": {},
            "⑶	거래당사자가 파생상품의 약정내용에 따라 계약단위의 수량을 직접 인도해야 할지라도 해당 자산은 즉시 현금화 될 수 있다.": {},
        },
        "6.38	다만, 다음의 경우에는 위 6.36⑴과 ⑵ 및 6.37⑶의 요건을 모두 충족하더라도 이 절의 적용대상이 아니다.":{
            "⑴	거래소시장 또는 장외시장에서 매매계약 체결후 해당 시장규정에 따라 일정기간내에 결제가 이루어지는 정형화된 유가증권 거래": {},
            "⑵	거래일 이후 2영업일 이내에 결제가 이루어지는 현물환거래(미결제 현물환거래)": {},
            "⑶	정상 영업활동 과정에서 발생하는 자산(금융상품 또는 파생상품인 경우는 제외)의 매입 또는 매출계약": {},
        },
        "6.39	파생상품은 해당 계약에 따라 발생된 권리와 의무를 자산․부채로 인식하며 공정가치로 평가한다. 파생상품에 대한 일반적인 회계처리는 다음과 같다.": {
            "⑴	위험회피수단으로 지정되지 않고 매매목적 등으로 보유하고 있는 파생상품의 평가손익은 당기손익으로 인식하고, 위험회피수단으로 지정된 파생상품의 평가손익은 위험회피유형별로 이 절에서 정하는 바에 따라 처리한다.": {},
            "⑵	금융기관이나 거래소에 지급한 거래수수료는 위험회피회계의 적용여부와 관계없이 발생시점에 전액을 비용으로 인식하며, 위탁증거금은 유동자산으로 처리한다. 그러나, 스왑거래에서 발생하는 최초수수료(Front end fee)나 최종수수료(Back end fee)는 계약체결시점의 스왑 공정가치에 해당하는 금액이므로 최초 계약체결시 자산 또는 부채로 인식하여야 한다.": {},
        },
        "6.40	파생상품은 다음과 같이 재무제표에 표시한다. ":{
            "⑴	파생상품의 공정가치 및 평가손익 금액은 그 성질이나 금액이 유의적인 경우 파생상품별로 구분하여 재무상태표 및 손익계산서에 기재한다.":{},
            "⑵	파생상품의 계약별 공정가치를 자산 또는 부채로 인식하는 경우, 해당 자산과 부채는 총액으로 표시하며 이를 상계하지 않는다. 또한 파생상품계약별 평가손실과 평가이익도 총액으로 표시하며 이를 상계하지 않는다.":{},
        },
    },
    "내재파생상품 6.41-":{
        "6.41	내재파생상품은 파생상품이 아닌 주계약을 포함하는 복합상품의 구성요소이며, 복합상품의 현금흐름 중 일부를 독립적인 파생상품의 경우와 유사하게 변동시킨다. 이러한 내재파생상품은 다음의 요건을 모두 충족하는 경우 주계약과 분리하여 이 절에 따라 회계처리한다. ": {
            "⑴	내재파생상품의 경제적 특성 및 위험도와 주계약의 경제적 특성 및 위험도 사이에 ‘명확하고 밀접한 관련성’이 없는 경우": {},
            "⑵	주계약과 내재파생상품으로 이루어진 복합계약이 일반기업회계기준에 따른 공정가치 평가(당기손익 반영) 대상이 아닌 경우": {},
            "⑶	내재파생상품과 동일한 조건의 독립된 파생상품이 이 절에 따라 파생상품으로 분류되는 경우": {},
        },
        "6.42	내재파생상품을 분리한 이후, 주계약이 금융상품인 경우에는 주계약을 이 장에 따라 회계처리하고, 주계약이 금융상품이 아닌 경우에는 다른 적절한 일반기업회계기준에 따라 회계처리한다. 이때 계약조건에 기초하여 내재파생상품의 공정가치를 신뢰성 있게 결정할 수는 없으나 복합상품의 공정가치와 주계약의 공정가치를 결정할 수 있는 경우에는 그 차이를 내재파생상품의 공정가치로 결정한다.": {},
        "6.43	기업은 최초로 계약당사자가 되는 시점에 내재파생상품을 주계약과 분리하여 파생상품으로 회계처리하여야 하는지를 검토한다. 또한, 다음의 경우를 제외하고는 후속적인 재검토는 금지된다. ": {
            "⑴	계약조건이 변경되어 계약상 요구되었던 현금흐름이 유의적으로 수정되는 경우 ": {},
            "⑵	유가증권을 단기매매증권에서 다른 범주로 재분류하는 경우": {},
            "⑶	기초자산인 비상장주식이 상장되어 내재파생상품이 파생상품의 정의를 충족하게 되는 경우": {},
        },
        "6.44	현금흐름이 유의적으로 수정되었는지는 다음을 모두 고려하여 결정한다. ": {
            "⑴	내재파생상품, 주계약 또는 양자 모두의 기대현금흐름이 변화된 정도": {},
            "⑵	이전에 기대되던 계약상 현금흐름에 비추어볼 때 현금흐름의 변화가 유의적인지의 여부": {},
        },
        "6.45	유가증권을 단기매매증권에서 다른 범주로 재분류하는 경우에 내재파생상품을 주계약과 분리하여 파생상품으로 회계처리하여야 하는지에 대한 검토는 다음 중 나중 시점에 존재했던 상황에 근거하여 이루어져야 한다. ": {
            "⑴	기업이 최초로 계약 당사자가 된 시점": {},
            "⑵	계약조건이 변경되어 계약상 요구되었던 현금흐름이 유의적으로 수정되는 시점": {},
            "이러한 검토에 있어서 이 절의 문단 6.41⑵는 적용되지 않는다(즉 당해 복합계약을 공정가치로 측정하여 그 변동을 당기손익에 반영하는 처리를 하지 않았던 것처럼 간주한다). 만일 기업이 이러한 검토를 할 수 없다면 복합계약 전체를 단기매매증권으로 계속 분류한다.": {},
            "": {},
        },
        "6.46	이 절에 따라 주계약과 분리하여야 하는 내재파생상품이 취득시점이나 후속재무보고기간말에 주계약과 분리하여 측정할 수 없는 경우에는 최초인식시점에 복합계약 전체를 당기손익인식지정항목으로 지정한다. 한편 단기매매증권으로 분류된 복합계약을 다른 범주로 재분류하는 경우 분리되어야 하는 내재파생상품을 별도로 측정할 수 없다면 그러한 재분류는 금지된다. 이 경우에는 복합계약 전체를 단기매매증권으로 계속 분류한다.": {},
        "6.47	한편 하나 이상의 내재파생상품을 포함하는 계약의 경우에는 최초인식시점에 복합계약 전체를 공정가치로 평가하여 그 변동을 당기손익으로 인식하도록 지정할 수 있다. 다만, 다음의 경우는 제외한다. ": {
            "⑴	내재파생상품으로 인해 변경되는 복합계약의 현금흐름의 변동이 유의적이지 아니한 경우": {},
            "⑵	유사한 복합계약을 고려할 때, 별도로 상세하게 분석하지 않아도 내재파생상품의 분리가 금지된 것을 명백하게 알 수 있는 경우. 이러한 복합계약의 예로는 차입자가 상각후원가에 근사한 금액으로 중도상환할 수 있는 권리가 내재된 대출채권을 들 수 있다.": {},
        },
    },
    "위험회피회계 6.48-": {
        "위험회피회계의 의의와 유형 6.48-": {
            "6.48	위험회피대상항목과 위험회피수단 사이에 위험회피관계가 설정된 이후 이러한 위험회피활동이 재무제표에 적절히 반영될 수 있도록 해당 위험회피대상항목 및 위험회피수단에 대하여 기존의 회계처리기준과는 다른 별도의 회계처리방법을 적용한다.": {},
            "6.49	위험회피는 공정가치위험회피, 현금흐름위험회피 및 해외사업장순투자의 위험회피로 구분할 수 있다.": {
                "⑴	공정가치위험회피는 특정위험으로 인한 자산, 부채 및 확정계약의 공정가치변동위험을 상계하기 위하여 파생상품 등을 이용하는 것이다.": {},
                "⑵	현금흐름위험회피는 특정위험으로 인한 자산, 부채 및 예상거래의 미래현금흐름변동위험을 상계하기 위하여 파생상품 등을 이용하는 것이다. ": {},
                "⑶	해외사업장순투자의 위험회피는 해외사업장의 순자산에 대한 회사의 지분 해당 금액에 대하여 위험을 회피하고자 파생상품 등을 이용하는 것이다.": {},
            },
        },
        "위험회피대상항목 6.50-": {
            "6.50	위험회피대상항목은 하나의 자산, 부채, 확정계약, 예상거래 또는 해외사업장순투자나 유사한 위험의 특성을 갖는 자산, 부채, 확정계약, 예상거래 또는 해외사업장순투자의 집합으로서 개별적으로 식별가능해야 한다.": {},
            "6.51	위험회피대상 예상거래는 그 발생가능성이 매우 높아야 하며 제3자와의 외부거래이어야 한다. 그러나, 연결실체 내의 개별기업의 거래는 연결실체 내의 개별기업의 개별재무제표에서는 위험회피대상항목으로 지정할 수 있으며 연결재무제표에서는 위험회피대상항목으로 지정할 수 없다. 다만, 지배기업 및 해외에 소재하고 있는 종속기업간의 로열티지급 예상거래 또는 예상매출거래 등에 대해서는 연결재무제표상 위험회피대상거래로 지정할 수 있다. 또, 연결재무제표에서 전부 제거되지 않는 외환손익에 노출되어 있다면, 연결실체 내의 화폐성항목(예: 종속기업 사이의 채무와 채권)의 외화위험은 연결재무제표에서 위험회피대상항목으로 지정할 수 있다. 즉 연결실체 내의 화폐성항목이 서로 다른 기능통화를 갖는 연결실체 내의 개별기업 사이에서 거래되는 경우, 연결실체 내의 화폐성항목의 외환손익이 연결재무제표에서 전부 제거되는 것은 아니다. 또 예상거래가 당해 거래를 체결한 기업의 기능통화가 아닌 통화로 표시되며 외화위험이 연결당기손익에 영향을 미친다면, 발생가능성이 매우 높은 연결실체내 예상거래의 외화위험은 연결재무제표에서 위험회피대상항목으로 지정할 수 있다. ": {},
            "6.52	위험회피대상항목의 경우 위험회피대상항목의 전부 또는 일부에 대한 위험회피도 인정되며, 유사한 자산, 부채 항목들의 전부 또는 이들 항목의 일부로 구성된 포트폴리오에 대한 위험회피도 인정된다. 또한 위험회피대상 예상거래는 개별거래뿐만 아니라 개별거래의 합도 될 수 있다.": {},
            "6.53	위험회피대상항목이 비금융상품이거나 비금융상품 관련 예상거래인 경우 회피대상위험은 전체 공정가치 변동위험이나 외화위험이어야 한다. 이에 반하여 위험회피대상항목이 금융상품이거나 금융상품 관련 예상거래인 경우에는 전체 공정가치 변동위험뿐만 아니라 시장이자율변동위험, 환율변동위험, 신용변화위험 중 하나 또는 이들 위험 항목의 결합에 따른 공정가치 변동위험도 회피대상위험이 될 수 있다.": {},
            "6.54	특정위험으로 인한 공정가치 평가손익을 당기손익으로 인식하는 자산․부채는 위험회피 대상항목에서 제외하며, 위험회피대상 예상거래 중 기존에 보유중인 자산을 회수, 매출 및 처분하거나 기존의 부채를 상환하는 거래로서 특정위험으로 인한 해당 기존 자산․부채의 공정가치 평가손익을 당기손익으로 인식하는 경우에는 위험회피대상 예상거래에서 제외한다. 그러나, 손상차손 등을 당기비용으로 인식하는 경우와 외화환산손익을 당기손익으로 인식하는 경우는 이 절에서 공정가치 평가손익을 당기손익으로 인식하는 것으로 보지 아니한다.": {},
            "6.55	지분법 평가대상 투자주식은 공정가치위험회피의 대상항목이 될 수 없다.": {},
            "6.56	외화공정가치 변동위험에 노출된 기존 자산․부채도 위험회피대상항목이 될 수 있다. 다만, 외화표시 투자주식은 해당 투자주식이 거래소시장 또는 장외시장에서 원화로 거래되지 않고 배당금도 원화로 지급되지 않는 경우에 한하여 외화공정가치 위험회피대상항목이 될 수 있다.": {},
            "6.57	만기보유목적 투자채권의 신용위험 또는 외화위험에 대한 위험회피는 인정되나 이자율변동위험에 대한 위험회피는 인정되지 않는다.": {},
            "6.58	현금흐름위험회피의 위험회피대상항목이 외화표시 기존 자산․부채인 경우에는 위험회피대상항목의 원화현금흐름의 모든 변동성이 위험회피의 효과로 제거되어야 한다.": {},
            "6.59	확정계약의 외화위험회피에는 공정가치위험회피회계 또는 현금흐름위험회피회계를 적용할 수 있다.": {},
        },
        "위험회피수단 6.60-":{
            "6.60	파생상품은 위험회피수단으로 지정할 수 있으며 비파생금융자산이나 비파생금융부채는 외화위험회피에만 위험회피수단으로 지정할 수 있다. 다만 공정가치를 신뢰성있게 측정할 수 없기 때문에 공정가치를 장부금액으로 하지 않는 공시가격이 없는 지분상품은 위험회피수단으로 지정할 수 없다.": {},
            "6.61	파생상품을 위험회피수단으로 지정하는 경우, 파생상품의 전부 또는 비례적 부분을 지정할 수도 있고, 둘 이상의 파생상품 또는 이들 파생상품의 부분적인 결합을 지정할 수도 있다. 외화위험의 경우에는 둘 이상의 비파생금융상품, 이들 비파생금융상품의 비례적 부분의 결합 또는 파생상품과 비파생금융상품의 결합 또는 비례적 부분의 결합을 위험회피수단으로 지정할 수 있다. ": {},
            "6.62	파생상품 등의 잔여기간(신규 계약한 파생상품 등의 경우에는 계약시점부터 만기까지의 기간) 중 일부기간만을 위험회피수단으로 지정할 수 없으며, 잔여기간 전체를 위험회피수단으로 지정해야 한다.": {},
            "6.63	연결재무제표를 작성하는 경우 연결실체내 기업간에 이루어진 외화 파생상품 거래는 해당 거래기업 일방이 특수관계자가 아닌 제3자와 그 부담한 위험을 상계하기 위하여 파생상품계약을 체결한 경우 위험회피수단이 될 수 있다.": {},
            "6.64	연결재무제표를 작성하는 경우 연결실체내 기업 일방이 예상 외화거래에 대한 외화 현금흐름위험을 회피하기 위하여 연결회사간에 외화 금융상품거래가 이루어졌을 때, 해당 거래로 인하여 외화 현금흐름위험을 부담하게 된 연결실체내 기업이 특수관계자가 아닌 제3자와 그 부담한 위험을 상계하기 위한 금융상품계약을 체결한 경우 연결실체내 기업간의 금융상품거래는 예상외화거래에 대한 위험회피수단으로 본다.": {},
            "6.65	예상거래의 외화 현금흐름위험을 회피하기 위한 외화 위험회피수단 거래의 당사자는 해당 예상거래의 외화 현금흐름위험에 직접 노출되어 있어야 한다(이는 연결재무제표 작성시 연결회사간에도 적용된다).": {},
        },
        "위험회피회계의 적용조건 6.66-": {
            "6.66	위험회피회계를 적용하기 위해서는 다음의 조건을 모두 충족하여야 한다.": {
                "⑴	위험회피수단을 최초 지정하는 시점에 위험회피 종류, 위험관리의 목적, 위험회피전략을 공식적으로 문서화하여야 하며, 이 문서에는 위험회피대상항목, 위험회피수단, 위험의 속성, 위험회피수단의 위험회피효과에 대한 평가방법 등을 포함시켜야 한다.": {},
                "⑵	위험회피수단으로 최초 지정된 이후에 높은 위험회피효과를 기대할 수 있어야 한다.": {},
                "⑶	현금흐름위험회피에서 위험회피대상 예상거래는 발생가능성이 매우 높아야 하며, 궁극적으로 당기손익에 영향을 미치는 현금흐름 변동에 노출되어 있어야 한다.": {},
                "⑷	위험회피효과를 신뢰성 있게 측정할 수 있다. 즉, 회피대상위험으로 인한 위험회피대상항목의 공정가치나 현금흐름과 위험회피수단의 공정가치를 신뢰성 있게 측정할 수 있다.": {},
                "⑸	위험회피효과를 위험회피기간에 계속적으로 평가하며 위험회피로 지정된 재무보고기간 전체에 걸쳐 실제로 높은 위험회피효과가 있었는지 결정하여야 한다.": {},
            },
        },
        "공정가치위험회피회계 6.67-": {
            "6.67	공정가치위험회피회계는 특정위험으로 인한 위험회피대상항목의 공정가치 변동이 위험회피수단인 파생상품 등의 공정가치 변동과 상계되도록, 특정위험으로 인한 위험회피대상항목의 평가손익을 위험회피수단의 평가손익(파생상품이 아닌 금융상품을 위험회피수단으로 지정한 경우에는 외화환산손익)과 동일한 회계기간에 대칭적으로 인식하도록 하는 것을 말한다.": {},
            "6.68	공정가치위험회피가 회계기간에 문단 6.66의 조건을 충족하는 경우에는, 다음과 같이 회계처리한다. ": {
                "⑴	위험회피수단의 평가손익을 해당 회계연도에 당기손익으로 처리한다.": {},
                "⑵	특정위험으로 인한 위험회피대상항목의 평가손익은 전액을 해당 회계연도에 당기손익으로 처리한다. ": {},
                "⑶	미인식 확정계약을 위험회피대상항목으로 지정한 경우, 회피대상위험으로 인한 확정계약의 후속적인 공정가치의 누적변동분은 자산이나 부채로 인식하고, 이에 상응하는 손익은 당기손익으로 인식한다. 위험회피수단의 공정가치 변동도 당기손익으로 인식한다.": {},
                "⑷	외화 위험회피대상항목인 외화표시 자산 또는 부채의 평가손익 중 외화위험으로 인한 부분은 당기손익으로 처리한다. 예를 들어, 외화 위험회피대상항목인 외화표시 투자주식 및 외화표시 투자채권(만기보유목적 투자채권을 제외한다)의 평가손익 중 외화위험으로 인한 부분은 기타포괄손익누계액이 아닌 해당 회계연도의 당기손익으로 처리한다. ":{},
            },
            "6.69	다음 요건 중 하나라도 발생한 경우에는 위험회피회계를 전진적으로 중단해야 한다.": {
                "⑴	위험회피회계의 적용요건 중 하나라도 충족하지 못하게 되는 경우": {},
                "⑵	 위험회피수단인 파생상품 등이 종료, 소멸, 행사된 경우. 이러한 목적상 위험회피수단을 다른 위험회피수단으로 대체하거나 만기연장하는 것이 위험회피전략에 관한 공식적인 문서에 포함되어 있다면, 그 위험회피수단의 대체나 만기연장은 소멸 또는 종료로 보지 아니한다. 또한,  다음 조건을 충족하는 경우, 위험회피수단의 소멸이나 종료가 아니다. ": {
                    "㈎ 법령이나 규정의 결과로 또는 법령이나 규정의 도입으로, 위험회피수단의 당사자들이 원래의 계약상대방을 교체하여 하나 이상의 청산 계약상대방이 각 당사자들의 새로운 계약상대방이 되도록 합의한다. 이러한 목적상 청산 계약상대방은 중앙청산소(종종 ‘청산기구’ 또는 ‘청산기관’으로 지칭됨)이거나 중앙청산소와 청산 효과를 내기 위하여 거래상대방의 역할을 하는 하나의 기업 또는 기업들(예: 청산기구의 청산회원 또는 청산기구의 청산회원의 고객)이다. 그러나, 위험회피수단의 당사자들이 원래의 계약상대방을 각자 다른 계약상대방으로 교체하는 경우라면, 각 당사자들이 동일한 중앙청산소와 청산하는 효과가 있는 경우에만 이 문단이 적용된다.": {},
                    "㈏ 위험회피수단에 대한 그 밖의  변경은 계약상대방의 교체효과를 내기 위해 필요한 경우로 제한된다. 그러한 변경은 원래부터 위험회피수단이 교체된 청산 계약상대방과 청산되었을 경우 기대되는 계약조건과 일관되는 것으로 제한된다. 이러한 변경은 담보요건, 수취채권과 지급채무 잔액의 상계권리 및 부과된 부담금의 변경을 포함한다.": {},
                },
                "⑶	파생상품 등을 더 이상 위험회피수단으로 지정하지 않는 경우": {},
                "다만, 확정계약이 더 이상 확정계약의 정의를 충족시키지 못하기 때문에 확정계약에 대한 공정가치위험회피회계가 중단되는 경우에는, 이미 자산․부채로 인식한 확정계약을 전액 제거하고 이를 당기손익에 반영한다.":{},
            },
            "6.70	유효이자율법을 적용하여 상각후원가로 측정하는 금융상품이 위험회피대상항목인 경우, 공정가치위험회피회계를 적용하는 기간 동안 당기손익으로 인식된 위험회피대상항목의 장부금액 조정분은 상각하여 당기손익으로 인식한다. 상각은 조정액이 발생한 직후 개시할 수 있으며, 늦어도 회피대상위험으로 인한 공정가치 변동에 대한 위험회피대상항목의 조정을 중단하기 전에는 개시하여야 한다. 상각을 개시하는 시점에 다시 계산한 유효이자율에 기초하여 상각한다. ": {},
            "6.71	일반기업회계기준에 따라 손상차손의 인식여부를 고려할 때에는 위험회피대상 자산․부채에 대하여 먼저 공정가치위험회피회계에 따라 평가손익을 인식한 후 손상차손의 인식여부를 고려하여야 한다(선 위험회피회계 적용/후 손상차손 인식).": {},
        },
        "현금흐름위험회피회계 6.72-": {
            "6.72	현금흐름위험회피회계는 특정위험으로 인한 예상거래의 미래현금흐름 변동위험을 감소시키기 위하여 지정된 파생상품의 평가손익(위험회피수단이 파생상품이 아닌 금융상품인 경우에는 외화위험으로 인한 외환차이 변동분을 의미함. 이하 같음) 중 위험회피에 효과적이지 못한 부분은 당기손익으로 인식하고 위험회피에 효과적인 부분은 기타포괄손익누계액으로 인식한 후 예상거래의 종류에 따라 향후 예상거래가 당기손익에 영향을 미치는 회계연도에 당기손익으로 인식하거나, 예상거래발생시 관련 자산․부채의 장부금액에서 가감하는 것을 말한다.": {},
            "6.73	현금흐름위험회피가 회계기간에 문단 6.66의 조건을 충족하는 경우에는, 다음과 같이 회계처리한다. ": {
                "⑴	위험회피수단으로 지정한 파생상품의 평가손익은 다음 ㈎, ㈏ 중 작은 금액을 기타포괄손익누계액으로 인식하고 나머지 금액은 당기손익으로 처리한다.": {
                    "㈎	누적파생상품평가손익에서 위험회피효과 평가시 제외된 부분(예를 들면 옵션의 시간가치 등) 및 문단 6.73⑷, 6.77, 6.78에 따라 전기까지 당기손익으로 인식한 부분을 차감한 금액": {},
                    "㈏	누적파생상품평가손익 중 위험회피대상 예상거래의 누적예상 현금흐름변동액현가와 상계가능한 금액에서 문단 6.73⑷, 6.77, 6.78에 따라 전기까지 당기손익으로 인식한 부분을 차감한 금액": {},
                },
                "⑵	위 ⑴에 따라 누적기준으로 기타포괄손익누계액에 인식해야 할 파생상품평가손익을 산정함으로써 전기 이전에 손익으로 인식한 파생상품평가손익을 당기에 기타포괄손익누계액으로 인식해야하는 경우 동 금액은 당기손익으로 처리한다.": {},
                "⑶	위험회피대상 예상거래가 자산의 취득 또는 부채의 발생인 경우, 위 ⑴과 ⑵에 따라 기타포괄손익누계액으로 인식된 관련 파생상품평가손익은 해당 예상거래가 발생한 시점에 관련 자산 또는 부채의 장부금액에서 가감한다.": {},
                "⑷	위험회피대상 예상거래가 위 ⑶에서 언급한 이외의 경우, 위 ⑴과 ⑵에 따라 기타포괄손익누계액으로 인식된 관련 파생상품평가손익은 위험회피대상 예상거래가 당기손익에 영향을 미치는 회계연도에 손익으로 인식한다. 여기서 당기손익에 영향을 미치는 경우는 미래예상매출, 이자비용 등의 발생 등을 의미한다.": {},
            },
            "6.74	다음 요건 중 하나라도 발생한 경우에는 위험회피회계를 전진적으로 중단해야 한다. ": {
                "⑴	위험회피회계의 적용요건을 하나라도 충족하지 못하게 되는 경우": {},
                "⑵	위험회피수단인 파생상품 등이 청산, 소멸, 행사된 경우. 이러한 목적상 위험회피수단을 다른 위험회피수단으로 대체하거나 만기연장하는 것이 위험회피전략에 관한 공식적인 문서에 포함되어 있다면, 그 위험회피수단의 대체나 만기연장은 소멸 또는 청산으로 보지 아니한다. 또한,  다음 조건을 충족하는 경우, 위험회피수단의 소멸이나 청산이 아니다.": {
                    "㈎ 법령이나 규정의 결과로 또는 법령이나 규정의 도입으로, 위험회피수단의 당사자들이 원래의 계약상대방을 교체하여 하나 이상의 청산 계약상대방이 각 당사자들의 새로운 계약상대방이 되도록 합의한다. 이러한 목적상 청산 계약상대방은 중앙청산소(종종 ‘청산기구’ 또는 ‘청산기관’으로 지칭됨)이거나 중앙청산소와 청산 효과를 내기 위하여 거래상대방의 역할을 하는 하나의 기업 또는 기업들(예: 청산기구의 청산회원 또는 청산기구의 청산회원의 고객)이다. 그러나, 위험회피수단의 당사자들이 원래의 계약상대방을 각자 다른 계약상대방으로 교체하는 경우라면, 각 당사자들이 동일한 중앙청산소와 청산하는 효과가 있는 경우에만 이 문단이 적용된다.": {},
                    "㈏ 위험회피수단에 대한 그 밖의  변경은 계약상대방의 교체효과를 내기 위해 필요한 경우로 제한된다. 그러한 변경은 원래부터 위험회피수단이 교체된 청산 계약상대방과 청산되었을 경우 기대되는 계약조건과 일관되는 것으로 제한된다. 이러한 변경은 담보요건, 수취채권과 지급채무 잔액의 상계권리 및 부과된 부담금의 변경을 포함한다.": {},
                },
                "⑶	파생상품 등을 더 이상 위험회피수단으로 지정하지 않는 경우": {},
            },
            "6.75	현금흐름위험회피회계를 적용하던 도중 중단하는 경우에는, 이미 기타포괄손익누계액으로 인식된 파생상품평가손익은 문단 6.73의 ⑶과 ⑷에 따라 처리한다. 다만, 위험회피대상 예상거래가 더 이상 발생하지 않을 것으로 예상되어 현금흐름위험회피회계가 중단된 경우에는 이미 기타포괄손익누계액으로 인식된 파생상품평가손익을 즉시 당기손익으로 인식한다. 이때, 더 이상 발생가능성이 매우 높지 않게 된 예상거래도 여전히 발생할 것으로 기대될 수 있다.": {},
            "6.76	예상매출거래와 관련하여 기존에 보유중인 자산 또는 예상매입거래의 결과로 취득한 자산에 대하여 일반기업회계기준에 따라 손상차손을 적용하는 경우에는 먼저 현금흐름위험회피회계를 적용한 후, 일반기업회계기준에 따른 손상차손인식여부를 고려한다(선위험회피회계적용/후 손상차손 인식).": {},
            "6.77	예상매출거래와 관련하여 기존에 보유중인 자산에 대하여 손상차손을 인식한 경우, 동 금액만큼을 기타포괄손익누계액으로 인식된 관련 파생상품평가이익에서 즉시 당기이익으로 인식하여야 하며 기타포괄손익누계액으로 인식된 관련 파생상품평가손실은 동금액과 예상매출거래관련자산의 손상전 장부금액의 합계액이 예상매출거래관련자산의 회수가능액을 초과하는 범위내에서 즉시 당기비용으로 인식하여야 한다.": {},
            "6.78	예상매출거래와 관련하여 기존에 보유중인 자산에 대하여 손상차손을 인식하지 않은 경우 또는 예상매입거래가 아직 이루어지지 않은 경우, 기타포괄손익누계액으로 인식된 관련 파생상품평가손실금액은 동금액과 예상거래 관련 자산의 장부금액(또는 예상취득원가)의 합계액이 예상거래 관련 자산의 회수가능액을 초과하는 범위내에서 즉시 비용으로 인식하여야 한다.": {},
        },
        "순투자의 위험회피회계 6.79-": {
            "6.79	해외사업장순투자의 위험회피(순투자의 일부로 회계처리하는 화폐성항목의 위험회피 포함)는 다음과 같이 현금흐름위험회피와 유사하게 회계처리한다.": {
                "⑴	위험회피수단의 손익 중 위험회피에 효과적인 부분은 기타포괄손익으로 인식한다. ": {},
                "⑵	위험회피수단의 손익 중 비효과적인 부분은 당기손익으로 인식한다. 위험회피수단의 손익 중 위험회피에 효과적이어서 기타포괄손익으로 인식한 부분은 향후 해외사업장의 처분시점에 재분류조정으로 자본에서 당기손익으로 재분류한다.": {},
            },
        },
    },
    "기타 고려사항 6.80-": {
        "6.80	이 밖에 통화선도거래, 매매목적의 거래소 선물 또는 옵션거래 및 신용파생상품에 대해서는 다음의 사항을 고려한다.": {
            "⑴	통화선도거래의 공정가치는 잔여만기가 동일한 통화선도환율(forward rate)을 기준으로 하여 산정한다. 이때 공정가치는 해당 통화선도환율 변동액을 잔여만기에 대하여 적절한 이자율로 할인하여 산정한다.":{},
            "⑵	매매목적의 거래소 선물거래는 다음과 같이 회계처리한다.": {
                "㈎	위탁증거금 등 선물거래를 위한 예치금은 유동자산으로 인식한다.": {},
                "㈏	일일정산에 따른 회계연도 중의 정산차금(당일차금과 갱신차금의 합계) 발생분에 대해서는 이를 기중에 거래손익으로 인식하지 않고 회사 내부관리용 별도의 계정으로 관리하며 동 금액은 다음 ㈐~㈒에 따라 주가지수선물거래손익 등으로 대체한다.": {},
                "㈐	결산일 현재 보유하고 있는 미결제약정분에 대한 종목별 누적정산차금잔액은 주가지수선물거래손익 등으로 하여 당기손익으로 인식한다.": {},
                "㈑	전․환매수량에 대한 당초 약정금액(전기 이월분은 전기말 정산가격)과 전․환매시 약정금액과의 차액은 주가지수선물거래손익 등으로 하여 당기손익으로 인식한다. 이 경우 당초 약정금액은 종목별로 총평균법이나 이동평균법을 적용하여 산정한다.": {},
                "㈒	최종 결제시 누적정산차금잔액과 최종결제차금은 주가지수선물거래손익 등으로 하여 당기손익으로 인식한다.": {},
                "㈓	결산일 현재 발생한 미수(미지급)일일정산차액은 미수금(미지급금)으로 인식한다.": {},
            },
            "⑶	매매목적의 거래소 옵션거래는 다음과 같이 회계처리한다.": {
                "㈎	위탁증거금 등 옵션거래를 위한 예치금은 유동자산으로 인식한다.": {},
                "㈏	옵션 매입시 지급하는 옵션프리미엄은 유동자산(매수주가지수옵션, 매수미국달러옵션 등)으로, 매도시 수취하는 옵션프리미엄은 유동부채(매도주가지수옵션, 매도미국달러옵션 등)로 처리한다.": {},
                "㈐	전․환매시 수수된 옵션대금(또는 권리행사시 수수된 권리행사차금)과 이미 유동자산 또는 유동부채에 인식되어 있는 옵션프리미엄 장부금액과의 차액은 주가지수옵션거래손익, 미국달러옵션거래손익 등으로 하여 당기손익으로 처리한다. 이 경우 옵션프리미엄의 장부금액은 종목별로 총평균법이나 이동평균법을 적용하여 산정한다.": {},
                "㈑	옵션이 미행사되어 소멸하는 경우 유동자산 인식분은 옵션거래손실로 하여 당기손실로 처리하고 유동부채 인식분은 옵션거래이익으로 하여 당기이익으로 처리한다.": {},
                "㈒	유동자산(또는 유동부채)에 인식되어 있는 미결제약정분에 대한 옵션프리미엄의 장부금액과 결산일 현재 옵션프리미엄가격과의 차액은 주가지수옵션평가손익, 미국달러옵션평가손익 등으로 하여 당기손익으로 처리한다.": {},
            },
            "⑷	특정 거래상대방의 신용상태를 기초변수로 하여 현금흐름이 결정되는 계약으로서 대출금, 유가증권 등을 보유하고 있는 경제적 실체가 자신이 부담하고 있는 신용위험을 제3자에게 이전시키는 계약이 파생상품에 해당하는 경우에는 이 절에 따라 회계처리하며, 보증계약에 해당하는 경우에는 제14장 ‘충당부채, 우발부채, 우발자산’에 따라 회계처리한다.": {},
        },
    },
    "공시 6.81-": {
        "6.81	파생상품에 대한 주석사항은 그 거래목적에 따라 다음과 같이 구분하여 공시한다.": {
            "⑴	매매목적으로 보유하고 있는 파생상품 또는 위험회피회계가 적용되지 않으나 위험회피목적으로 보유하고 있는 파생상품에 대해서는 다음의 사항을 공시한다.": {
                "㈎	거래목적": {},
                "㈏	거래목적을 이해하는 데 필요한 사항(경제적 실체가 부담하고 있는 위험의 본질 및 원천 그리고 이러한 위험에 대한 경제적 실체의 대응정책 등)": {},
                "㈐	위험회피목적의 경우 해당목적을 달성하기 위한 전략(위험회피대상항목의 내역 및 위험회피대상범위 그리고 위험회피를 위한 구체적인 방법 및 사용된 파생상품의 종류 등)": {},
            },
            "⑵	공정가치위험회피회계가 적용되는 경우에는 회피대상위험별로 위 ⑴ 이외에 다음의 사항을 공시한다.": {
                "㈎	위험회피의 불완전성으로 인하여 당기손익으로 인식하는 금액 및 그 계정과목":{},
                "㈏	확정계약에 대한 위험회피회계가 중단됨으로써 이미 자산․부채로 인식한 확정계약을 전액 제거하고 이를 당기손익에 반영하는 경우 그 금액 및 내역":{},
            },
            "⑶	현금흐름위험회피회계가 적용되는 경우에는 회피대상위험별로 위 ⑴ 및 ⑵㈎ 이외에 다음의 사항을 공시한다.": {
                "㈎	위험회피대상 예상거래로 인하여 현금흐름 변동위험에 노출되는 예상최장기간": {},
                "㈏	기타포괄손익누계액에 인식된 파생상품평가손익 중 결산일로부터 12개월 이내에 당기손익으로 인식할 것으로 예상되는 금액": {},
                "㈐	기타포괄손익누계액에 인식된 파생상품평가손익을 위험회피대상 예상거래가 당기손익에 영향을 미치는 회계연도에 당기손익으로 인식하는 경우, 위험회피대상 예상거래가 당기손익에 영향을 미치게 되는 거래 또는 회계사건의 내역":{},
                "㈑	위험회피대상 예상거래가 더 이상 발생하지 않을 것으로 예상되어 현금흐름위험회피회계가 중단됨으로써 이미 기타포괄손익누계액으로 인식된 파생상품평가손익을 즉시 당기손익으로 인식하는 경우 그 금액 및 내역":{},
            },
            "⑷	해외사업장순투자의 위험회피회계가 적용되는 경우에는 회피대상위험별로 위 ⑴ 및 ⑵㈎를 공시한다.": {},
            "⑸	매매목적 파생상품평가손익과 위험회피목적 파생상품평가손익(그 성질이나 금액이 유의적인 경우 파생상품별로 구분하여 기재하고, 평가이익과 평가손실은 상계하지 않고 총액으로 표시한다)": {},
            "⑹	신용파생상품과 관련하여 다음의 사항을 공시한다.": {
                "㈎	신용위험을 부담한 경우, 신용파생상품거래의 계약 내역, 재무제표에 반영된 손실예상액. 손실예상액을 합리적이고 객관적으로 추정할 수 없는 경우에는 채무불이행가능성 및 보증대상자산의 평가손익 등을 추가적으로 공시한다.":{},
            },
        },
    },
    "일반기업회계기준 제6장 ‘금융자산·금융부채’의 제3절 ‘파생상품’의 부록": {
        "": {},
        "": {},
        "": {},
        "": {},
        "": {},
        "": {},
        "": {},
        "": {},
        "": {},
        "": {},
        "": {},
        "": {},
    },
}
채권채무조정={
    "적용범위 6.82-":{
        "6.82 	이 절은 회사회생절차의 개시 또는 거래당사자간의 합의 등으로 인하여 채권․채무의 원리금, 이자율 또는 만기 등 계약조건이 채무자의 부담이 경감되도록 변경된 경우의 회계처리에 적용한다.": {},
        "6.83 	유가증권으로 보유하고 있는 채권에 대한 투자자의 채권․채무조정회계는 이 절의 적용대상이 아니며, 이 장의 제2절 ‘유가증권’에 따라 회계처리한다. ": {},
    },
    "용어의 정의 6.84-":{
        "6.84 	‘채권․채무조정’은 채무자의 현재 또는 장래의 채무변제능력이 크게 저하된 경우에 채권자와 채무자간의 합의 또는 법원의 결정 등의 방법으로 채무자의 부담완화를 공식화하는 것을 말한다.": {},
    },
    "채권·채무조정 시점 6.85-": {
        "6.85 	채권․채무조정이 실질적으로 완성되는 시점이 채권․채무조정시점이다. 채권․채무조정은 채무의 만기일 이전 또는 이후에 이루어질 수 있으며, 자산 또는 지분증권을 이전하거나 새로운 계약조건이 확정되는 시점에서 채권․채무조정이 완성된다. 일반적으로 합의에 의한 채권․채무조정의 경우에는 합의일, 법원의 인가에 의한 채권․채무조정의 경우에는 법원의 인가일이 채권․채무조정시점이 된다. 그러나 채권자와 채무자간에 약정한 조건이 충족되지 않아서 합의일 또는 법원의 인가일에 자산 또는 지분증권의 이전, 새로운 계약조건의 시행 등의 사건이 이루어지지 않는 경우에는 그 조건이 충족되어 실질적으로 채권․채무조정이 완성되는 시점이 채권․채무조정시점이다.": {},
    },
    "채무자의 회계 6.86-": {
        "자산이전에 의한 채무의 변제 6.86-": {
            "6.86 	채무자가 채무를 변제하기 위하여 제3자에 대한 채권, 부동산 또는 기타의 자산을 채권자에게 이전하는 경우에는 변제되는 채무의 장부금액과 이전되는 자산의 공정가치와의 차이를 채무조정이익으로 인식한다.": {},
        },
        "지분증권의 발행 등에 의한 채무변제 6.87-": {
            "6.87 	채무자가 채무를 변제하기 위하여 채권자에게 지분증권을 발행하는 경우(이하 ‘출자전환’이라 한다)에는 지분증권의 공정가치와 채무의 장부금액과의 차이를 채무조정이익으로 인식한다. 다만, 시장성이 없는 지분증권의 공정가치를 신뢰성 있게 측정할 수 없는 경우에는 발행되는 지분증권을 조정대상 채무의 장부금액으로 회계처리하고 채무조정이익을 인식하지 않는다.": {},
            "6.88 	출자전환을 합의하였으나 출자전환이 즉시 이행되지 않는 경우에는 조정대상채무를 출자전환채무의 과목으로 하여 자본조정으로 대체한다. 출자전환채무는 전환으로 인하여 발행될 주식의 공정가치로 하고 조정대상채무의 장부금액과의 차이는 채무조정이익으로 인식한다. 다만, 시장성이 없는 지분증권의 공정가치를 신뢰성 있게 측정할 수 없는 경우에는 조정대상 채무의 장부금액으로 출자전환채무를 회계처리하고 채무조정이익을 인식하지 않는다.": {},
            "6.89 	채권·채무조정으로 인하여 발행되는 전환사채가 만기일 이전에 반드시 지분증권으로 전환하고 지분증권으로 전환하지 않는다면 원금상환을 면제하는 조건을 가지고 있는 경우에는 제15장 ‘자본’의 규정에 불구하고 문단 6.88과 같이 회계처리한다. ": {},
        },
        "조건의 변경 6.90-": {
            "6.90 	조건변경으로 채무가 조정되는 경우에는 채권․채무조정에 따른 약정상 정해진 미래 현금흐름을 채무 발생시점의 유효이자율로 할인하여 계산된 현재가치와 채무의 장부금액과의 차이를 채무에 대한 현재가치할인차금과 채무조정이익으로 인식한다. 조정대상채무에 대하여 전환사채나 채무증권을 발행하는 형식으로 채권․채무조정이 이루어지는 경우에는 이를 채무의 변제로 보지 않고 채무의 조건변경으로 회계처리한다. 따라서 채권․채무조정으로 인하여 발행되는 전환사채에 대해 제15장 ‘자본’의 규정에 불구하고 전환권을 인식하지 않고 전환사채의 만기까지 발생할 미래 현금흐름을 채무 발생시점의 유효이자율로 할인하여 계산된 현재가치와 조정대상채무의 장부금액과의 차이를 채무조정이익으로 인식한다.": {},
            "6.91  	동종 또는 유사한 채권․채무에 대하여 적용할 이자율보다 더 낮은 이자율로 만기를 연장하는 경우에 해당하며, 경제환경의 변동으로 동일한 신용도에 대한 채무 발생시점의 시장이자율과 채권․채무조정시점의 시장이자율에 현저한 차이가 있는 경우에는, 문단 6.90의 규정에 불구하고 채권․채무조정시점의 적절한 이자율로 할인하여 채무조정이익을 인식한다. 채권․채무조정시점의 적절한 이자율은 채권․채무조정시점의 기초이자율에 당해 채무 발생시점과 동일한 신용상태에 대한 채권․채무조정시점의 신용가산이자율을 합산하여 산정한다. 신용가산이자율은 채무 발생시점의 채무자 신용상태가 채권․채무조정시점까지 유효하다고 가정할 경우 채권․채무조정시점에서 산정된 이자율을 말한다.": {},
        },
        "각 방법의 결합에 의한 채권․채무조정 6.92-": {
            "6.92 	채무의 일부에 대해서는 채무자가 채권자에게 자산을 이전하거나 지분증권을 발행하여 변제하고 나머지 채무에 대해서는 조건변경을 통하여 채무를 경감시키는 채권․채무조정의 경우에는 다음과 같이 회계처리한다.": {
                "⑴	이전되는 자산과 발행되는 지분증권의 공정가치를 측정하여 자산과 지분증권의 공정가치만큼 채무의 장부금액을 감소시킨다.": {},
                "⑵	나머지 채무에 대해서는 채무의 조건변경으로 회계처리한다.": {},
            },
        },
        "기타 6.93-": {
            "6.93 	채권․채무조정에 따른 지분증권의 발행과 관련하여 직접적으로 발생한 비용은 지분증권의 발행금액에서 차감한다. 채권․채무조정을 실시하기 위하여 채무자에게 발생된 기타의 모든 비용은 채무조정이익에서 차감한다.": {},
        },
        "주석 공시 6.94-": {
            "6.94 	채무자는 채권․채무조정시점이 속하는 회계연도에 다음의 사항을 주석으로 공시한다.": {
                "⑴ 채권․채무조정으로 인한 조건변경 및 변제액": {},
                "⑵ 채권․채무조정과 관련하여 발생한 자산처분손익": {},
                "⑶ 채무자의 재무상황이 정해진 기간 내에 향상되는 것을 전제로 원금이나 이자로 정해진 금액이 추가되는 약정이 있는 경우 조정된 만기까지 발생할 미래 현금흐름에 추가되는 금액": {},
                "⑷ 채권․채무조정 후에 부수적으로 발생할 가능성이 있는 채무금액과 그러한 채무가 부가되거나 면제될 수 있는 조건 ": {},
                "⑸ 문단 6.87에서 문단 6.89까지의 규정에 따른 출자전환채무": {},
            },
        },
    },
    "채권자의 회계 6.95-": {
        "자산의 양수를 통한 채권의 회수 6.95-": {
            "6.95 	채권․채무조정시점에서 채무자에 대한 채권의 전부 또는 일부에 대하여 제3자에 대한 채권, 부동산 또는 기타의 자산을 받거나 채무자의 지분증권 등을 받은 채권자는 동 자산을 공정가치로 회계처리한다. 받은 자산의 공정가치가 채권의 대손충당금 차감전 장부금액보다 작은 경우에는 채권의 대손충당금 차감전 장부금액을 대손충당금과 우선 상계하고 부족한 경우에는 대손상각비로 인식한다.": {},
            "6.96 	출자전환을 합의하여 출자전환으로 인하여 발행될 주식수가 결정된 경우에는 채권의 대손충당금 차감전 장부금액을 출자전환채권으로 대체하고 출자전환이 이루어질 때까지 출자전환채권의 대손충당금 차감전 장부금액과 전환으로 발행될 주식의 공정가치 중 낮은 금액으로 평가하며 이로 인한 평가손익은 출자전환채권에 대한 대손충당금과 대손상각비에 반영한다.": {},
        },
        "채권의 조건변경  6.97-": {
            "6.97 	채권자는 채권․채무조정을 통하여 조건이 변경된 채권에 대하여 공식적인 채권․채무조정 이전이라도 인식조건이 충족되면 대손상각비를 인식해야 하며 공식적인 채권․채무조정시점까지 대손상각비의 인식을 지연할 수 없다.": {},
            "6.98 	채권․채무조정을 통하여 조건이 변경된 채권에 대한 대손상각비는 채권․채무조정에 따른 약정상 정해진 미래 현금흐름을 채권 발생시점의 유효이자율로 할인하여 계산된 현재가치와 채권의 대손충당금 차감전 장부금액과의 차이로 계산하며 채권에 대한 대손충당금과 대손상각비를 다음과 같이 조정한다. 이미 설정된 대손충당금이 채권․채무조정에 따라 결정된 대손상각비 금액보다 작은 경우에는 부족분에 대해서 대손충당금을 추가로 설정하며, 이미 설정된 대손충당금이 채권․채무조정에 따라 결정된 대손상각비 금액보다 큰 경우에는 초과분에 대하여 대손충당금을 환입한다. 다만, 관측가능한 활성시장에서 거래되는 채권의 시장가격이 있는 경우에는 그 채권의 시장가격, 담보로 제공된 자산이 있고 그 자산의 처분을 통하여 채권을 회수할 가능성이 매우 높은 경우에는 그 자산의 공정가치에 근거하여 대손상각비를 측정할 수 있다. 대손상각비의 측정방법은 각 채권별로 일관성 있게 적용하여야 하며 측정방법의 변경은 상황이 변하는 경우에만 정당화될 수 있다.": {},
        },
        "각 방법의 결합에 의한 채권․채무조정 6.99-": {
            "6.99 	채권의 일부에 대해서는 채무자가 채권자에게 자산을 이전하거나 지분증권을 발행하여 변제하고 나머지 채권에 대해서는 조건변경을 하는 채권․채무조정인 경우에는 다음과 같이 회계처리한다.": {
                "⑴ 문단 6.95와 문단 6.96의 규정에 따라 이전되는 자산과 발행되는 지분증권의 공정가치를 측정하여 자산과 지분증권의 공정가치만큼 채권의 대손충당금 차감전 장부금액을 감소시킨다.": {},
                "⑵ 감소된 채권의 대손충당금 차감전 장부금액에 대해서는 문단 6.97과 문단 6.98의 규정에 따라 회계처리한다.": {},
            },
        },
        "주석 공시 6.100-":{
            "6.100 	채권․채무조정이 발생한 채권의 대손충당금에 대해서 다음과 같은 변동내용을 주석으로 공시한다.":{
                "⑴ 당기 발생한 대손상각비":{},
                "⑵ 채권과 직접 상계한 금액":{},
                "⑶ 시간의 경과에 따라 이자수익으로 인식한 금액": {},
                "⑷ 환입을 비롯한 기타 변동액": {},
            },
            "6.101 	채권․채무조정이 발생한 채권의 채무자에게 추가적으로 자금을 대여하기로 한 약정이 있는 경우 동 약정의 내용을 주석으로 공시한다.": {},
            "6.102 	문단 6.96의 규정에 따른 출자전환채권의 내용을 주석으로 공시한다.": {},
        },
    },

    "일반기업회계기준 제6장 ‘금융자산·금융부채’의 제4절 ‘채권·채무조정’의 부록":{
        "": {},
        "": {},
        "": {},
        "": {},
        "": {},
        "": {},
        "": {},
        "": {},
        "": {},
        "": {},
        "": {},
        "": {},
    },
}

금융자산금융부채={
    "일반기업회계기준 제6장 금융자산·금융부채": {},
    "목적 6.1":{
        "6.1	이 장의 목적은 금융자산·금융부채에 대한 회계처리와 공시에 필요한 사항을 정하는 데 있다.":{},
    },
    "적용범위 6.2":{
        "6.2 	이 장은 공통사항, 유가증권, 파생상품 및 채권․채무조정 등 4개 절로 구성되어 있으며, 다음을 제외한 모든 유형의 금융상품에 적용한다. 또한 파생상품의 정의를 충족하는 기타 계약에도 적용한다.":{
            "⑴	종속기업, 관계기업 및 조인트벤처 투자지분": {},
            "⑵	리스에 따른 권리와 의무. 다만, ㈎ 리스제공자가 인식하는 리스채권의 제거와 손상, ㈏ 리스이용자가 인식하는 금융리스부채의 제거 및 ㈐ 리스에 내재된 파생상품에 대하여는 이 장을 적용한다. ": {},
            "⑶ 퇴직급여와 관련된 사용자의 권리와 의무": {},
            "⑷ 지분상품의 정의를 충족하는 금융상품(발행자의 경우에 한함)": {},
            "⑸ 보험계약. 다만, 보험계약에 내재된 파생상품에 대하여는 이 장을 적용한다. ": {},
            "⑹ 미래에 피취득대상을 매입하거나 매도하기로 하는 취득자와 매각자 사이의 사업결합계약": {},
            "⑺ 대출약정": {},
            "⑻ 주식기준보상거래에 따른 금융상품, 계약 및 의무": {},
            "⑼ 정상 영업활동 과정에서 발생하는 자산의 매입 또는 매출계약(금융상품 또는 파생상품인 경우는 제외)": {},
            "⑽ 당기 또는 전기 이전에 인식한 충당부채의 결제에 필요한 지출과 관련하여 제3자로부터 보상받을 권리": {},
            "⑾	금융보증계약 ": {},
        },
    },
    "제1절 공통사항": 공통사항,
    "제2절 유가증권": 유가증권,
    "제3절 파생상품": 파생상품,
    "제4절 채권·채무조정": 채권채무조정,
    "한국회계기준원 회계기준위원회":{},
    "의결 2017. 9. 22.	":{},
}