조세심판={
'조세심판 실무 가이드':{},
    '조세불복 개론': {
        '행정심판 일반': {
            '국세불복 개관': {},
            '행정심판의 의의': {},
            '행정소송과의 관계': {},
            '행정신판의 당사자': {
                '당사자 및 관계인': {},
                '대리인': {}
            },
            '행정심판의 절차': {
                '행정심판의 대상': {},
                '행정심판의 청구': {},
                '관계서류의 열람과 의견진술': {},
                '행정심판의 심리': {},
                '행정심판의 결정': {},
                '재결의 효력': {}
            }
        },
        '조세불복의 종류': {
            '과세전적부심사': {
                '과세전적부심사의 의의': {},
                '과세전적부심사 절차': {}
            },
            '이의신청': {
                '이의신청의 의의': {},
                '이의신청 절차': {}
            },
            '심사청구': {
                '심사청구의 의의': {},
                '심사청구의 절차': {}
            },
            '심판청구': {
                '삼판청구의 의의': {},
                '심판청구의 절차': {}
            },
            '감사원 심사청구': {
                '감사원 심사청구의 의의': {},
                '감사원 심사청구의 절차': {}
            },
            '조세소송': {
                '조세소송의 개요': {},
                '조세소송의 종류': {},
                '소송요건': {},
                '소송절차': {}
            }

        },
    },
    '조세심판 실무': {
        '조세심판원 개요': {
            '조직 및 구성 등': {},
            '심판절차': {
                '업무흐름': {},
                '처리절차': {},
            },
        },
        '불복의 대상': {
            '부과처분': {},
            '경정청구 거부처분 등': {
                '일반적 경정청구에대한 거부처분 등': {},
                '후발적 경정청구에대한 거부처분': {},
            },
            '소득금액의 변동통지': {},
            '기한후 신고에대한 결정 등': {},
            '재조사결정': {}
        },
        '불복의 이유': {
            '쟁점의 구성': {
                '쟁점의 정리': {},
                '주위적 청구와 예비적 청구': {}
            },
            '쟁점의 형성': {
                '근거법률의 확인': {},
                '법률요건 해석': {},
                '사실인정 여부': {}
            },
            '입증책임': {
                '의의': {},
                '입증책임의 분배': {},
                '입증도의 완화와 입증전환의 필요': {},
                '조세심판에서의 입증책임의 문제': {}
            }
        },
        '심판청구서 작성 실무': {
            '일반사항': {
                '작성의 의의': {},
                '작성원칙': {}
            },
            '심판청구서 작성요령': {
                '청구서 표지': {},
                '청구취지': {},
                '청구이유': {},
                '증거자료의 제출': {},
                '의견진술': {},
                '청구변경': {},
                '작성사례': {}
            }
        }
    },
}