# -*- coding: utf-8 -*-
#Created on 2019년 @author: 권달현
조={};서문={};조문={};부칙 = {};bubname='종합부동산세법'
편=장=절=관=항=조={} 
서문['']={}
서문['종합부동산세']={}
서문['[시행 2019. 1. 1] [법률 제16109호, 2018. 12. 31, 일부개정']={}
서문['기획재정부(재산세제과) 044-215-431']={}
제1장_='제1장 총칙'
제1장={}
조문[제1장_]=제1장
제1조_=' 제1조 (목적) '
제1조={}
제1조['종합부동산세법 제1조 (목적)']={}
제1장[제1조_]=제1조
조['제1조 (목적)']=제1조
제1조1항_='이 법은 고액의 부동산 보유자에 대하여 종합부동산세를 부과하여 부동산보유에 대한 조세부담의 형평성을 제고하고, 부동산의 가격안정을 도모함으로써 지방재정의 균형발전과 국민경제의 건전한 발전에 이바지함을 목적으로 한다.'
제1조1항={}
제1조[제1조1항_]=제1조1항
제2조_=' 제2조 (정의) '
제2조={}
제2조['종합부동산세법 제2조 (정의)']={}
제1장[제2조_]=제2조
조['제2조 (정의)']=제2조
제2조1항_='이 법에서 사용하는 용어의 정의는 다음 각호와 같다. <개정 2005. 12. 31., 2010. 3. 31., 2016. 1. 19., 2018. 12. 31.>'
제2조1항={}
제2조[제2조1항_]=제2조1항
제2조1항1호_='1. "시ㆍ군ㆍ구"라 함은 지방자치법 제2조의 규정에 의한 지방자치단체인 시ㆍ군 및 자치구(이하 "시ㆍ군"이라 한다)를 말한다.'
제2조1항1호={}
제2조1항[제2조1항1호_]=제2조1항1호
제2조1항2호_='2. "시장ㆍ군수ㆍ구청장"이라 함은 지방자치단체의 장인 시장ㆍ군수 및 자치구의 구청장(이하 "시장ㆍ군수"라 한다)을 말한다.'
제2조1항2호={}
제2조1항[제2조1항2호_]=제2조1항2호
제2조1항3호_='3. "주택"이라 함은 「지방세법」 제104조제3호에 의한 주택을 말한다. 다만, 같은 법 제13조제5항제1호에 따른 별장은 제외한다.'
제2조1항3호={}
제2조1항[제2조1항3호_]=제2조1항3호
제2조1항4호_='4. "토지"라 함은 「지방세법」 제104조제1호에 따른 토지를 말한다.'
제2조1항4호={}
제2조1항[제2조1항4호_]=제2조1항4호
제2조1항5호_='5. "주택분 재산세"라 함은 「지방세법」 제105조 및 제107조에 따라 주택에 대하여 부과하는 재산세를 말한다.'
제2조1항5호={}
제2조1항[제2조1항5호_]=제2조1항5호
제2조1항6호_='6. "토지분 재산세"라 함은 「지방세법」 제105조 및 제107조에 따라 토지에 대하여 부과하는 재산세를 말한다.'
제2조1항6호={}
제2조1항[제2조1항6호_]=제2조1항6호
제2조1항7호_='7. 삭제 <2005. 12. 31.>'
제2조1항7호={}
제2조1항[제2조1항7호_]=제2조1항7호
제2조1항8호_='8. "세대"라 함은 주택 또는 토지의 소유자 및 그 배우자와 그들과 생계를 같이하는 가족으로서 대통령령이 정하는 것을 말한다.'
제2조1항8호={}
제2조1항[제2조1항8호_]=제2조1항8호
제2조1항9호_='9. "공시가격"이라 함은 「부동산 가격공시에 관한 법률」에 따라 가격이 공시되는 주택 및 토지에 대하여 동법에 따라 공시된 가액을 말한다. 다만, 동법에 따라 가격이 공시되지 아니한 경우에는 「지방세법」 제4조제1항 단서 및 같은 조 제2항에 따른 가액으로 한다.'
제2조1항9호={}
제2조1항[제2조1항9호_]=제2조1항9호
제3조_=' 제3조 (과세기준일) '
제3조={}
제3조['종합부동산세법 제3조 (과세기준일)']={}
제1장[제3조_]=제3조
조['제3조 (과세기준일)']=제3조
제3조1항_='종합부동산세의 과세기준일은 「지방세법」 제114조에 따른 재산세의 과세기준일로 한다. <개정 2010. 3. 31.>'
제3조1항={}
제3조[제3조1항_]=제3조1항
제4조_=' 제4조 (납세지) '
제4조={}
제4조['종합부동산세법 제4조 (납세지)']={}
제1장[제4조_]=제4조
조['제4조 (납세지)']=제4조
제4조1항_='①종합부동산세의 납세의무자가 개인 또는 법인으로 보지 아니하는 단체인 경우에는 소득세법 제6조의 규정을 준용하여 납세지를 정한다.'
제4조1항={}
제4조[제4조1항_]=제4조1항
제4조2항_='②종합부동산세의 납세의무자가 법인 또는 법인으로 보는 단체인 경우에는 법인세법 제9조제1항 내지 제3항의 규정을 준용하여 납세지를 정한다.'
제4조2항={}
제4조[제4조2항_]=제4조2항
제4조3항_='③ 종합부동산세의 납세의무자가 비거주자인 개인 또는 외국법인으로서 국내사업장이 없고 국내원천소득이 발생하지 아니하는 주택 및 토지를 소유한 경우에는 그 주택 또는 토지의 소재지(주택 또는 토지가 둘 이상인 경우에는 공시가격이 가장 높은 주택 또는 토지의 소재지를 말한다)를 납세지로 정한다. <신설 2008. 12. 26.>'
제4조3항={}
제4조[제4조3항_]=제4조3항
제5조_=' 제5조 (과세구분 및 세액) '
제5조={}
제5조['종합부동산세법 제5조 (과세구분 및 세액)']={}
제1장[제5조_]=제5조
조['제5조 (과세구분 및 세액)']=제5조
제5조1항_='①종합부동산세는 주택에 대한 종합부동산세와 토지에 대한 종합부동산세의 세액을 합한 금액을 그 세액으로 한다.'
제5조1항={}
제5조[제5조1항_]=제5조1항
제5조2항_='②토지에 대한 종합부동산세의 세액은 제14조제1항 내지 제3항의 규정에 의한 토지분 종합합산세액과 동조제4항 내지 제6항의 규정에 의한 토지분 별도합산세액을 합한 금액으로 한다. <개정 2005. 12. 31.>'
제5조2항={}
제5조[제5조2항_]=제5조2항
제6조_=' 제6조 (비과세 등) '
제6조={}
제6조['종합부동산세법 제6조 (비과세 등)']={}
제1장[제6조_]=제6조
조['제6조 (비과세 등)']=제6조
제6조1항_='①「지방세특례제한법」 또는 조세특례제한법에 의한 재산세의 비과세ㆍ과세면제 또는 경감에 관한 규정(이하 "재산세의 감면규정"이라 한다)은 종합부동산세를 부과함에 있어서 이를 준용한다. <개정 2010. 3. 31.>'
제6조1항={}
제6조[제6조1항_]=제6조1항
제6조2항_='②「지방세특례제한법」 제4조에 따른 시ㆍ군의 감면조례에 의한 재산세의 감면규정은 종합부동산세를 부과함에 있어서 이를 준용한다. <개정 2010. 3. 31.>'
제6조2항={}
제6조[제6조2항_]=제6조2항
제6조3항_='③제1항 및 제2항의 규정에 의하여 재산세의 감면규정을 준용함에 있어서 그 감면대상인 주택 또는 토지의 공시가격에서 그 공시가격에 재산세 감면비율(비과세 또는 과세면제의 경우에는 이를 100분의 100으로 본다)을 곱한 금액을 공제한 금액을 공시가격으로 본다. <개정 2005. 12. 31.>'
제6조3항={}
제6조[제6조3항_]=제6조3항
제6조4항_='④제1항 및 제2항의 재산세의 감면규정 또는 분리과세규정에 따라 종합부동산세를 경감하는 것이 종합부동산세를 부과하는 취지에 비추어 적합하지 않은 것으로 인정되는 경우 등 대통령령이 정하는 경우에는 종합부동산세를 부과함에 있어서 제1항 및 제2항 또는 그 분리과세규정을 적용하지 아니한다. <개정 2018. 12. 31.>'
제6조4항={}
제6조[제6조4항_]=제6조4항
제2장_='제2장 주택에 대한 과세'
제2장={}
조문[제2장_]=제2장
제7조_=' 제7조 (납세의무자) '
제7조={}
제7조['종합부동산세법 제7조 (납세의무자)']={}
제2장[제7조_]=제7조
조['제7조 (납세의무자)']=제7조
제7조1항_='①과세기준일 현재 주택분 재산세의 납세의무자로서 국내에 있는 재산세 과세대상인 주택의 공시가격을 합산한 금액이 6억원을 초과하는 자는 종합부동산세를 납부할 의무가 있다. <개정 2005. 12. 31., 2008. 12. 26.>'
제7조1항={}
제7조[제7조1항_]=제7조1항
제7조2항_='② 삭제 <2008. 12. 26.>'
제7조2항={}
제7조[제7조2항_]=제7조2항
제7조3항_='③ 삭제 <2008. 12. 26.>'
제7조3항={}
제7조[제7조3항_]=제7조3항
제7조['[2008. 12. 26. 법률 제9273호에 의하여 2008. 11. 13. 헌법재판소에서 위헌 결정된 이 조를 개정함.]']={}
제8조_=' 제8조 (과세표준) '
제8조={}
제8조['종합부동산세법 제8조 (과세표준)']={}
제2장[제8조_]=제8조
조['제8조 (과세표준)']=제8조
제8조1항_='① 주택에 대한 종합부동산세의 과세표준은 납세의무자별로 주택의 공시가격을 합산한 금액［과세기준일 현재 세대원 중 1인이 해당 주택을 단독으로 소유한 경우로서 대통령령으로 정하는 1세대 1주택자(이하 "1세대 1주택자"라 한다)의 경우에는 그 합산한 금액에서 3억원을 공제한 금액］에서 6억원을 공제한 금액에 부동산 시장의 동향과 재정 여건 등을 고려하여 100분의 60부터 100분의 100까지의 범위에서 대통령령으로 정하는 공정시장가액비율을 곱한 금액으로 한다. 다만, 그 금액이 영보다 작은 경우에는 영으로 본다. <개정 2005. 12. 31., 2008. 12. 26.>'
제8조1항={}
제8조[제8조1항_]=제8조1항
제8조2항_='②다음 각 호의 어느 하나에 해당하는 주택은 제1항의 규정에 의한 과세표준 합산의 대상이 되는 주택의 범위에 포함되지 아니하는 것으로 본다. <신설 2005. 12. 31., 2008. 12. 26., 2011. 6. 7., 2015. 8. 28.>'
제8조2항={}
제8조[제8조2항_]=제8조2항
제8조2항1호_='1. 「민간임대주택에 관한 특별법」에 따른 민간임대주택, 「공공주택 특별법」에 따른 공공임대주택 또는 대통령령이 정하는 다가구 임대주택으로서 임대기간, 주택의 수, 가격, 규모 등을 감안하여 대통령령이 정하는 주택'
제8조2항1호={}
제8조2항[제8조2항1호_]=제8조2항1호
제8조2항2호_='2. 제1호의 주택외에 종업원의 주거에 제공하기 위한 기숙사 및 사원용 주택, 주택건설사업자가 건축하여 소유하고 있는 미분양주택, 가정어린이집용 주택, 「수도권정비계획법」 제2조제1호에 따른 수도권 외 지역에 소재하는 1주택 등 종합부동산세를 부과하는 목적에 적합하지 아니한 것으로서 대통령령이 정하는 주택. 이 경우 수도권 외 지역에 소재하는 1주택의 경우에는 2009년 1월 1일부터 2011년 12월 31일까지의 기간 중 납세의무가 성립하는 분에 한한다.'
제8조2항2호={}
제8조2항[제8조2항2호_]=제8조2항2호
제8조3항_='③제2항의 규정에 따른 주택을 보유한 납세의무자는 당해 연도 9월 16일부터 9월 30일까지 대통령령이 정하는 바에 따라 납세지 관할세무서장(이하 "관할세무서장"이라 한다)에게 당해 주택의 보유현황을 신고하여야 한다. <신설 2007. 1. 11.>'
제8조3항={}
제8조[제8조3항_]=제8조3항
제8조4항_='④ 제1항을 적용할 때 1주택(주택의 부속토지만을 소유한 경우를 제외한다)과 다른 주택의 부속토지(주택의 건물과 부속토지의 소유자가 다른 경우의 그 부속토지를 말한다)를 함께 소유하고 있는 경우에는 1세대 1주택자로 본다. <신설 2009. 5. 27.>'
제8조4항={}
제8조[제8조4항_]=제8조4항
제8조['[2008. 12. 26. 법률 제9273호에 의하여 2008. 11. 13. 헌법재판소에서 위헌 결정된 이 조를 개정함.]']={}
제9조_=' 제9조 (세율 및 세액) '
제9조={}
제9조['종합부동산세법 제9조 (세율 및 세액)']={}
제2장[제9조_]=제9조
조['제9조 (세율 및 세액)']=제9조
제9조1항_='① 주택에 대한 종합부동산세는 다음 각 호와 같이 납세의무자가 소유한 주택 수에 따라 과세표준에 해당 세율을 적용하여 계산한 금액을 그 세액(이하 "주택분 종합부동산세액"이라 한다)으로 한다. <개정 2018. 12. 31.>'
제9조1항={}
제9조[제9조1항_]=제9조1항
제9조1항1호_='1. 납세의무자가 2주택 이하를 소유한 경우[「주택법」 제63조의2제1항제1호에 따른 조정대상지역(이하 이 조에서 "조정대상지역"이라 한다) 내 2주택을 소유한 경우는 제외한다]'
제9조1항1호={}
제9조1항[제9조1항1호_]=제9조1항1호
제9조['']={}
제9조2호_='2. 납세의무자가 3주택 이상을 소유하거나, 조정대상지역 내 2주택을 소유한 경우'
제9조2호={}
제9조[제9조2호_]=제9조2호
제9조['']={}
제9조2항_='② 삭제 <2008. 12. 26.>'
제9조2항={}
제9조[제9조2항_]=제9조2항
제9조3항_='③주택분 과세표준 금액에 대하여 해당 과세대상 주택의 주택분 재산세로 부과된 세액(「지방세법」 제111조제3항에 따라 가감조정된 세율이 적용된 경우에는 그 세율이 적용된 세액, 같은 법 제122조에 따라 세부담 상한을 적용받은 경우에는 그 상한을 적용받은 세액을 말한다)은 주택분 종합부동산세액에서 이를 공제한다. <신설 2005. 12. 31., 2008. 12. 26., 2010. 3. 31.>'
제9조3항={}
제9조[제9조3항_]=제9조3항
제9조4항_='④주택분 종합부동산세액의 계산에 있어서 주택 수 계산 및 주택분 재산세로 부과된 세액의 공제 등에 관하여 필요한 사항은 대통령령으로 정한다. <신설 2005. 12. 31., 2018. 12. 31.>'
제9조4항={}
제9조[제9조4항_]=제9조4항
제9조5항_='⑤ 주택분 종합부동산세 납세의무자가 1세대 1주택자에 해당하는 경우의 주택분 종합부동산세액은 제1항ㆍ제3항 및 제4항에 따라 산출된 세액에서 제6항 또는 제7항에 따른 1세대 1주택자에 대한 공제액을 공제한 금액으로 한다. 이 경우 제6항과 제7항은 공제율 합계 100분의 70의 범위에서 중복하여 적용할 수 있다. <신설 2008. 12. 26., 2018. 12. 31.>'
제9조5항={}
제9조[제9조5항_]=제9조5항
제9조6항_='⑥과세기준일 현재 만 60세 이상인 1세대 1주택자의 공제액은 제1항ㆍ제3항 및 제4항에 따라 산출된 세액[제8조제4항에 해당하는 경우에는 제1항ㆍ제3항 및 제4항에 따라 산출된 세액에서 주택의 부속토지(주택의 건물과 부속토지의 소유자가 다른 경우의 그 부속토지를 말한다)분에 해당하는 산출세액(공시가격합계액으로 안분하여 계산한 금액을 말한다)을 제외한 금액]에 다음 표에 따른 연령별 공제율을 곱한 금액으로 한다. <개정 2009. 5. 27.>'
제9조6항={}
제9조[제9조6항_]=제9조6항
제9조['']={}
제9조7항_='⑦1세대 1주택자로서 해당 주택을 과세기준일 현재 5년 이상 보유한 자의 공제액은 제1항ㆍ제3항 및 제4항에 따라 산출된 세액[제8조제4항에 해당하는 경우에는 제1항ㆍ제3항 및 제4항에 따라 산출된 세액에서 주택의 부속토지(주택의 건물과 부속토지의 소유자가 다른 경우의 그 부속토지를 말한다)분에 해당하는 산출세액(공시가격합계액으로 안분하여 계산한 금액을 말한다)을 제외한 금액]에 다음 표에 따른 보유기간별 공제율을 곱한 금액으로 한다. <개정 2009. 5. 27., 2018. 12. 31.>'
제9조7항={}
제9조[제9조7항_]=제9조7항
제9조['']={}
제9조['[2008. 12. 26. 법률 제9273호에 의하여 2008. 11. 13. 헌법재판소에서 위헌 결정된 이 조를 개정함.]']={}
제10조_=' 제10조 (세부담의 상한) '
제10조={}
제10조['종합부동산세법 제10조 (세부담의 상한)']={}
제2장[제10조_]=제10조
조['제10조 (세부담의 상한)']=제10조
제10조1항_='종합부동산세의 납세의무자가 해당 연도에 납부하여야 할 주택분 재산세액상당액과 주택분 종합부동산세액상당액의 합계액(이하 이 조에서 "주택에 대한 총세액상당액"이라 한다)으로서 대통령령으로 정하는 바에 따라 계산한 세액이 해당 납세의무자에게 직전년도에 해당 주택에 부과된 주택에 대한 총세액상당액으로서 대통령령으로 정하는 바에 따라 계산한 세액에 다음 각 호의 비율을 곱하여 계산한 금액을 초과하는 경우에는 그 초과하는 세액에 대하여는 제9조에도 불구하고 이를 없는 것으로 본다. <개정 2005. 12. 31., 2008. 12. 26., 2018. 12. 31.>'
제10조1항={}
제10조[제10조1항_]=제10조1항
제10조1항1호_='1. 제9조제1항제1호의 적용대상인 경우: 100분의 150'
제10조1항1호={}
제10조1항[제10조1항1호_]=제10조1항1호
제10조1항2호_='2. 제9조제1항제2호의 적용대상인 경우'
제10조1항2호={}
제10조1항[제10조1항2호_]=제10조1항2호
제10조1항2호가목_='가. 납세의무자가 3주택 이상을 소유한 경우: 100분의 300'
제10조1항2호가목={}
제10조1항2호[제10조1항2호가목_]=제10조1항2호가목
제10조1항2호나목_='나. 가목 외의 경우: 100분의 200'
제10조1항2호나목={}
제10조1항2호[제10조1항2호나목_]=제10조1항2호나목
제3장_='제3장 토지에 대한 과세'
제3장={}
조문[제3장_]=제3장
제11조_=' 제11조 (과세방법) '
제11조={}
제11조['종합부동산세법 제11조 (과세방법)']={}
제3장[제11조_]=제11조
조['제11조 (과세방법)']=제11조
제11조1항_='토지에 대한 종합부동산세는 국내에 소재하는 토지에 대하여 「지방세법」 제106조제1항제1호에 따른 종합합산과세대상(이하 "종합합산과세대상"이라 한다)과 같은 법 제106조제1항제2호에 따른 별도합산과세대상(이하 "별도합산과세대상"이라 한다)으로 구분하여 과세한다. <개정 2010. 3. 31.>'
제11조1항={}
제11조[제11조1항_]=제11조1항
제12조_=' 제12조 (납세의무자) '
제12조={}
제12조['종합부동산세법 제12조 (납세의무자)']={}
제3장[제12조_]=제12조
조['제12조 (납세의무자)']=제12조
제12조1항_='①과세기준일 현재 토지분 재산세의 납세의무자로서 다음 각호의 어느 하나에 해당하는 자는 해당 토지에 대한 종합부동산세를 납부할 의무가 있다. <개정 2005. 12. 31., 2008. 12. 26.>'
제12조1항={}
제12조[제12조1항_]=제12조1항
제12조1항1호_='1. 종합합산과세대상인 경우에는 국내에 소재하는 해당 과세대상토지의 공시가격을 합한 금액이 5억원을 초과하는 자'
제12조1항1호={}
제12조1항[제12조1항1호_]=제12조1항1호
제12조1항2호_='2. 별도합산과세대상인 경우에는 국내에 소재하는 해당 과세대상토지의 공시가격을 합한 금액이 80억원을 초과하는 자'
제12조1항2호={}
제12조1항[제12조1항2호_]=제12조1항2호
제12조2항_='② 삭제 <2008. 12. 26.>'
제12조2항={}
제12조[제12조2항_]=제12조2항
제12조['[2008. 12. 26. 법률 제9273호에 의하여 2008. 11. 13. 헌법재판소에서 위헌 결정된 이 조를 개정함.]']={}
제13조_=' 제13조 (과세표준) '
제13조={}
제13조['종합부동산세법 제13조 (과세표준)']={}
제3장[제13조_]=제13조
조['제13조 (과세표준)']=제13조
제13조1항_='① 종합합산과세대상인 토지에 대한 종합부동산세의 과세표준은 납세의무자별로 해당 과세대상토지의 공시가격을 합산한 금액에서 5억원을 공제한 금액에 부동산 시장의 동향과 재정 여건 등을 고려하여 100분의 60부터 100분의 100까지의 범위에서 대통령령으로 정하는 공정시장가액비율을 곱한 금액으로 한다. <개정 2008. 12. 26.>'
제13조1항={}
제13조[제13조1항_]=제13조1항
제13조2항_='② 별도합산과세대상인 토지에 대한 종합부동산세의 과세표준은 납세의무자별로 해당 과세대상토지의 공시가격을 합산한 금액에서 80억원을 공제한 금액에 부동산 시장의 동향과 재정 여건 등을 고려하여 100분의 60부터 100분의 100까지의 범위에서 대통령령으로 정하는 공정시장가액비율을 곱한 금액으로 한다. <개정 2008. 12. 26.>'
제13조2항={}
제13조[제13조2항_]=제13조2항
제13조3항_='③제1항 또는 제2항의 금액이 영보다 작은 경우에는 영으로 본다.'
제13조3항={}
제13조[제13조3항_]=제13조3항
제14조_=' 제14조 (세율 및 세액) '
제14조={}
제14조['종합부동산세법 제14조 (세율 및 세액)']={}
제3장[제14조_]=제14조
조['제14조 (세율 및 세액)']=제14조
제14조1항_='① 종합합산과세대상인 토지에 대한 종합부동산세의 세액은 과세표준에 다음의 세율을 적용하여 계산한 금액(이하 "토지분 종합합산세액"이라 한다)으로 한다. <개정 2018. 12. 31.>'
제14조1항={}
제14조[제14조1항_]=제14조1항
제14조['']={}
제14조2항_='② 삭제 <2008. 12. 26.>'
제14조2항={}
제14조[제14조2항_]=제14조2항
제14조3항_='③종합합산과세대상인 토지의 과세표준 금액에 대하여 해당 과세대상 토지의 토지분 재산세로 부과된 세액(「지방세법」 제111조제3항에 따라 가감조정된 세율이 적용된 경우에는 그 세율이 적용된 세액, 같은 법 제122조에 따라 세부담 상한을 적용받은 경우에는 그 상한을 적용받은 세액을 말한다)은 토지분 종합합산세액에서 이를 공제한다. <신설 2005. 12. 31., 2008. 12. 26., 2010. 3. 31.>'
제14조3항={}
제14조[제14조3항_]=제14조3항
제14조4항_='④별도합산과세대상인 토지에 대한 종합부동산세의 세액은 과세표준에 다음의 세율을 적용하여 계산한 금액(이하 "토지분 별도합산세액"이라 한다)으로 한다. <개정 2008. 12. 26.>'
제14조4항={}
제14조[제14조4항_]=제14조4항
제14조['']={}
제14조5항_='⑤ 삭제 <2008. 12. 26.>'
제14조5항={}
제14조[제14조5항_]=제14조5항
제14조6항_='⑥별도합산과세대상인 토지의 과세표준 금액에 대하여 해당 과세대상 토지의 토지분 재산세로 부과된 세액(「지방세법」 제111조제3항에 따라 가감조정된 세율이 적용된 경우에는 그 세율이 적용된 세액, 같은 법 제122조에 따라 세부담 상한을 적용받은 경우에는 그 상한을 적용받은 세액을 말한다)은 토지분 별도합산세액에서 이를 공제한다. <신설 2005. 12. 31., 2008. 12. 26., 2010. 3. 31.>'
제14조6항={}
제14조[제14조6항_]=제14조6항
제14조7항_='⑦토지분 종합부동산세액의 계산에 있어서 토지분 재산세로 부과된 세액의 공제 등에 관하여 필요한 사항은 대통령령으로 정한다. <신설 2005. 12. 31.>'
제14조7항={}
제14조[제14조7항_]=제14조7항
제15조_=' 제15조 (세부담의 상한) '
제15조={}
제15조['종합부동산세법 제15조 (세부담의 상한)']={}
제3장[제15조_]=제15조
조['제15조 (세부담의 상한)']=제15조
제15조1항_='①종합부동산세의 납세의무자가 종합합산과세대상인 토지에 대하여 해당 연도에 납부하여야 할 재산세액상당액과 토지분 종합합산세액상당액의 합계액(이하 이 조에서 "종합합산과세대상인 토지에 대한 총세액상당액"이라 한다)으로서 대통령령으로 정하는 바에 따라 계산한 세액이 해당 납세의무자에게 직전년도에 해당 토지에 부과된 종합합산과세대상인 토지에 대한 총세액상당액으로서 대통령령으로 정하는 바에 따라 계산한 세액의 100분의 150을 초과하는 경우에는 그 초과하는 세액에 대하여는 제14조제1항에도 불구하고 이를 없는 것으로 본다. <개정 2005. 12. 31., 2008. 12. 26.>'
제15조1항={}
제15조[제15조1항_]=제15조1항
제15조2항_='②종합부동산세의 납세의무자가 별도합산과세대상인 토지에 대하여 해당 연도에 납부하여야 할 재산세액상당액과 토지분 별도합산세액상당액의 합계액(이하 이 조에서 "별도합산과세대상인 토지에 대한 총세액상당액"이라 한다)으로서 대통령령으로 정하는 바에 따라 계산한 세액이 해당 납세의무자에게 직전년도에 해당 토지에 부과된 별도합산과세대상인 토지에 대한 총세액상당액으로서 대통령령으로 정하는 바에 따라 계산한 세액의 100분의 150을 초과하는 경우에는 그 초과하는 세액에 대하여는 제14조제4항에도 불구하고 이를 없는 것으로 본다. <개정 2005. 12. 31., 2008. 12. 26.>'
제15조2항={}
제15조[제15조2항_]=제15조2항
제4장_='제4장 부과ㆍ징수 등 <개정 2007. 1. 11.>'
제4장={}
조문[제4장_]=제4장
제16조_=' 제16조 (부과ㆍ징수 등) '
제16조={}
제16조['종합부동산세법 제16조 (부과ㆍ징수 등)']={}
제4장[제16조_]=제16조
조['제16조 (부과ㆍ징수 등)']=제16조
제16조1항_='①관할세무서장은 납부하여야 할 종합부동산세의 세액을 결정하여 당해연도 12월 1일부터 12월 15일(이하 "납부기간"이라 한다)까지 부과ㆍ징수한다.'
제16조1항={}
제16조[제16조1항_]=제16조1항
제16조2항_='②관할세무서장은 종합부동산세를 징수하고자 하는 때에는 납세고지서에 주택 및 토지로 구분한 과세표준과 세액을 기재하여 납부기간 개시 5일 전까지 발부하여야 한다.'
제16조2항={}
제16조[제16조2항_]=제16조2항
제16조3항_='③제1항 및 제2항의 규정에 불구하고 종합부동산세를 신고납부방식으로 납부하고자 하는 납세의무자는 종합부동산세의 과세표준과 세액을 당해연도 12월 1일부터 12월 15일까지 대통령령이 정하는 바에 따라 관할세무서장에게 신고하여야 한다. 이 경우 제1항의 규정에 따른 결정은 없었던 것으로 본다.'
제16조3항={}
제16조[제16조3항_]=제16조3항
제16조4항_='④제3항의 규정에 따라 신고한 납세의무자는 신고기한 이내에 대통령령이 정하는 바에 따라 관할세무서장ㆍ한국은행 또는 체신관서에 종합부동산세를 납부하여야 한다.'
제16조4항={}
제16조[제16조4항_]=제16조4항
제16조5항_='⑤제1항 및 제2항의 규정에 따른 종합부동산세의 부과절차 및 징수에 관하여 필요한 사항은 대통령령으로 정한다.'
제16조5항={}
제16조[제16조5항_]=제16조5항
제16조['[전문개정 2007. 1. 11.]']={}
제17조_=' 제17조 (결정과 경정) '
제17조={}
제17조['종합부동산세법 제17조 (결정과 경정)']={}
제4장[제17조_]=제17조
조['제17조 (결정과 경정)']=제17조
제17조1항_='①관할세무서장 또는 납세지 관할 지방국세청장(이하 "관할지방국세청장"이라 한다)은 과세대상 누락, 위법 또는 착오 등으로 인하여 종합부동산세를 새로 부과할 필요가 있거나 이미 부과한 세액을 경정할 경우에는 다시 부과ㆍ징수할 수 있다. <개정 2007. 1. 11.>'
제17조1항={}
제17조[제17조1항_]=제17조1항
제17조2항_='②관할세무서장 또는 관할지방국세청장은 제16조제3항의 규정에 의한 신고를 한 자의 신고내용에 탈루 또는 오류가 있는 때에는 당해연도의 과세표준과 세액을 경정한다. <개정 2007. 1. 11.>'
제17조2항={}
제17조[제17조2항_]=제17조2항
제17조3항_='③ 관할세무서장 또는 관할지방국세청장은 과세표준과 세액을 결정 또는 경정한 후 그 결정 또는 경정에 탈루 또는 오류가 있는 것이 발견된 때에는 이를 경정 또는 재경정하여야 한다. <개정 2008. 12. 26.>'
제17조3항={}
제17조[제17조3항_]=제17조3항
제17조4항_='④관할세무서장 또는 관할지방국세청장은 제2항 및 제3항에 따른 경정 및 재경정 사유가 「지방세법」 제115조제2항에 따른 재산세의 세액변경 또는 수시부과사유에 해당되는 때에는 대통령령으로 정하는 바에 따라 종합부동산세의 과세표준과 세액을 경정 또는 재경정하여야 한다. <개정 2008. 12. 26., 2010. 3. 31.>'
제17조4항={}
제17조[제17조4항_]=제17조4항
제17조5항_='⑤ 관할세무서장 또는 관할지방국세청장은 제8조제2항에 따라 과세표준 합산의 대상이 되는 주택에서 제외된 주택 중 같은 항 제1호의 임대주택 또는 같은 항 제2호의 가정어린이집용 주택이 추후 그 요건을 충족하지 아니하게 된 때에는 대통령령으로 정하는 바에 따라 경감받은 세액과 이자상당가산액을 추징하여야 한다. <신설 2008. 12. 26., 2011. 6. 7.>'
제17조5항={}
제17조[제17조5항_]=제17조5항
제18조_=' 제18조 삭제  '
제18조={}
제18조['종합부동산세법 제18조 삭제 ']={}
제4장[제18조_]=제18조
조['제18조 삭제 ']=제18조
제19조_=' 제19조 삭제  '
제19조={}
제19조['종합부동산세법 제19조 삭제 ']={}
제4장[제19조_]=제19조
조['제19조 삭제 ']=제19조
제20조_=' 제20조 (분납) '
제20조={}
제20조['종합부동산세법 제20조 (분납)']={}
제4장[제20조_]=제20조
조['제20조 (분납)']=제20조
제20조1항_='관할세무서장은 종합부동산세로 납부하여야 할 세액이 250만원을 초과하는 경우에는 대통령령으로 정하는 바에 따라 그 세액의 일부를 납부기한이 경과한 날부터 6개월 이내에 분납하게 할 수 있다. <개정 2008. 12. 26., 2018. 12. 31.>'
제20조1항={}
제20조[제20조1항_]=제20조1항
제5장_='제5장 보칙'
제5장={}
조문[제5장_]=제5장
제21조_=' 제21조 (과세자료의 제공) '
제21조={}
제21조['종합부동산세법 제21조 (과세자료의 제공)']={}
제5장[제21조_]=제21조
조['제21조 (과세자료의 제공)']=제21조
제21조1항_='①시장ㆍ군수는 「지방세법」에 따른 해당 연도 재산세의 부과자료 중 주택분 재산세의 부과자료는 7월 31일까지, 토지분 재산세의 부과자료는 9월 30일까지 행정안전부장관에게 제출하여야 한다. 다만, 시장ㆍ군수는 「지방세법」 제115조제2항에 따른 재산세의 세액변경 또는 수시부과사유가 발생한 때에는 그 부과자료를 매 반기별로 해당 반기의 종료일부터 10일 이내에 행정안전부장관에게 제출하여야 한다. <개정 2008. 2. 29., 2008. 12. 26., 2010. 3. 31., 2013. 3. 23., 2014. 1. 1., 2014. 11. 19., 2017. 7. 26.>'
제21조1항={}
제21조[제21조1항_]=제21조1항
제21조2항_='②행정안전부장관은 제7조에 규정된 주택에 대한 종합부동산세의 납세의무자를 조사하여 납세의무자별로 과세표준과 세액을 계산한 후, 매년 8월 31일까지 대통령령이 정하는 바에 따라 국세청장에게 통보하여야 한다. <개정 2008. 2. 29., 2013. 3. 23., 2014. 1. 1., 2014. 11. 19., 2017. 7. 26.>'
제21조2항={}
제21조[제21조2항_]=제21조2항
제21조3항_='③행정안전부장관은 제12조에 규정된 토지에 대한 종합부동산세의 납세의무자를 조사하여 납세의무자별로 과세표준과 세액을 계산한 후, 매년 10월 15일까지 대통령령이 정하는 바에 따라 국세청장에게 통보하여야 한다. <개정 2008. 2. 29., 2013. 3. 23., 2014. 1. 1., 2014. 11. 19., 2017. 7. 26.>'
제21조3항={}
제21조[제21조3항_]=제21조3항
제21조4항_='④행정안전부장관은 「지방세법」 제115조제2항에 따른 재산세의 세액변경 또는 수시부과사유가 발생한 때에는 재산세 납세의무자별로 재산세 과세대상이 되는 주택 또는 토지에 대한 재산세 및 종합부동산세 과세표준과 세액을 재계산하여 매 반기별로 해당 반기의 종료일이 속하는 달의 다음다음 달 말일까지 대통령령으로 정하는 바에 따라 국세청장에게 통보하여야 한다. <개정 2005. 12. 31., 2008. 2. 29., 2008. 12. 26., 2010. 3. 31., 2013. 3. 23., 2014. 1. 1., 2014. 11. 19., 2017. 7. 26.>'
제21조4항={}
제21조[제21조4항_]=제21조4항
제21조5항_='⑤행정안전부장관은 제1항의 규정에 의하여 시장ㆍ군수로부터 제출받은 재산세 부과자료를 제1항의 규정에 정한 날부터 10일 이내에 국세청장에게 통보하여야 한다. <신설 2005. 12. 31., 2008. 2. 29., 2013. 3. 23., 2014. 1. 1., 2014. 11. 19., 2017. 7. 26.>'
제21조5항={}
제21조[제21조5항_]=제21조5항
제21조6항_='⑥행정안전부장관 또는 국세청장은 종합부동산세 납세의무자의 세대원 확인 등을 위하여 필요한 경우 관련 기관의 장에게 가족관계등록전산자료의 제출을 요구할 수 있고, 자료 제출의 요구를 받은 관련 기관의 장은 정당한 사유가 없는 한 이에 응하여야 한다. <신설 2007. 1. 11., 2007. 5. 17., 2008. 2. 29., 2013. 3. 23., 2014. 1. 1., 2014. 11. 19., 2017. 7. 26.>'
제21조6항={}
제21조[제21조6항_]=제21조6항
제22조_=' 제22조 (시장ㆍ군수의 협조의무) '
제22조={}
제22조['종합부동산세법 제22조 (시장ㆍ군수의 협조의무)']={}
제5장[제22조_]=제22조
조['제22조 (시장ㆍ군수의 협조의무)']=제22조
제22조1항_='①관할세무서장 또는 관할지방국세청장은 종합부동산세의 과세와 관련하여 대통령령이 정하는 바에 의하여 과세물건 소재지 관할 시장ㆍ군수에게 의견조회를 할 수 있다.'
제22조1항={}
제22조[제22조1항_]=제22조1항
제22조2항_='②제1항의 규정에 의하여 의견조회를 받은 시장ㆍ군수는 의견조회 요청을 받은 날부터 20일 이내에 대통령령이 정하는 바에 의하여 관할세무서장 또는 관할지방국세청장에게 회신하여야 한다.'
제22조2항={}
제22조[제22조2항_]=제22조2항
제23조_=' 제23조 (질문ㆍ조사) '
제23조={}
제23조['종합부동산세법 제23조 (질문ㆍ조사)']={}
제5장[제23조_]=제23조
조['제23조 (질문ㆍ조사)']=제23조
제23조1항_='종합부동산세에 관한 사무에 종사하는 공무원은 그 직무수행상 필요한 때에는 다음 각호의 어느 하나에 해당하는 자에 대하여 질문하거나 당해 장부ㆍ서류 그 밖의 물건을 조사하거나 그 제출을 명할 수 있다. 이 경우 직무상 필요한 범위 외에 다른 목적 등을 위하여 그 권한을 남용해서는 아니 된다. <개정 2018. 12. 31.>'
제23조1항={}
제23조[제23조1항_]=제23조1항
제23조1항1호_='1. 납세의무자 또는 납세의무가 있다고 인정되는 자'
제23조1항1호={}
제23조1항[제23조1항1호_]=제23조1항1호
제23조1항2호_='2. 법인세법 제109조제2항제3호의 규정에 의한 경영 또는 관리책임자'
제23조1항2호={}
제23조1항[제23조1항2호_]=제23조1항2호
제23조1항3호_='3. 제1호에 규정하는 자와 거래관계가 있다고 인정되는 자'
제23조1항3호={}
제23조1항[제23조1항3호_]=제23조1항3호
제24조_=' 제24조 (매각ㆍ등기ㆍ등록관계 서류의 열람 등) '
제24조={}
제24조['종합부동산세법 제24조 (매각ㆍ등기ㆍ등록관계 서류의 열람 등)']={}
제5장[제24조_]=제24조
조['제24조 (매각ㆍ등기ㆍ등록관계 서류의 열람 등)']=제24조
제24조1항_='관할세무서장, 관할지방국세청장 또는 그 위임을 받은 세무공무원이 종합부동산세를 부과ㆍ징수하기 위하여 주택 및 토지 등 과세물건의 매각ㆍ등기ㆍ등록 그 밖의 현황에 대한 관계서류의 열람 또는 복사를 요청하는 경우에는 관계기관은 이에 응하여야 한다.'
제24조1항={}
제24조[제24조1항_]=제24조1항
제25조_=' 제25조 삭제  '
제25조={}
제25조['종합부동산세법 제25조 삭제 ']={}
제5장[제25조_]=제25조
조['제25조 삭제 ']=제25조
부칙['부칙  <제16109호, 2018. 12. 31.']={}
부칙['제1조(시행일) 이 법은 2019년 1월 1일부터 시행한다']={}
부칙['제2조(일반적 적용례) 이 법은 이 법 시행 이후 납세의무가 성립하는 분부터 적용한다']={}
부칙['제3조(분납에 관한 적용례) 제20조의 개정규정은 이 법 시행 이후 종합부동산세의 세액을 신고 또는 부과결정하는 분부터 적용한다']={}
bub={'서문':서문,'조문':조문,'조별':조,'부칙':부칙}
    
import wx
class MyFrame(wx.Frame):
    def __init__(self):
        wx.Frame.__init__(self, parent=None, title=bubname)
        self.SetSize(620, 520)
        self.mainPanel = wx.Panel(self)
        self.expandButton = wx.Button(self.mainPanel, label=bubname)
        self.tree = wx.TreeCtrl(self.mainPanel)
        root = self.tree.AddRoot(bubname)
        for i in bub:
            ii = self.tree.AppendItem(root, i)
            for j in bub[i]:
                jj = self.tree.AppendItem(ii, j)
                for k in bub[i][j]:
                    kk = self.tree.AppendItem(jj, k)
                    for m in bub[i][j][k]:
                        mm = self.tree.AppendItem(kk, m)
                        for n in bub[i][j][k][m]:
                            nn = self.tree.AppendItem(mm, n)
                            for p in bub[i][j][k][m][n]:
                                pp = self.tree.AppendItem(nn, p)
                                for q in bub[i][j][k][m][n][p]:
                                    qq=self.tree.AppendItem(pp,q)
                                    for r in bub[i][j][k][m][n][p][q]:
                                        rr=self.tree.AppendItem(qq,r)
                                        for s in bub[i][j][k][m][n][p][q][r]:
                                            ss = self.tree.AppendItem(rr, s)
                                            for t in bub[i][j][k][m][n][p][q][r][s]:
                                                tt = self.tree.AppendItem(ss, t)
                                                for u in bub[i][j][k][m][n][p][q][r][s][t]:
                                                    uu = self.tree.AppendItem(tt, u)
                                                    for v in bub[i][j][k][m][n][p][q][r][s][t][u]:
                                                        vv = self.tree.AppendItem(uu, v)
        self.staticText = wx.TextCtrl(self.mainPanel, style=wx.TE_MULTILINE)
        self.vtBoxSizer = wx.BoxSizer(wx.VERTICAL)
        self.vtBoxSizer.Add(self.expandButton, 0, wx.EXPAND | wx.ALL, 5)
        self.vtBoxSizer.Add(self.tree, 5, wx.EXPAND | wx.ALL, 5)
        self.vtBoxSizer.Add(self.staticText, 0, wx.EXPAND | wx.ALL, 5)
        self.mainPanel.SetSizer(self.vtBoxSizer)
        self.Bind(wx.EVT_BUTTON, self.OnExpandButton, self.expandButton)
        self.Bind(wx.EVT_TREE_SEL_CHANGED, self.OnNodeSelected, self.tree)
        self.Bind(wx.EVT_CLOSE, self.OnClose)

    def OnExpandButton(self, e):
        self.tree.ExpandAll()

    def __del__(self):
        print('소멸합니다.')

    def OnClose(self, event):
        frame.Destroy()

    def OnNodeSelected(self, e):
        selected = self.tree.GetSelection()
        self.staticText.SetLabel(self.tree.GetItemText(selected))
        self.mainPanel.Layout()
if __name__ == '__main__':
    app = wx.App(redirect=True)
    frame = MyFrame()
    wnd = wx.Frame(None, wx.ID_ANY, "")
    wnd.CenterOnScreen()
    app.SetTopWindow(wnd)
    frame.Show()
    app.MainLoop()
    