# -*- coding: utf-8 -*-
#Created on 2019년 @author: 권달현
조={};서문={};조문={};부칙 = {};bubname='종합부동산세법시행규칙'
편=장=절=관=항=조={} 
서문['']={}
서문['종합부동산세법 시행규']={}
서문['[시행 2017.3.10.] [기획재정부령 제600호, 2017.3.10., 일부개정']={}
서문['기획재정부(재산세제과) 044-215-431']={}
제1조_=' 제1조 (목적) '
제1조={}
제1조['종합부동산세법시행규칙 제1조 (목적)']={}
조문['제1조 (목적)']=제1조
조['제1조 (목적)']=제1조
제1조1항_='이 규칙은 「종합부동산세법」 및 동법 시행령에서 위임된 사항과 그 시행에 관하여 필요한 사항을 규정함을 목적으로 한다.'
제1조1항={}
제1조[제1조1항_]=제1조1항
제2조_=' 제2조 (임대주택 등의 과세표준 합산배제신고) '
제2조={}
제2조['종합부동산세법시행규칙 제2조 (임대주택 등의 과세표준 합산배제신고)']={}
조문['제2조 (임대주택 등의 과세표준 합산배제신고)']=제2조
조['제2조 (임대주택 등의 과세표준 합산배제신고)']=제2조
제2조1항_='① 「종합부동산세법 시행령」(이하 "영"이라 한다) 제3조제8항 본문에서 "기획재정부령으로 정하는 임대주택 합산배제신고서"란 별지 제1호서식(1) 및 별지 제1호서식(2)를 말한다. <개정 2014.3.14.>'
제2조1항={}
제2조[제2조1항_]=제2조1항
제2조2항_='② 영 제3조제8항 단서에서 "기획재정부령으로 정하는 사항"이란 임대주택의 소유권 또는 전용면적을 말한다.'
제2조2항={}
제2조[제2조2항_]=제2조2항
제2조3항_='③ 영 제4조제4항 본문에서 "기획재정부령으로 정하는 사원용주택등 합산배제 신고서"란 별지 제2호서식(1) 및 별지 제2호서식(2)를 말한다. <개정 2014.3.14.>'
제2조3항={}
제2조[제2조3항_]=제2조3항
제2조4항_='④ 영 제4조제4항 단서에서 "기획재정부령으로 정하는 사항"이란 기타주택의 소유권 또는 전용면적을 말한다.'
제2조4항={}
제2조[제2조4항_]=제2조4항
제2조['[전문개정 2008.4.29.]']={}
제2_02조_=' 제2조의2 삭제  '
제2_02조={}
제2_02조['종합부동산세법시행규칙 제2조의2 삭제 ']={}
조문['제2조의2 삭제 ']=제2_02조
조['제2조의2 삭제 ']=제2_02조
제2_03조_=' 제2조의3(저가로 제공하는 주택의 범위) '
제2_03조={}
제2_03조['종합부동산세법시행규칙 제2조의3(저가로 제공하는 주택의 범위)']={}
조문['제2조의3(저가로 제공하는 주택의 범위)']=제2_03조
조['제2조의3(저가로 제공하는 주택의 범위)']=제2_03조
제2_03조1항_='영 제4조제1항제1호 각 목 외의 부분 본문에서 "저가로 제공하는 사용자 소유의 주택"이란 과세기준일 현재의 전세금 또는 임대보증금(종업원이 부담하는 월세 등 임차료가 있는 경우에는 이를 「부가가치세법 시행규칙」제47조에 따라 국세청장이 정한 계약기간 1년의 정기예금이자율을 적용하여 1년으로 환산한 금액을 포함한다)이 해당주택 공시가격의 100분의 10 이하인 주택을 말한다. <개정 2009.5.12., 2013.6.28.>'
제2_03조1항={}
제2_03조[제2_03조1항_]=제2_03조1항
제2_03조['[본조신설 2008.4.29.]']={}
제3조_=' 제3조 삭제  '
제3조={}
제3조['종합부동산세법시행규칙 제3조 삭제 ']={}
조문['제3조 삭제 ']=제3조
조['제3조 삭제 ']=제3조
제4조_=' 제4조 (합산배제 미분양 주택의 범위) '
제4조={}
제4조['종합부동산세법시행규칙 제4조 (합산배제 미분양 주택의 범위)']={}
조문['제4조 (합산배제 미분양 주택의 범위)']=제4조
조['제4조 (합산배제 미분양 주택의 범위)']=제4조
제4조1항_='영 제4조제1항제3호 각 목 외의 부분에서 "기획재정부령이 정하는 미분양 주택"이란 주택을 신축하여 판매하는 자가 소유한 다음 각 호의 어느 하나에 해당하는 미분양 주택을 말한다. <개정 2008.4.29., 2009.5.12., 2011.9.7.>'
제4조1항={}
제4조[제4조1항_]=제4조1항
제4조1항1호_='1. 「주택법」 제16조에 따른 사업계획승인을 얻은 자가 건축하여 소유하는 미분양 주택으로서 2005년 1월 1일 이후에 주택분 재산세의 납세의무가 최초로 성립하는 날부터 5년이 경과하지 아니한 주택'
제4조1항1호={}
제4조1항[제4조1항1호_]=제4조1항1호
제4조1항2호_='2. 「건축법」 제11조에 따른 허가를 받은 자가 건축하여 소유하는 미분양 주택으로서 2005년 1월 1일 이후에 주택분 재산세의 납세의무가 최초로 성립하는 날부터 5년이 경과하지 아니한 주택. 다만, 다음 각 목의 요건을 모두 갖춘 주택은 제외한다.'
제4조1항2호={}
제4조1항[제4조1항2호_]=제4조1항2호
제4조1항2호가목_='가. 「주택법」 제38조에 따라 공급하지 아니한 주택'
제4조1항2호가목={}
제4조1항2호[제4조1항2호가목_]=제4조1항2호가목
제4조1항2호나목_='나. 자기 또는 임대계약 등 권원(權原)을 불문하고 타인이 거주한 기간이 1년 이상인 주택'
제4조1항2호나목={}
제4조1항2호[제4조1항2호나목_]=제4조1항2호나목
제4_02조_=' 제4조의2(정부출연연구기관의 범위) '
제4_02조={}
제4_02조['종합부동산세법시행규칙 제4조의2(정부출연연구기관의 범위)']={}
조문['제4조의2(정부출연연구기관의 범위)']=제4_02조
조['제4조의2(정부출연연구기관의 범위)']=제4_02조
제4_02조1항_='영 제4조제1항제7호에서 "기획재정부령으로 정하는 정부출연연구기관"이란 「정부출연연구기관 등의 설립·운영 및 육성에 관한 법률」, 「과학기술분야 정부출연연구기관 등의 설립·운영 및 육성에 관한 법률」,「한국국방연구원법」 및 「국방과학연구소법」에 따라 설립되거나 「특정연구기관육성법」의 적용을 받는 연구기관을 말한다.'
제4_02조1항={}
제4_02조[제4_02조1항_]=제4_02조1항
제4_02조['[본조신설 2009.5.12.]']={}
제5조_=' 제5조 (종합부동산세 부과·징수관련 서식) '
제5조={}
제5조['종합부동산세법시행규칙 제5조 (종합부동산세 부과·징수관련 서식)']={}
조문['제5조 (종합부동산세 부과·징수관련 서식)']=제5조
조['제5조 (종합부동산세 부과·징수관련 서식)']=제5조
제5조1항_='① 영 제8조제1항에서 "기획재정부령으로 정하는 세액산출명세서"란 「국세징수법 시행규칙」 별지 제10호의2 서식을 말한다. <신설 2008.4.29.>'
제5조1항={}
제5조[제5조1항_]=제5조1항
제5조2항_='②영 제8조제2항제1호에 따른 종합부동산세 신고서는 별지 제3호서식에 의한다. <개정 2007.9.27., 2008.4.29., 2009.5.12.>'
제5조2항={}
제5조[제5조2항_]=제5조2항
제5조3항_='③영 제8조제2항제2호에 따른 과세대상 물건명세서는 별지 제4호의2 서식(1), 별지 제4호의2 서식(2), 별지 제4호의3 서식(1), 별지 제4호의3 서식(2), 별지 제4호의4 서식(1) 및 별지 제4호의4서식(2)에 의한다. <개정 2007.9.27., 2008.4.29., 2009.5.12.>'
제5조3항={}
제5조[제5조3항_]=제5조3항
제5조4항_='④영 제8조제2항제3호에 따른 세부담 상한 초과세액 계산명세는 별지 제5호 서식에 의한다. <개정 2007.9.27., 2008.4.29., 2009.5.12.>'
제5조4항={}
제5조[제5조4항_]=제5조4항
제5조['[제목개정 2008.4.29.]']={}
제6조_=' 제6조 삭제  '
제6조={}
제6조['종합부동산세법시행규칙 제6조 삭제 ']={}
조문['제6조 삭제 ']=제6조
조['제6조 삭제 ']=제6조
제6_02조_=' 제6조의2(시가로 인정되는 부동산가액) '
제6_02조={}
제6_02조['종합부동산세법시행규칙 제6조의2(시가로 인정되는 부동산가액)']={}
조문['제6조의2(시가로 인정되는 부동산가액)']=제6_02조
조['제6조의2(시가로 인정되는 부동산가액)']=제6_02조
제6_02조1항_='① 영 제13조제3항에서 "기획재정부령으로 정하는 바에 따라 시가로 인정되는 것"이란 종합부동산세의 과세기준일 전 6월부터 과세기준일 현재까지의 기간 중에 확정된 가액으로서 다음 각 호의 어느 하나에 해당하는 것을 말한다. <개정 2013.2.23., 2015.3.6.>'
제6_02조1항={}
제6_02조[제6_02조1항_]=제6_02조1항
제6_02조1항1호_='1. 해당 부동산이 수용·공매 또는 「민사집행법」에 따라 경매된 경우에는 그 보상가액·공매가액 또는 경매가액'
제6_02조1항1호={}
제6_02조1항[제6_02조1항1호_]=제6_02조1항1호
제6_02조1항2호_='2. 해당 부동산을 2 이상의 감정기관(「부동산 가격공시 및 감정평가에 관한 법률」 제2조제9호에 따른 감정평가업자를 말한다)이 평가한 감정가액이 있는 경우에는 그 감정가액의 평균액'
제6_02조1항2호={}
제6_02조1항[제6_02조1항2호_]=제6_02조1항2호
제6_02조1항3호_='3. 「지방세법」 제10조제5항제1호 및 제3호에 따른 취득가액(사실상의 취득가액이 있는 경우만을 말한다)'
제6_02조1항3호={}
제6_02조1항[제6_02조1항3호_]=제6_02조1항3호
제6_02조2항_='② 제1항에 따라 시가로 인정되는 가액이 2 이상인 경우에는 과세기준일부터 가장 가까운 날에 해당하는 가액에 의한다.'
제6_02조2항={}
제6_02조[제6_02조2항_]=제6_02조2항
제6_02조['[본조신설 2008.4.29.]']={}
제6_03조_=' 제6조의3(분납신청관련 서식) '
제6_03조={}
제6_03조['종합부동산세법시행규칙 제6조의3(분납신청관련 서식)']={}
조문['제6조의3(분납신청관련 서식)']=제6_03조
조['제6조의3(분납신청관련 서식)']=제6_03조
제6_03조1항_='영 제16조제2항에서 "기획재정부령으로 정하는 신청서"란 별지 제16호 서식을 말한다.'
제6_03조1항={}
제6_03조[제6_03조1항_]=제6_03조1항
제6_03조['[본조신설 2008.4.29.]']={}
제7조_=' 제7조 (과세자료의 제공관련 서식) '
제7조={}
제7조['종합부동산세법시행규칙 제7조 (과세자료의 제공관련 서식)']={}
조문['제7조 (과세자료의 제공관련 서식)']=제7조
조['제7조 (과세자료의 제공관련 서식)']=제7조
제7조1항_='①영 제17조제1항의 규정에 의한 통보는 별지 제8호서식에 의한다.'
제7조1항={}
제7조[제7조1항_]=제7조1항
제7조2항_='②영 제17조제2항에 따른 통보는 별지 제9호서식(1), 별지 제9호서식(2), 별지 제9호서식(3), 별지 제9호서식(4), 별지 제9호서식(5) 또는 별지 제9호서식(6)에 따른다. <개정 2006.7.13.>'
제7조2항={}
제7조[제7조2항_]=제7조2항
제7조3항_='③영 제17조제3항의 규정에 의한 통보는 별지 제10호서식(1) 내지 별지 제10호서식(3)에 의한다.'
제7조3항={}
제7조[제7조3항_]=제7조3항
제7조4항_='④영 제17조제4항에 따른 통보는 별지 제11호서식(1), 별지 제11호서식(2), 별지 제11호서식(3) 또는 별지 제11호서식(4)에 따른다. <개정 2006.7.13.>'
제7조4항={}
제7조[제7조4항_]=제7조4항
제8조_=' 제8조 (의견조회관련 서식) '
제8조={}
제8조['종합부동산세법시행규칙 제8조 (의견조회관련 서식)']={}
조문['제8조 (의견조회관련 서식)']=제8조
조['제8조 (의견조회관련 서식)']=제8조
제8조1항_='①영 제18조제1항의 규정에 의한 의견조회는 별지 제12호서식에 의한다.'
제8조1항={}
제8조[제8조1항_]=제8조1항
제8조2항_='②영 제18조제2항의 규정에 의한 회신은 별지 제13호서식에 의한다.'
제8조2항={}
제8조[제8조2항_]=제8조2항
제9조_=' 제9조 (조사원증) '
제9조={}
제9조['종합부동산세법시행규칙 제9조 (조사원증)']={}
조문['제9조 (조사원증)']=제9조
조['제9조 (조사원증)']=제9조
제9조1항_='영 제19조의 규정에 의한 조사원증은 별지 제14호서식에 의한다.'
제9조1항={}
제9조[제9조1항_]=제9조1항
제10조_=' 제10조 삭제  '
제10조={}
제10조['종합부동산세법시행규칙 제10조 삭제 ']={}
조문['제10조 삭제 ']=제10조
조['제10조 삭제 ']=제10조
제11조_=' 제11조 삭제  '
제11조={}
제11조['종합부동산세법시행규칙 제11조 삭제 ']={}
조문['제11조 삭제 ']=제11조
조['제11조 삭제 ']=제11조
부칙['부칙  <제600호, 2017.3.10.']={}
부칙['이 규칙은 공포한 날부터 시행한다']={}
bub={'서문':서문,'조문':조문,'조별':조,'부칙':부칙}
    
import wx
class MyFrame(wx.Frame):
    def __init__(self):
        wx.Frame.__init__(self, parent=None, title=bubname)
        self.SetSize(620, 520)
        self.mainPanel = wx.Panel(self)
        self.expandButton = wx.Button(self.mainPanel, label=bubname)
        self.tree = wx.TreeCtrl(self.mainPanel)
        root = self.tree.AddRoot(bubname)
        for i in bub:
            ii = self.tree.AppendItem(root, i)
            for j in bub[i]:
                jj = self.tree.AppendItem(ii, j)
                for k in bub[i][j]:
                    kk = self.tree.AppendItem(jj, k)
                    for m in bub[i][j][k]:
                        mm = self.tree.AppendItem(kk, m)
                        for n in bub[i][j][k][m]:
                            nn = self.tree.AppendItem(mm, n)
                            for p in bub[i][j][k][m][n]:
                                pp = self.tree.AppendItem(nn, p)
                                for q in bub[i][j][k][m][n][p]:
                                    qq=self.tree.AppendItem(pp,q)
                                    for r in bub[i][j][k][m][n][p][q]:
                                        rr=self.tree.AppendItem(qq,r)
                                        for s in bub[i][j][k][m][n][p][q][r]:
                                            ss = self.tree.AppendItem(rr, s)
                                            for t in bub[i][j][k][m][n][p][q][r][s]:
                                                tt = self.tree.AppendItem(ss, t)
                                                for u in bub[i][j][k][m][n][p][q][r][s][t]:
                                                    uu = self.tree.AppendItem(tt, u)
                                                    for v in bub[i][j][k][m][n][p][q][r][s][t][u]:
                                                        vv = self.tree.AppendItem(uu, v)
        self.staticText = wx.TextCtrl(self.mainPanel, style=wx.TE_MULTILINE)
        self.vtBoxSizer = wx.BoxSizer(wx.VERTICAL)
        self.vtBoxSizer.Add(self.expandButton, 0, wx.EXPAND | wx.ALL, 5)
        self.vtBoxSizer.Add(self.tree, 5, wx.EXPAND | wx.ALL, 5)
        self.vtBoxSizer.Add(self.staticText, 0, wx.EXPAND | wx.ALL, 5)
        self.mainPanel.SetSizer(self.vtBoxSizer)
        self.Bind(wx.EVT_BUTTON, self.OnExpandButton, self.expandButton)
        self.Bind(wx.EVT_TREE_SEL_CHANGED, self.OnNodeSelected, self.tree)
        self.Bind(wx.EVT_CLOSE, self.OnClose)

    def OnExpandButton(self, e):
        self.tree.ExpandAll()

    def __del__(self):
        print('소멸합니다.')

    def OnClose(self, event):
        frame.Destroy()

    def OnNodeSelected(self, e):
        selected = self.tree.GetSelection()
        self.staticText.SetLabel(self.tree.GetItemText(selected))
        self.mainPanel.Layout()
if __name__ == '__main__':
    app = wx.App(redirect=True)
    frame = MyFrame()
    wnd = wx.Frame(None, wx.ID_ANY, "")
    wnd.CenterOnScreen()
    app.SetTopWindow(wnd)
    frame.Show()
    app.MainLoop()
    