# -*- coding: utf-8 -*-
# 2018-12-24 권달현
양도소득세_비과세={ # 양도소득세
    '1세대1주택의 범위':{
        '1세대1주택의 비과세요건':{},
        '보유기간 및 거주기간의 제한을 받지 아니한 경우':{},
        '거주기간의 제한을 받지 아니한 경우':{},
        '보유 및 거주기간의 계산':{},
        '동일한 날에 2주택 이상 양도시 양도순서 판정방법':{},
        '매수자의 등기지연으로 1세대2주택이 된 경우':{},
        '양도계약후 주택철거하여 나대지로 인도한 경우':{},
        '동일세대원간 소유권 변경된 경우':{},
    },
    '1세대의 범위':{
        '배우자가 있는 1세대':{},
        '배우자가 없는 1세대':{},
        '부부간에 각각 단독세대를 구성한 경우':{},
        '이혼시 위자료로 대물변제한 경우':{},
        '이혼시 재산분할청구권으로 부동산 이전된 경우':{},
        '위장이혼 여부':{},
        '동일세대인 경우':{},
        '동일세대 아닌 경우':{},
        '독립세대 여부':{},
    },
    '주택의 판정':{
        '주택의 판정':{},
        '공동소유주택의 주택수 계산':{},
        '한울타리 안의 수개의 주택을 동시에 양도':{},
        '사실상 1주택으로 보는 경우':{},
        '공부상 주택이나 사실상 영업용 건물인 경우':{},
        '주택 등의 판정 사례':{},
        '용도변경한 경우':{},
        '주택을 놀이방 등 일시 비거주용으로 사용한 경우':{},
        '주택신축판매업자 또는 부동산매매업자의 재고주택':{},
    },
    '주택의 부수토지':{
        '주택 부수토지의 범위':{},
        '무허가건물의 부수토지 범위':{},
        '부수토지의 계산방법':{},
        '재개발주택의 부수토지 면적이 증가한 경우':{},
    },
    '주택의 분할 양도등':{
        '1세대1주택의 토지,주택의 지분(분할)양도':{},
        '보유기간 및 거주기간의 제한을 받지 아니한 경우':{},
        '일시적 2주택 상태에서 종전주택의 일부가 수용된 경우의 잔존주택 양도기한':{},
    },
    "국외이주 등": {
        '보유기간 및 거주기간의 제한을 받지 아니한 경우':{},
        '비거주자의 과세방법 등':{},
        '해외이주신고 후 양도한 경우':{},
        '세대원의 출국 요건':{},
        '일반분양벋은 경우':{},
        '재개발,재건축 주택인 경우':{},
        '해외이주후 국내의 주택을 노후 등으로 멸실 후 신축하여 양도한 경우':{},
        '국외이주후 다시 귀국하여 양도한 경우':{},
        '일시적 2주택 상태에서 국외이주한 경우':{},
        '해외이주전 합가한 경우':{},
        '비거주자인 상태에서 취득 및 양도한 경우':{},
    },
    "근무 등의 부득이한 사유": {
        '보유기간 및 거주기간의 제한을 받지 아니한 경우':{},
        '아파트 등 중도금 불입중 근무지 이전한 경우': {},
        '통근가능한 거리인 경우': {},
        '1년이상 거주기간의 계산': {},
        '농사를 짓기 위해 주거이전한 경우': {},
        '요양목적 등으로 주거이전한 경우': {},
    },
    "일시적 1세대 2주택": {
        '비과세 요건':{},
        '3년이내에 양도하지 못하는 부득이한 사유 등': {},
        '특례기간의 계산': {},
        '기존주택 멸실 후 재건축한 경우': {},
        '상속받은 경우': {},
        '부담부증여시 적용 여부': {},
        '고가주택 양도시 적용여부': {},
        '일시적 3주택인 경우': {},
        '일시적 4주택인 경우': {},
        '종전주택이 재건축대사으로 인간후 사실상 주거용으로 사용하고 있는 경우': {},
        '종전주택이 보유기간 드의 제한을 받지 않는 경우': {},
    },
    "상속으로 인한 1세대2주택": {
        '상속으로 2주택이 된 경우':{},
        '공동상속주택의 소수지분자': {},
        '협의분할등기하지 아니한 겨우의 상속주택 소유자 판정방법': {},
        '상속주택 해당여부': {},
        '상속 등으로 3주택 된 경우': {},
        '동일세대원으로부터 상속받은 경우': {},
    },
    "노부모 봉양을 위한 일시적 1세대2주택": {
        '비과세 요건':{},
        '일시적 3주택이 된 경우': {},
        '일시적 4주택이 된 경우': {},
        '과세되는 경우': {},
        '비과세되는 경우': {},
    },
    "혼인으로 인한 일시적 1세대2주택": {
        '비과세 요건':{},
        '일시적 3주택이 된 경우': {},
        '일시적 4주택이 된 경우': {},
        '과세되는 경우': {},
        '비과세되는 경우': {},
    },
    '장기저당담보주택에 대한 1세대1주택 비과세특례':{
        '비과세 요건':{},
        '동거봉양하기 위하여 합가로 2주택인 경우': {},
        '계약기간 만료 전 양도하는 경우': {},
        '신고기한 및 제출서류': {},
    },
    '지정문화재 등의 1세대2주택':{},
    "이농(귀농,상속)주택(이농주택 등 농어촌주택) 보유자의 과세특례": {
        '농어촌주택 보유시 비과세 요건':{},
        '이농주택의 범위': {},
        '귀농주택의 범위': {},
        '추징사유': {},
        '특례신고서의 신고기한 및 제출서류': {},
    },
    "실수요 목적(취학,근무 등) 취득한 수도권 밖 주택의 과세특례": {
        '비과세 요건':{},
        '부득이한 사유':{},
        '확인서류': {},
        '세대원 중 일부가 주거이전 못한 경우': {},
        '과세특례 적용 사례': {},
    },
    '다가구주택':{
        '적용범위':{},
        '다가구주택의 고급(고가)주택의 판정': {},
        '다가구주택 등을 용도변경한 경우': {},
        '보유기간의 계산': {},
    },
    '겸용주택':{
        '겸용주택의 범위':{},
        '주택이 큰 경우': {},
        '주택이 적은 경우': {},
        '용도변경한 경우': {},
        '겸용주택 중 2층주택의 전요주택의 구분':{},
        '영업용 건물의 일부에 주거용 방이 있는 경우': {},
    },
    "고급(고가)주택의 판정": {
        '고가주택의 범위':{},
        '고가주택인 경우':{},
        '고가주택이 아닌 경우':{},
    },
    '재개발,재건축 주택':{
        '거주기간 또는 보유기간 계산의 특례':{},
        '재개발,재건축의 입주권의 범위': {},
        '재개발,재건축 후의 양도': {},
        '인가 전에 토지만 양도한 경우의 비과세 여부': {},
        '건물 면적 증감에 관계없이 종전주택의 부수토지를 초과한 경우': {},
        '재건축사업으로 주택의 일부 환지청산금 교부받은 경우': {},
        '재개발입주권을 관리처분계획의 변경 없이 다르게 분양받은 경우': {},
        '관리처분계획인가 후에도 사실상 주택으로 이용한 경우': {},
        '시유지를 불하받은 경우': {},
    },
    '조합원입주권의 양도 특례':{
        '비과세 요건':{},
        '3년 이내에 양도하지 못하는 부득이한 사유 등': {},
        '조합원입주권 양도시 일시적 2주택 적용여부': {},
        '관리처분계획인가일 현재 2주택인 경우': {},
        '조합원입주권을 상속,증여받은 후 준공전 양도하는 경우': {},
        '조합원입주권2채를 받은 후 1채 양도한 경우': {},
        '기존주택을 소유한 자의 범위 중 보유 및 거주기간의 제한을 받지 않은 경우': {},
    },
    '조합원입주권의 주택의제':{
        '주택과 조합원입주권을 보유한 1세대가 주택을 양도한 경우': {},
        '주택과 조합원입주권을 소유한 경우 1세대 1주택의 특례': {},
        '조합원입주권 취득 후 3년 내에 종전주택 양도한 경우': {},
        '조합원입주권 취득 후 3년 경과하여 종전주택 양도한 경우': {},
        '재개발,재건축사업 시행기간 도안 대체주택 취득후 대체주택 양도한 경우': {},
        '상속받은 조합원입주권과 일반주택을 소유한 1세대가 일반주택을 양도한 경우': {},
        '상속받은 주태 또는 상속받은 조합원입주권 외에 일반주택과 일반조합원입주권을 소유한 1세대가 일반주택을 양도한 경우': {},
        '동거봉양한 경우': {},
        '혼인한 경우': {},
        '지정,등록문화재주택과 일반주택 및 조합원입주권을 소유한 1세대가 일반주택을 양도한 경우': {},
        '이농주택과 일반주택 및 조합원입주권을 소유한 1세대가 일반주택을 양도한 경우': {},
        '조합원입주권 소유자 1세대1주택 특례적용신고서 신고기한 및 제출서류': {},
        '행정정보의 공동이용시 세무서장의 확인서류': {},
        '1년이상 계속 거주하지 아니한 경우의 추징': {},
    },
    '임대주택사업자의 거주용 자가주택 비과세 특례 ': {
        '비과세 요건': {},
        '임대기간요건 또는 운용기간요건 충족 전 거주주택 양도하는 경우': {},
        '추징': {},
        '제출서류': {},
        '세무서장의 확인': {},
    },
    '1세대1주택 비과세': {},
    '1세대1주택 비과세 특례': {},
    "1세대1주택 비과세 요건": {},
    "새로운 주택 취득 후 조합원입주권의 양도": {},
    "조합원입주권 취득 후 종전주택의 양도": {},
    "수용 등으로 분할양도한 주택": {},
    "배우자 또는 직계존비속의 증요자산에 대한 이월과세 적용 배제": {},
}
양도소득세_감면={ # 양도소득세
    '주택에 대한 양도소득세 감면 요약':{},
    '재개발 재건축 주택 ': {},
    '조세특례제한법상 감면대상 주택 ': {},
    "장기임대주택(거주자)에 대한 양도소득세의 감면": {
        '감면요건':{},
        '건설임대주택':{},
        '매입임대주택': {},
        '다가구용 단독주택의 감면 여부': {},
        '1세대1주택 판정시 주택수 포함여부': {},
        '장기임대주택의 소득구분': {},
        '겸용주택의 범위': {},
        '세액감면신청 등': {},
        '주택임대기간의 계산': {},
    },
    "신축임대주택(거주자)에 대한 양도소득세의 감면특례": {
        '감면요건': {},
        '거주자의 범위': {},
        '1세대1주택 판정 등 준용': {},
        '1세대1주택 판정시 주택수 포함 여부': {},
        '분양권을 타인으로부터 취득한 경우의 감면여부': {},
    },
    "준공임대주택(거주자)등에 대한 양도소득세의 과세특례": {
        '특례요건': {},
        '과세특례 적용 신청': {},
        '임대기간의 계산 등 준용': {},
    },
    "장기임대주택(거주자,비거주자)에 대한 양도소득세의 과세특례": {
        '특례요건': {},
        '과세특례 적용 신청 등 준용': {},
        '임대기간의 계산 등 준용': {},
    },
    "준공임대주택(거주자)등에 대한 양도소득세의 세액감면": {
        '감면요건': {},
        '감면소득의 계산': {},
        '중복적용 배제': {},
        '과세특례 적용 신청 등 준용': {},
    },
    "임대주택부동산투자회사의 현물출자자(내국인)에 대한 과세특례 등": {
        '특례요건': {},
        '납부(과세)이연': {},
        '손금산입': {},
        '현물출자를 2회 이상 하는 경우': {},
        '결정세액 및 대가의 기준': {},
        '추징사유 및 납부': {},
        '과세특례 적용 신청 등': {},
    },
    "기업형 임대사업자에게 양도한 토지(거주자)에 대한 과세특례": {
        '특례요건': {},
        '세액감면신청': {},
        '추징사유 및 납부': {},
        '이자상당가산액': {},
    },
    "서울시 밖(거주자)의 미분양주택에 대한 과세특례": {
        '과세특례요건': {},
        '미분양국민주택의 범위': {},
        '1세대1주택 판정시 주택수 포함 여부': {},
        '과세특례 적용 신청기한 및 제출서류': {},
        '보유기간의 계산': {},
    },
    "수도원 밖(거주자)의 지방 미분양주택 취득자에 대한 양도소득세의 과세특례": {
        '적용대상': {},
        '부동산매매업자의 비교 과세특례': {},
        '1세대1주택 판정시 주택수 제외': {},
        '과세표준확정신고 등': {},
    },
    "서울시 밖(거주자,비거주자)의 미분양주택 취득자에 대한 양도소득세의 과세특례": {
        '감면요건': {},
        '1세대1주택 판정시 주택수 제외': {},
        '장기보유특별공제액 및 세율 적용의 특례': {},
        '신고기한 및 제출서류': {},
        '미분양주택 현황': {},
        '미분양주택 확인': {},
        '주요 사례': {},
    },
    "비거주자의 주택 취득에 대한 양도소득세의 과세특례": {},
    "수도권 밖(거주자,비거주자)의 미분양주택 취득자에 대한 양도소득세의 과세특례": {
        '감면요건': {},
        '미분양주택': {},
        '미분양주택 제외': {},
        '5년간 발생한 양도소득금액의 산정': {},
        '분양가격 인하율': {},
        '1세대1주택 판정시 주택수 제외': {},
        '장기보유특별공제액 및 세율 적용의 특례': {},
        '신고기한 및 제출서류': {},
        '미분양주택 현황': {},
        '미분양주택 확인': {},
        '지방 미분양주택 감면 계산사례': {},
    },
    "준공후 미분양주택(거주자,비거주자)의 취득자에 대한 양도소득세의 과세특례": {
        '감면요건': {},
        '사업주체 등': {},
        '준공후 미분양주택의 범위': {},
        '준공후 미분양주택 제외': {},
        '5년간 발생한 양도소득금액의 산정': {},
        '임대기간의 계산': {},
        '1세대1주택 판정시 주택수 제외': {},
        '장기보유특별공제액 및 세율 적용의 특례': {},
        '신고기한 및 제출서류': {},
        '준공후미분양주택의 현황': {},
        '준공후미분양주택의 확인': {},
    },
    "미분양주택(내국인)의 취득자에 대한 양도소득세의 과세특례": {
        '감면요건': {},
        '1세대1주택 판정시 주택수 제외': {},
        '5년간 발생한 양도소득금액의 산정': {},
        '신고기한 및 제출서류': {},
        '미분양주택 현황': {},
        '미분양주택 확인': {},
    },
    "준공후 미분양주택의 취득자(거주자)에 대한 양도소득세의 과세특례": {
        '감면요건': {},
        '1세대1주택 판정시 주택수 제외': {},
        '5년간 발생한 양도소득금액의 산정': {},
        '제출서류': {},
    },
    "신축주택(거주자)의 취득자에 대한 양도소득세의 감면": {
        '감면요건': {},
        '주택의 범위': {},
        '분양계약 해제 후 재계약한 경우': {},
        '감면대상 양도소득금액의 산정': {},
        '1세대1주택 판정시 주택수 제외': {},
        '감면신청 및 제출서류': {},
        '분양권 승계취득한 경우': {},
    },
    "신축,미분양주택(거주자,비거주자) 등 취득자에 대한 양도소득세의 과세특례": {
        '감면요건': {},
        '신축주택,미분양주택 등의 범위': {},
        '신축주택,미분양주택 등에서 제외': {},
        '1세대1주택자의 주택의 범위': {},
        '감면대상기존주택에서 제외': {},
        '분양사업자 등의 범위': {},
        '1세대1주택 판정시 주택수 제외': {},
        '투기지역 감면 배제': {},
        '감면신청': {},
        '5년간 발생한 양도소득금액의 산정': {},
        '신축주택 등의 관리': {},
        '선납할인금액 등': {},
        '감면대상주택이 고가주택에 해당하는 경우': {},
        '주요 문답자료': {},
        '신축주택(거주자)의 취득을 위한 주택 양도에 대한 양도소득세의 특례': {},
    },
    "신축주택(거주자)의 취득자에 대한 양도소득세의 과세특례": {
        '감면요건': {},
        '고급(고가)주택의 판정방법': {},
        '주택의 범위': {},
        '조합원의 범위': {},
        '분양권을 상속으로 승계취득한 경우': {},
        '감면대상 양도소득금액의 산정': {},
        '주택의 비과세와 감면 동시 동시적용여부': {},
        '분양계약 해제후 배우자 등이 재계약한 경우': {},
        '1세대1주택 판정시 주택수 포함여부': {},
        '감면신청 및 제출서류': {},
        '신축가면주택의 토지와 건물소유자가 다른 경우': {},
        '신축주택 취득후 일부 지분을 배우자에게 증여한 경우': {},
        '분양권 승계취득한 경우': {},
        '감면되는 경우': {},
        '감면되지 아니하는 경우': {},
    },
    "농어촌주택,고향주택 취득자(거주자)에대한 과세특례": {
        '적용대상': {},
        '동일,연접한 행정구역 적용대상 제외': {},
        '농어촌주택 3년 보유 전 일반주택 양도한 경우': {},
        '사후관리': {},
        '과세특례 신고': {},
        '증축,토지 추가 취득한 경우': {},
        '농어촌지역해당 여부 판단시기': {},
        '농어촌주택의 범위': {},
        '비과세대상인 경우': {},
        '괏[ㅔ대상인 경우': {},
    },
    "장기임대사업자용 주택(거주자)으로 일정기간 이상 임대 후 양도하는 주택은 중과세 적용 배제": {},
}
양도소득세_다주택자중과={
    '다주택자 중과규정':{
        '2017.8.3부터 2018.3.31까지 적용되는 규정':{},
        '2018.4.1부터 적용되는 규정':{},
        '1세대3주택 이상에 해당하는 주택의 범위':{},
        '1세대3주택 입주권에서 제외되는 주택의 범위':{},
        '양도소득세가 중과세되는 1세대2주택에 해당하는 주택의 범위':{},
        '1세대2주택 조합원입주권에서 제외되는 주택의 범위':{}
    },
    '1세대3주택 이상의 주택': {
        '1세대3주택 이상 중과여부 판정기준': {},
        '주택수의 계산': {},
        '장기임대주택의 임대기간의 계산': {},
        '임대주택의 사후관리': {},
        '동일한 날에 2개 이상의 주택을 양도하는 경우': {},
        '일반세율적용신청서 제출기한 및 제출서류': {},
        '행정정보의 공동이용시 세무서장의 확인서류': {},
        '혼인에 따른 1세대3주택 이상자의 야도소득세 중과제도 특례': {},
    },
    '1세대가 주택과 조합원입주권의 합이 3이상인 경우의 주택': {
        '주택,조합원입주권의 중과 여부 판정 기준': {},
        '장기임대주택 등 중과 제외': {},
        '주택수,임대기간,일반세율적용신청서 제출 등 준용규정': {},
        '혼인에 따른 1세대3주택 이상자의 양도세 중과제도': {},
        '주택수와 조합원입주권수의 합이 3이상인 경우 중과세율 적용여부': {},
        '인가일 이후에도 철거하지 않고 사실상 주거용으로 사용하고 있는 경우': {},
    },
    '1세대2주택': {
        '1세대2주택 중과 제외 판정기준': {},
        '주택수,임대기간,일반세율적용신청서 제출 등 준용규정': {},
    },
    '1세대가 주택과 조합원입주권을 각각 1개씩 보유한 경우의 주택': {
        '주택,조합원입주권의 중과여부 판정기준':{},
        '장기임대주택 등 중과 제외': {},
        '주택수,임대기간,일반세율적용신청서 제출 등 준용규정': {},
    },
}
양도소득세={
    '주택_양도소득세_비과세':양도소득세_비과세,
    '주택_양도소득세_감면':양도소득세_감면,
    '양도소득세_다주택자중과':양도소득세_다주택자중과,
}

#___________________________________________________
제목='주택'
_={
    #"기업회계":기업회계,
    #"법인세":법인세,
    #"조세특례제한법":조세특례제한법,
    #"증여세":증여세,
    "양도소득세":양도소득세,
    #"농어촌특별세":{},
}
tax=_
import wx
class MyFrame(wx.Frame):
    def __init__(self):
        wx.Frame.__init__(self,parent=None,title=제목)
        self.SetSize(420,320*2)
        self.mainPanel=wx.Panel(self)
        self.expandButton=wx.Button(self.mainPanel,label='펼침')
        self.tree=wx.TreeCtrl(self.mainPanel)
        root=self.tree.AddRoot(제목)
        for i in tax:
            ii=self.tree.AppendItem(root,i)
            for j in tax[i]:
                jj=self.tree.AppendItem(ii,j)
                for k in tax[i][j]:
                    kk=self.tree.AppendItem(jj,k)
                    for m in tax[i][j][k]:
                        mm=self.tree.AppendItem(kk,m)
                        for n in tax[i][j][k][m]:
                            nn=self.tree.AppendItem(mm,n)
                            for p in tax[i][j][k][m][n]:
                                pp=self.tree.AppendItem(nn,p)
                                for q in tax[i][j][k][m][n][p]:
                                    qq=self.tree.AppendItem(pp,q)
                                    for r in tax[i][j][k][m][n][p][q]:
                                        rr=self.tree.AppendItem(qq,r)

        self.staticText =wx.TextCtrl(self.mainPanel,style=wx.TE_MULTILINE)


        self.vtBoxSizer=wx.BoxSizer(wx.VERTICAL)
        self.vtBoxSizer.Add(self.expandButton,0,wx.EXPAND|wx.ALL,5)
        self.vtBoxSizer.Add(self.tree        ,5,wx.EXPAND|wx.ALL,5)
        self.vtBoxSizer.Add(self.staticText  ,0,wx.EXPAND|wx.ALL,5)


        self.mainPanel.SetSizer(self.vtBoxSizer)

        self.Bind(wx.EVT_BUTTON          ,self.OnExpandButton,self.expandButton)
        self.Bind(wx.EVT_TREE_SEL_CHANGED,self.OnNodeSelected,self.tree)
    def OnExpandButton(self,e):
        self.tree.ExpandAll()
    def OnNodeSelected(self,e):
        selected=self.tree.GetSelection()
        self.staticText.SetLabel(self.tree.GetItemText(selected))

        self.mainPanel.Layout()
if __name__=='__main__':
    app=wx.App()
    frame=MyFrame()
    frame.Show()
    app.MainLoop()
#___________________________________________________
