# -*- coding: utf-8 -*-
#Created on 2018-12-24 @author: 권달현
import 법인세법,법인세법시행령
고유목적사업준비금={
    "고유목적사업 준비금 (법법§29) (조특법§74) ": {

        "사유 발생일이 속하는 사업연도 ": {},
        "일시 － 3년내 미사용잔액 익금산입 ": {},
        "일시 － 다음 사유 발생시 미사용 잔액  해산한 때  고유목적사업을 전부 폐지한 때  법인으로 보는 단체가 승인 취소 또는 거주자로 변경된 때  5년내 고유목적사업에 사용하지 아니한 때 * 손금계상후 5년내 준비금을 임의 환입가능 (2014.1.1.이후 개시 사업 연도 분부터 적용)": {},

    },
    "고유목적사업준비금 손금산입 특례(§74) ": {

                    " 사립학교법에 따른 학교법인  산학협력단, 평생교육시설을 운영 하는 비영리법인  사회복지사업법에 의한 사회복 지법인  국립대학교병원 및 서울 대학 교병원, 국립암센터, 지방의료원, 국립중앙의료원  도서관 박물관 미술관 운영 법인  지방문화원 예술의전당  공무원연금공단, 사립학교 교직원 연금공단 등 ": {},
                    " 수익사업에서 발생한 소득 금액 전액 * 도서관, 박물관, 미술관 운영법인은 당해 사업과 당해 시설 안에서 이용자를 대상으로 한 수익사업에 한함 ": {},
                    "100 ": {},
                    "수익사업에서 발생한 소득금액 ": {},
                    "100 ": {},
                    " 해당 사업연도 손실보전준비금 손금 계상액 ": {},

                },
    "손금산입 범위":{},
    "법인으로 보는 단체 중 고유목적사업준비금 설정대상 제외단체": {},
    "환입사유 및 시기": {},
    "환입시 이자상당액의 가산": {},
    "제출서류": {},
    "고유목적사업준비금의 승계": {},
}
책임준비금={
    "법법§30":법인세법.제30조,
    "손금산입":{

                    "대 상 법 인 손금산입 범위 환 입 ": {},
                    "보험회사(수협 공제사업, 무역 보험공사의 무역보험사업, 새마을 금고 공제사업, 중소 기업협동조합 공제사업, 건설 공제조합의 공제 사업 포함) ": {},
                    "① 당해 사업연도말 현재 모든 보험계약 해약시 지급할 환급액(해약공제액포함) + ② 당해 사업 연도말 현재 기발생보험 사고에 대한 추정보험금 상당액 * + ③ 법령§57①3호에 따라 적립한 배당 준비금 ": {},
                    "①, ②는 다음 사업 연도에 익금산입": {},
                    "③은 법령§57②에 따라 처리 ": {},
                    "* 2012.2.2. 이후 최초로 신고하는 분부터는 손해사정, 보험대위 및 구상권 행사 등에 소요될 것으로 예상되는 금액을 포함함": {},
                    "* 중소기업협동조합, 건설공제조합의 공제사업은 2013. 2.15. 영 시행일 이후 신고하는 분부터 적용": {},
                    "☞ 국제회계기준을 적용하는 법인의 경우 환급액과 금융위원회가 기획재정부장관과 협의하여 고시한 최소적립액중 큰 금액으로 합니다. ": {},
                },
    "익금산입":{
        "다음 사업연도 ": {},
        "일시 － 직전사업연도 손금산입액을 일시 익금산입 * 2009.1.1부터 3년 후 익금산입 추가": {},
    },
}
비상위험준비금={
    "법령§57⑦":법인세법시행령.제57조,
    "손금산입": {

                    "대 상 법 인 손금산입 범위 처 리 등 ": {},
                    "보험회사(수산업협동조합법에 의한 공제사업, 무역보험법에 의한 무역보험사업, 새마을 금고법에 따른 공제사업 포함) ": {},
                    " 당해 사업연도의 단기손해보험(인보험의 경우 에는 해약환급금 이나 만기지급금이 없는 사망 보험 및 질병보험에 한함)에 의한 보유 보험료의 합계액 × 금융감독위원회가 정하는 보험종목별 적립기준율 - 준비금의 누적액 한도 당해 사업연도의 단기손해보험에 의한 경과 보험료의 합계액의 50%(자동차 보험은 40%, 보증보험은 150% * ) * 2017.2.3. 이후 과세표준을 신고하는 분부터 적용 ": {},
                    "준비금의 처리 및 경과 보험료의 계산방법은 보험업법시행령§63 및동 시행규칙§29에 따라 금융위원회가 정하는 바에 의함(규칙§30). ": {},
                    "☞ 2011.1.1.이후 개시하는 사업연도 분부터 K-IFRS를 적용하는 보험사는 비상위험준비금을 신고조정으로 손금에 산입할 수 있습니다. ": {},
                },
    "익금산입": {},
}
연구인력개발준비금={
    "3년이 되는 날이 속하는 사업연도 ": {},
    "사용분 3년 ": {},
    "- 개발비 등 사용한 금액에 상당하는 준비금은 3년간 분할환입  비용사용액에 상당하는 준비금 ": {},
    "× ": {},
    "사업연도월수 36 = 당해연도 익금산입액": {},
    "미사용분 일시 ": {},
    "- 미사용 준비금은 전액 일시 환입 - 폐업 해산시는 익금에 산입하지 아니한 준비 금계정 전액을 익금산입": {},
    "* 조특법§9 연구 및 인력개발준비금 손금산입제도 적용기한 종료(’13.12.31. 일몰종료) ": {},
}
자본확충목적회사의손실보전준비금= {
    "- 준비금과 상계 후 잔액을 5년이 되는 사업연도에 일시익금산입 - 폐업 해산시는 익금에 산입하지 아니한 준비 금계정 전액을 익금산입 ": {},
    "자본확충목적회사 손실보전준비금 (§104의3) * 2009.5.21. 이후 준비금 손금계상 분부터 적용 ": {
        " 다음 중 적은 금액 손금산입": {},
        "① 해당사업연도 손실보전준비금 손금 산입 전 소득금액 전액": {},
        "② 신종자본증권 잔액의 10%에서 해당 사업연도 종료일 현재 손실보전 준비금 잔액을 차감한 금액": {},
    },
}
여수세계박람회참가준비금={}
신용회복목적회사의손실보전준비금= {
    "- 준비금과 상계 후 잔액을 10년이 되는 사업연도에 일시 익금산입 - 폐업 해산시는 익금에 산입하지 아니한 준비금계정 전액을 익금산입 ": {},
    "(다) 신용회복목적회사 손실보전준비금 (§104의12) * 2010.1.1. 이후 신고분부터 적용 ": {},
}
법인세={
    "직전연도 이전에 손금에 산입한 준비금 충당금 등은 - 계속하여 법인에 유보시켜 손금이 실제로 발생될 때에 상계하는 것과 - 일정기한이 경과할 때까지 발생한 손금과 상계되지 아니한 금액을 일시 또는 분할하여 환입하는 것이 있습니다. ": {},
    "고유목적사업준비금": 고유목적사업준비금,
    "책임준비금(법법§30)": 책임준비금,
    "계약자 배당 준비금 (법법§30) * 2009.1.1.부터 책임 준비금으로 통합 ": {

                    "3년이 되는 날이 속하는 사업연도 ": {},
                    "사유 발생일이 속하는 사업연도 ": {},
                    "일시 － 다음 사유 발생시 잔액  해산한 때(보험업 영위 합병법인이 승계시 제외)  보험사업의 허가가 취소된 때": {},
                },
    "구상채권 상각 충당금 (법법§35) ": {

                    "다음 사업연도 ": {},
                    "일시 － 대손충당금과 같은 방법으로 익금 산입 ": {},

                    "종 류 ": {},
                    "환입개시 사업연도 ": {},
                    "환입기간 익 금 산 입 범 위 ": {},
                    "5년이 되는 날이 속하는 사업연도 ": {},
                    "사용분 준비금 상계 ": {},
                    "미사용분 일시 ": {},
                    "- 손실이 발생할 때에 손실보전준비금과 상계 ": {},
                    "5년이 되는 날이 속하는 사업연도 ": {},
                    "사용분 준비금 상계 ": {},
                    "미사용분 일시 ": {},
                    "- 손실이 발생할 때에 손실보전준비금과 상계 ": {},
                },
    "비상위험준비금 (법령§57⑦)": 비상위험준비금,
}
조세특례제한법={
    "고유목적사업준비금 손금산입 특례(§74) ": 고유목적사업준비금,
    "연구 및 인력개발 준비금 (조특법§9) ":연구인력개발준비금,
    "자본확충목적회사에 대한 손실보전준비금 (조특법§104의3) * 2009.5.21.이후 준비금 계상 분부터 손금":자본확충목적회사의손실보전준비금,
    "여수세계박람회 참가준비금":여수세계박람회참가준비금,
    "신용회복목적회사 손실보전준비금 (조특법§104의12) * 2010.1.1.이후 신고 분부터 적용":신용회복목적회사의손실보전준비금,
}

#___________________________________________________
제목='준비금'
_={
    #"지방소득세_법인세분 가산세": 지방소득세_법인세분,
    #"기업회계":기업회계,
    "법인세":법인세,
    "조세특례제한법":조세특례제한법,
    #"증여세":증여세,
    #"상속세":상속세,
    #"양도소득세":양도소득세,
    #"농어촌특별세":{},
}
tax=_
import wx
class MyFrame(wx.Frame):
    def __init__(self):
        wx.Frame.__init__(self,parent=None,title=제목)
        self.SetSize(420,320*2)
        self.mainPanel=wx.Panel(self)
        self.expandButton=wx.Button(self.mainPanel,label='펼침')
        self.tree=wx.TreeCtrl(self.mainPanel)
        root=self.tree.AddRoot(제목)
        for i in tax:
            ii=self.tree.AppendItem(root,i)
            for j in tax[i]:
                jj=self.tree.AppendItem(ii,j)
                for k in tax[i][j]:
                    kk=self.tree.AppendItem(jj,k)
                    for m in tax[i][j][k]:
                        mm=self.tree.AppendItem(kk,m)
                        for n in tax[i][j][k][m]:
                            nn=self.tree.AppendItem(mm,n)
                            for p in tax[i][j][k][m][n]:
                                pp=self.tree.AppendItem(nn,p)
                                for q in tax[i][j][k][m][n][p]:
                                    qq=self.tree.AppendItem(pp,q)
                                    for r in tax[i][j][k][m][n][p][q]:
                                        rr=self.tree.AppendItem(qq,r)
        self.staticText =wx.TextCtrl(self.mainPanel,style=wx.TE_MULTILINE)

        self.vtBoxSizer=wx.BoxSizer(wx.VERTICAL)
        self.vtBoxSizer.Add(self.expandButton,0,wx.EXPAND|wx.ALL,5)
        self.vtBoxSizer.Add(self.tree        ,5,wx.EXPAND|wx.ALL,5)
        self.vtBoxSizer.Add(self.staticText  ,0,wx.EXPAND|wx.ALL,5)
        self.mainPanel.SetSizer(self.vtBoxSizer)
        self.Bind(wx.EVT_BUTTON          ,self.OnExpandButton,self.expandButton)
        self.Bind(wx.EVT_TREE_SEL_CHANGED,self.OnNodeSelected,self.tree)
    def OnExpandButton(self,e):
        self.tree.ExpandAll()
    def OnNodeSelected(self,e):
        selected=self.tree.GetSelection()
        self.staticText.SetLabel(self.tree.GetItemText(selected))
        #self.
        self.mainPanel.Layout()
if __name__=='__main__':
    app=wx.App()
    frame=MyFrame()
    frame.Show()
    app.MainLoop()
#___________________________________________________