# -*- coding: utf-8 -*-
# 2018-12-24 권달현
업종기준={
      "소비성서비스업을 제외한 모든 업종을 주된 사업으로 영위하는 법인":{},
      '업종의 구분':{},
      '겸업의 경우 중소기업 해당업종 판정':{},
      }
규모기준={
      "상시 사용하는 종업원":{},
      "자기자본":{},
      "자본금":{},
      "매출액":{},
      }
독립성기준={
       '소유 및 경영의 실질적인 독립성':{},
       }
유예기간={
      '중소기업으로 보는 유예기간':{},
      '중소기업의 유예기간 적용':{
                '유예기간 적용 대상':{},
                '유예 적용 방법':{},
                '유예기간 적용 제외':{},
                },
      }
중소기업세제지원={
        "법인세법상 지원":{},
        "조세특례제한법상 지원":{},
        }      

법인세={
    '세법상의 중소기업 요건':{
        "업종기준":업종기준,
        "규모기준":규모기준,
        '독립성기준':독립성기준,
        '중소기업으로 보는 유예기간':유예기간,
        '졸업기준 이내일 것':{},
    },
    '중소기업에 대한 세법상 지원내용':중소기업세제지원,
    "연결법인의 중소기업 판정":{},
    "국세청": {
            "  중소기업에 해당하는 법인은 일반법인에 비하여 각종 혜택이 주어집니다.": {},
            "※ 조세특례제한법의 ‘중소기업’과 중소기업기본법의 ‘중소기업’은 일치하지 않으며 ’15.6.30. 일부 개정된 중소기업기본법 시행령은 공포한 날로부터 시행(일부 조문 제외)되므로 법령 등의 적용에 유의해야 합니다. ": {},
            "가. 세법상의 중소기업 요건 (조특령§2①) ": {
                "(1) 소비성서비스업을 제외한 모든 업종을 주된 사업으로 영위하는 법인 ": {
                    "소비성서비스업(조특령§29③) ": {},
                    "1. 호텔업 및 여관업(「관광진흥법」에 따른 관광숙박업은 제외) 2. 주점업(일반유흥주점업, 무도유흥주점업 및 「식품위생법 시행령」 제21조에 따른 단란주점 영업만 해당하되, 「관광진흥법」에 따른 외국인전용유흥음식점업 및관광유흥 음식점업은 제외) 3. 그 밖에 오락·유흥 등을 목적으로 하는 사업으로서 기획재정부령으로 정하는 사업 ": {},
                },
                "(2) 매출액 ": {
                    "  업종별로 중소기업기본법시행령  별표1 의 기준 이내이어야 함. ": {},
                },
                "(3) 소유 및 경영의 실질적인 독립성 ": {
                    "  중소기업기본법시행령 제3조 제1항 제2호의 규정에 적합한 기업 -  독점규제 및 공정거래에 관한 법률 에 의한 상호출자제한기업집단 또는 채무보증 제한기업집단에 속하지 아니하는 회사 - 직전사업년도말 자산총액 5,000억원 이상인 법인(외국법인을 포함)이 발행주식 총수의 30% 이상을 직 간접적으로 소유( 자본시장과 금융 투자업에 관한 법률 에 ": {},
                    "따른 집합투자기구를 통한 간접소유의 경우는 제외)한 최대주주인 기업이 아닐 것(중소기업기본법 시행령§3①2호 나목 참조) ": {},
                    "* 간접소유 비율은  국제조세조정에 관한 법률 시행령  §2② 준용 ": {},
                    "- 관계기업 * 에 속하는 기업의 경우 중기령 제7조의4에 따라 산정한 매출액이 조특령 제2조제1항제1호에 따른 중소기업 기준에 해당할 것 ": {},
                    "* 관계회사제도：중소기업 규모(매출액) 판단시 출자관계 형성 기업간 합산하여 계산하는 제도 ": {},
                },
                "(4) 졸업기준 이내일 것 ": {"  자산총액이 5천억 원 이상 ": {}, },
            },
            "나. 중소기업의 판정 요령 ": {
                "(1) 업종의 구분 ": {},
                "   조세특례제한법 에 특별한 규정이 있는 것을 제외하고는  통계법  제22조에 따라 통계청장이 고시하는 한국표준산업분류에 따름 ": {},
                "(2) 매출액 ": {},
                "  기업회계기준에 따라 작성한 손익계산서상의 매출액 ": {},
                "(3) 자산총액 ": {},
                "  과세연도 종료일 현재 재무상태표상 자산총액 ": {},
                "(4) 겸업의 경우 중소기업 해당업종 판정 ": {},
                "  사업별 수입금액이 큰 사업을 주된 사업으로 봄(조특령 §2③) ": {},
                "* 중소기업 해당여부는 사업전체의 매출액을 기준으로 판정함 ": {},
            },
            "다. 중소기업의 유예기간 적용 (조특령 §2②) ": {
                "(1) 유예기간 적용 대상 ": {},
                "  중소기업의 매출액이 업종별로  중소기업기본법 시행령  [별표 1] 초과   졸업기준에 해당하는 경우   관계기업 기준에 따라 중소기업에 해당하지 아니하게 되는 경우   중소기업이  중소기업기본법 시행령  제3조제1항제2호, 별표 1 및 별표 2의 개정으로 새로이 중소기업에 해당하지 아니하게 되는 때(조특령 §2⑤) ": {},
                "(2) 유예 적용 방법 ": {},
                "  최초 그 사유가 발생한 과세연도와 그 다음 3과세연도까지 중소기업으로 봄   유예기간이 경과한 후에는 과세연도별로 중소기업 해당여부 판정 ": {},
                "(3) 유예기간 적용 제외 ": {},
                "   중소기업기본법 의 규정에 의한 중소기업 외의 기업과 합병하는 경우": {},
                "  유예기간 중에 있는 기업과 합병하는 경우": {},
                "  소유 및 경영의 실질적인 독립성기준에 적합한 기업 외의 기업에 해당되는 경우(조특령§2①3) ": {},
                "* 관계기업 기준에 따라 중소기업에 해당하지 아니하게 되는 경우는 제외 ": {},
                "  창업일이 속하는 과세연도 종료일부터 2년 이내의 과세연도 종료일 현재 중소기업 기준초과": {},
                "  주업종이 중소기업 외의 업종으로 변경되는 경우(기본통칙 4-2…5) ": {},
                "* 조특령§6⑤ 소기업은 유예기간 없음 ": {},
                "참고：예규 ": {

            " 중소기업 해당업종 판정 ": {},
            "- 겸업 법인의 주업종 판정방법 2이상의 서로 다른 사업을 영위하는 법인이 사업별  사업수입금액 이 큰 사업을 주된 사업으로 보아 조세특례제한법 시행령 제2조 제1항의 규정에 의한 중소기업 해당여부를 판정함에 있어서,  사업수입금액 이라 함은 같은 법 시행규칙 제2조 제4항의 규정에 의한 매출액(기업회계기준에 따라 작성한 손익계산서상의 매출액)을 말하는 것임(서면2팀-1170, 2007.6.21.)": {},
            "- 해외 위탁생산시 업종구분 및 감면대상 여부 제품을 직접 제조하지 아니하고 국외에 소재하는 제조업체에 의뢰하여 제조하는 경우에는 중소기업의 업종을 판단함에 있어서 제조업이 아닌 도매업으로 보는 것이며, 도매업으로서 중소기업에 해당하는 경우에는 같은법 제7조제1항제1호(어)목의 규정에 의해 주문자상표 부착방식에 의한 수탁생산업에 해당하여 중소기업에 대한 특별세액감면을 적용받을 수 있음(법인세과-2707, 2016.10.27.)": {},
            "- 한국표준산업분류 변경으로 조세특례를 적용받지 못하게 되는 경우 내국법인이 ‘제조업’에 해당하는 “비금속재생재료 가공처리업”을 영위하던 중 2008.2.1. 한국표준산업분류의 개정으로 해당 업종이 ‘하수 폐기물처리, 원료재생및 환경복원업’으로 변경된 경우,  조세특례제한법  제7조의 중소기업에 대한 특별 세액감면을 적용함에 있어 같은법 시행령 제6조제5항의 ‘소기업’에 해당하는지 여부는 같은법 제2조제3항 단서에 따라 2009사업연도까지는 변경 전의 한국표 준산업분류에 따른 업종으로 판단하는 것임(법규법인 2009-434, 2009.12.29.)": {},
            "  한국표준산업분류가 변경된 과세연도와 그 다음 과세연도까지는 변경 전의 한국표준 산업분류에 따른 업종에 따라 조세특례를 적용 ": {},
            " 유예기간 적용 ": {},
            "- 소기업은 유예기간 적용 않음 중소기업 유예기간 내의 법인으로서 상시 사용하는 종업원 수가 소기업의 요건을 충족하지 못하는 법인은 중소기업에 대한 특별세액감면 규정이 적용되는 소기업이 아님(재경부 조예-290, 2006.5.12.)": {},
            "- 간접소유비율 적용으로 독립성기준 불충족시 중소기업 유예기간 적용  조세특례제한법 시행령 (2008.2.22. 대통령령 제20620호로 개정된 것) 제2조 제1항 제3호의 요건을 갖추지 아니하여 중소기업 적용이 배제되는 경우 같은 조 ": {},
            "110 2018 법인세 신고안내 ": {},
            "제5항 및 같은 시행령 부칙 제3조 제1항에 따라 2009사업연도(2009.1.1.~2009.": {},
            "12.31.)와 그 다음 3개 사업연도까지 중소기업으로 보는 것임(기획재정부 조세특례제 도과-972, 2011.10.26.)": {},
            "- 유예기간중의 중소기업이 물적분할 시 분할신설법인의 유예기간 승계  조세특례제한법 시행령  제2조 제2항 본문에 따라 ‘유예기간’의 적용을 받던 법인이  법인세법  제46조 제2항 각 호의 요건을 갖춰 분할하거나 같은 법 제47조 제1항의 규정에 따라 물적분할함에 있어, 분할신설법인이  조세특례제한법 시행령  제2조 제1항 제1호의 ‘규모기준’을 초과 하더라도 분할 당시 분할법인의 잔존 ‘유예기간’내에 종료하는 각 과세연도까지는 중소기업으로 보는 것임(법인세과-776, 2010.8.20.)": {},
            "- 창업법인의 유예기간 적용 여부  조세특례제한법 시행령  제2조 제2항에 의한 “중소기업 유예기간”을 적용함에 있어 중소기업이 “창업일이 속하는 과세연도의 다음 과세연도종료일 현재 중소기업기준을 초과하는 경우”의 사유로 중소기업에 해당하지 아니하게 된 경우에는 유예기간을 적용하지 아니하는 것임(법인세과-428, 2009.4.9.)": {},
            "- 중소기업 유예 적용 여부  중소기업기본법 시행령 (2011.1.28., 대통령령 제22652호로 일부개정된 것) 별표 2의 개정 및  조세특례제한법 시행령 (2010.12.30., 대통령령 제22583호로 일부개정된 것) 제2조 제1항 제3호의 개정에 따라 새로이 중소기업에 해당하지 아니하게 되는 경우에는  조세특례제한법 시행령 (2012.2.2., 대통령령 제23590호로 일부개정된 것) 제2조 제5항에 따른 “ 중소기업기본법 시행령  제3조 제1항 제2호, 별표 1 및 별표 2의 개정으로 새로이 중소기업에 해당하지 아니하게 되는 때”에 해당하지 아니하는 것임(법령해석과-2650, 2015.10.2.)": {},
            "- 조세특례를 적용하기 위한 관계기업 판단 기준일 ": {},
            " 조세특례제한법 시행령  제2조 제1항 제3호에 따른 중소기업 판정시  중소기업 ": {},
            "기본법 시행령  제3조 제1항 제2호다목의 관계기업에 대한 요건은 매출액, 자산 총액 등 다른 일반적인 규모 기준과 동일하게 과세연도 종료일을 기준으로 판단 함(재조특-52, 2014.1.23.) ": {},

        },
            "라. 중소기업에 대한 세법상 지원내용·112 ": {}, },
            "라. 중소기업에 대한 세법상 지원내용 ": {
                "법인세법상 지원 ": {},
                "내 용 일 반 법 인 중 소 기 업 ": {},
                "접대비 한도액 (법법§25) (조특법§136) ": {},
                "- 용인한도액：①＋②": {},
                "① 기본금액 1,200만원": {},
                "② 수입금액×수입금액 적용율 0.03％∼0.2％ ": {},
                "- 용인한도액：①＋②": {},
                "① 기본금액 2,400만원": {},
                "② 좌동 ": {},
                "결손금소급공제 해당없음 선택에 의해 가능 분납기간(법법§64) 납부기한 경과일부터 1월 이내 납부기한 경과일부터 2월 이내 ": {},
                "조세특례제한법상 지원 ": {},
                "내 용 일 반 법 인 중 소 기 업 ": {},
                "중소기업투자세액공제 (조특법 §5) ": {},
                "해당없음 투자금액 × 3％(중소기업 중 2015.1.1.": {},
                "부터 2015.12.31.까지 신규 상장한 중소기업과 신규 상장 중견기업은 이후 3년간 4%)": {},
                "창업중소기업 등에 대한 세액감면(조특법 §6) ": {},
                "해당없음 창업후(벤처기업 확인 후) 최초로 소득이 발생한 연도와 그 후 4년간 법인세 50％감면 * 청년창업 중소기업：최초로 소득이 발생한 연도와 그 후 2년간 75%, 그이후 2년 50%": {},
                "중소기업에 대한 특별세액감면 (조특법 §7) * 2005.1.1. 이후 최초 개시 사업 연도 분부터 본점기준 에서 사업장 기준으로 변경 (본점이 수도권 안에 있는 경우에는 모든 사업장을 수도권으로 보아 감면비율 적용) ": {},
                "해당없음 - 소기업   도매업등：10%   수도권안 도매업등 외：20%   수도권밖 도매업등 외：30% - 중기업   수도권밖 도매업등：5%   수도권밖 도매업등 외：15%   수도권안 지식기반：10% * 도매업등：도매업, 소매업, 의료업 ": {},

                "내 용 일 반 법 인 중 소 기 업 ": {},
                "기업의 어음제도 개선을 위한 세액공제 (조특법§7의2) ": {},
                "* 2013.12.31.까지 중소기업에 지급한 구매대 금에 대해 적용 ": {},
                "- 네트워크론제도를 이용하여 중소 기업에 지급하는 구매대금   (30일내 결제금액 - 약속어음결제액) × 0.4%   (31∼60일내 결제금액- 약속어음 결제액) × 0.15％ * 한도：법인세의 10% ": {},
                "- 기증받은 설비가액에 상당하는 금액 손금산입(과세이연) ": {},
                "- 신성장동력 원천기술연구개발비 × 30% ": {},
                "- 중소기업이 환어음, 판매대금 추심 의뢰서, 지급기한이 60일 이내인 기업구매전용카드, 상환기한이 60일 이내인 외상 매출채권 담보대출및 대금결제 기한이 60일 이내인 구매론 네트워크론 등을 이용하여 결제한 경우   (30일내 결제금액－약속어음 결제액) × 0.5%   (31∼60일내 결제금액-약속어음 결제액) × 0.15％ * 한도：법인세의 10%": {},
                "상생결제 지급금액에 대한 세액공제 (조특법§7의4) ": {},
                "해당없음 - 중소기업이 상생결제제도를 통해 중소기업에 구매대금 지급한 경우   지급기한 15일내 지급금액 × 0.2%   지급기한 15일∼60일내 지급금액 × 0.1％ * 한도：법인세의 10%": {},
                "중소기업지원설비에 대한 손금산입 특례(조특법§8) ": {},
                "내국인이 사업용자산을 중소기업에 무상기증 또는 저가 양도시   기증금액 손금산입 ": {},
                "연구 및 인력개발비 세액공제 (조특법§10) ": {},
                "신성장동력 원천기술연구개발비 × 최대 30%〔20% + (매출액 대비 신성장 R&D 비중 × 3배〕 ": {},
                "위 해당 선택 않은 경우": {},
                "① ②중 많은 것 선택": {},
                "① 직전년도 발생액 초과금액 × 30%": {},
                "② 당해연도 R&D비용 × [기본1% + 최대 2% (매출액 대비 R&D 비중의 1/2) 〕 ": {},
                "위 해당 선택 않은 경우": {},
                "① ②중 많은 것 선택": {},
                "① 직전년도 발생액 초과금액 × 50%": {},
                "② 당해연도 R&D비용 × 25% * 중소기업 졸업에 따른 공제율 단계적 인하": {},
                "- 중소기업 졸업이후(유예기간 포함) 3년간 15%, 그 이후 2년간 10%": {},
                "※ 중견기업 공제율 신설 (’13.1.1.이후 개시 과세 연도)": {},
                "① ②중 많은 것 선택": {},
                "① 직전년도 발생액 초과금액 × 40%": {},
                "② 당해연도 R&D비용 ×8% ": {},
                "☞ 중견기업(조특령§9④) 1. 중소기업이 아닐 것 2. 주된 사업이 중소기업 대상 업종 3. 소유와 경영의 실질적 독립성 충족 4. 직전 3년 평균 매출액 5천억원 미만 ": {},

                "- 취득금액의 10% (세액공제, 법인세의 10% 한도) ": {},
                "생산성 향상시설 투자세액공제 (조특법§24) ": {},
                "내 용 일 반 법 인 중 소 기 업 ": {},
                "- 투자금액의 1%(대기업), 3%(중견기업) - 투자금액의 6% ": {},
                "연구 및 인력개발 설비투자 세액공제(조특법§11) ": {},
                "기술이전 및 기술취득 등에 대한 과세특례 (조특법§12) ": {},
                "해당없음 - 특허권 등 이전소득에 대한 법인세 50% 감면 - 특허권 등 대여소득에 대한 법인세 25% 감면": {},
                "- 취득 * 금액의 5% (세액공제, 법인세의 10% 한도) * 중소기업으로부터 기술취득에 한정 ": {},
                "- 투자금액의 3%(대기업), 5%(중견기업) - 투자금액의 7% - 타인설비를 인터넷 이용하는(ASP 방식) 비용의 7%": {},
                "안전설비투자 등에 대한 세액공제(조특법§25) ": {},
                "- 투자금액의 3%(대기업), 5%(중견기업) - 투자금액의 7% - 중소기업의 기술유출방지설비 투자 × 10%": {},
                "에너지 절약시설 투자세액공제 (조특법§25의2) ": {},
                "- 투자금액의 1%(대기업), 3%(중견기업) - 투자금액의 6% ": {},
                "환경보전시설 투자세액공제 (조특법§25의3) ": {},
                "- 투자금액의 3%(대기업), 5%(중견기업) - 투자금액의 10% ": {},
                "의약품 품질관리 개선시설 투자세액공제 (조특법§25의4) ": {},
                "- 투자금액의 1%(대기업), 3%(중견기업) - 투자금액의 6% ": {},
                "신성장기술 사업화시설 투자세액공제 (조특법§25의5) ": {},
                "- 투자금액의 5%(대기업), 7%(중견기업) - 투자금액의 10% ": {},
                "영상콘텐츠 제작비용 세액공제 (조특법§25의6) ": {},
                "- 투자금액의 5%(대기업), 7%(중견기업) -영상콘텐츠 제작비용의 10% * 공제시기：방송 영화상영이 되는 날이 속하는 사업연도 ": {},

                "내 용 일 반 법 인 중 소 기 업 ": {},
                "고용창출 투자세액공제 (조특법§26) ": {},
                "구 분 ": {},
                "합계 ": {},
                "일반기업 중견기업 중소기업 수도권 내 수도권 밖 수도권 내 수도권 밖 수도권 내 수도권 밖": {},
                "기본공제 ": {},
                "0% 0% 1% 2% 3% 3% 고용감소시 배제 허용 추가 공제 ": {},
                "일반 3% 4% 5%(4%) 6%(5%) 6%(4%) 7%(5%) 서비스 4% 5% 6%(5%) 7%(6%) 7%(5%) 8%(6%) ": {},
                "일반 3% 4% 6%(5%) 8%(7%) 9%(7%) 10%(8%) 서비스 4% 5% 7%(6%) 9%(8%) 10%(8%) 11%(9%)": {},
                "* 중소기업에 한해 고용 감소 시에도 투자금액에 기본공제율을 곱한 금액에서 감소 인원당 1천만원 공제금액 축소 * 추가세액 공제한도：고용증가인원 × 1천 ~ 2천5백만원 * ( )는 2017.4.18.전 투자분에 적용(부칙 제14760호, 제6조)": {},
                "산업수요맞춤형고등학교등 졸업자를 병역이행 후복직 시킨 중소기업에 대한 세액 공제 (조특법§29의2) ": {},

                "해당없음 - 근로의 대가로 지급하는 비용에서 퇴직소득과 퇴직급여충당금을 제외한 인건비 × 10% ": {},
                "해당없음 - 재고용 후 2년간 지급 인건비 × 10% ": {},
                "- 직전 3년 평균 초과 임금증가분 × 5%(중견기업 10%) ": {},
                "- 직전 3년 평균 초과 임금증가분 × 10%": {},
                "- 정규직 전환근로자의 전년대비 임금증가액 합계 × 5% (중견기업 10%) ": {},
                "- 정규직 전환근로자의 전년대비 임금증가액 합계 × 20% ": {},
                "경력단절 여성 재고용 중소기업에 대한 세액공제 (조특법§29의3) * 경력단절사유에 임신 추가 ": {},
                "근로소득을 증대시킨 기업에 대한 세액공제 (조특법§29의4) ": {},
                "청년고용을 증대시킨 기업에 대한 세액공제 (조특법§29의5) ": {},
                "- 청년 정규직 근로자 증가 인원 * × 300만원(중견기업 700만원) * 공제 인적한도：": {},
                "MIN[전체 정규직 근로자 증가인원, 전체 상시근로자 증가인원]": {},
                "* 소비성서비스업은 제외 ": {},
                "- 청년 정규직 근로자 증가인원 * × 1,000만원 * 공제 인적한도：": {},
                "MIN[전체 정규직 근로자 증가 인원, 전체상시근로자 증가 인원]": {},
                "* 소비성서비스업은 제외 ": {},
                "Ⅰ. 법인세의 신고 납부 115 ": {},
                "- 좌동 ": {},
                "내 용 일 반 법 인 중 소 기 업 ": {},
                "정규직 근로자 전환에 따른 세액공제 (조특법§30의2) ": {},
                "중견기업이 2016.6.30. 현재 비정규직을 정규직으로 전환시 1인당 500만원 ": {},
                "- 2016.6.30. 현재 비정규직을 정규직으로 전환시 1인당 700만원 ": {},
                "고용유지중소기업 등에 대한 과세특례 (조특법§30의3) ": {},
                "해당없음 - 소득공제：상시근로자 1인당 연간 임금총액 감소액 × 상시근로자수 × 50% * '09.5.21. 속하는 과세연도부터 적용": {},
                "중소기업 고용증가 인원에 대한 사회보험료 세액공제 (조특법§30의4) ": {},
                "해당없음 - 청년(15∼29세)상시근로자 순증인원의 사회보험료 100% - 청년외 상시근로자 순증인원의 사회 보험료 50%": {},
                "사업전환 중소기업 세액감면 (조특법§33의2) ": {},
                "해당없음 - 업종전환 중소기업의 법인세 4년간 50% 감면 * 5년 이상 사업영위 중소기업 대상": {},
                "수도권과밀억제권역외 지역 이전 중소기업 세액감면 (조특법§63) ": {},
                "해당없음 - 이전일 이후 최초로 소득이 발생하는 과세연도와 그후 6년(4년)간 100%, 그후 3년(2년)간 50% * 공장이 없는 경우 §63의2(법인 본사의 수도권 밖 이전 감면) 적용": {},
                "법인의 공장 본사 수도권 밖 이전에 대한 세액감면 (조특법§63의2) ": {},
                "중소기업과 동일 - 이전일 이후 최초로 소득이 발생하는 과세연도와 그후 6년(4년)간 100%, 그후 3년(2년)간 50% * 소비성서비스업, 부동산임대   중개   매매업, 건설업 등은 제외": {},
                "농공단지 입주기업 등에 대한 세액감면 (조특법§64) ": {},
                "- 농공단지 안에서 농어촌소득원 개발사업을 영위하는 내국인은 최초 소득 발생연도와 그 후의 4년간 법인세 50% 감면 ": {},
                "- 지방중소기업 특별지원지역 입주시 최초소득 발생연도와 그후 4년간 법인세 50%감면": {},
                "중소기업 공장이전에 대한 과세특례 (조특법§85의8) ": {},
                "해당없음 - 10년 이상 공장을 영위한 중소 기업이 수도권과밀억제권역 밖 으로 이전하기 위해 공장 양도한 경우 양도차익 상당액 2년 거치 후 2년 동안 균등액 익금산입 ": {},
                "116 2018 법인세 신고안내 ": {},
                "내 용 일 반 법 인 중 소 기 업 ": {},
                "정규직 근로자 전환에 따른 세액공제 (조특법§30의2) ": {},
                "중견기업이 2016.6.30. 현재 비정규직을 정규직으로 전환시 1인당 500만원 ": {},
                "- 2016.6.30. 현재 비정규직을 정규직으로 전환시 1인당 700만원 ": {},
                "- 좌동 ": {},
                "Ⅰ ": {},
                "벤처기업 등에 출자시 세액공제 (조특법§13의2) ": {},
                "중소기업과 동일 - 벤처기업 등에 출자시 출자금액의 5% 세액공제 ": {},
                "최저한세 (조특법§132) ": {},
                "① ②중 큰 금액": {},
                "① 각종 감면후의 세액": {},
                "② 감면전의 과세표준 × 최저한세율 ": {},
                "* 중소기업과 일반기업의 최저한세율 차등적용 ": {},
                "구 분 과세표준 ’10년 ": {},
                "’11∼ ’12년 ": {},
                "’13년 ’14년∼ ": {},
                "중소기업 유예기간 4년 포함 7% 7% 7% 7% ": {},
                "일반기업 ": {},
                "유예기간 이후 1∼3년차 - 8% 8% 8%": {},
                "유예기간 이후 4∼5년차 - 9% 9% 9%": {},
                "100억 이하 10% ": {},
                "10% 10% 10% 1천억 이하 11% 12% 12% 1천억 초과 14% 14% 16% 17% ": {},
            },
    },
}


#___________________________________________________
제목='중소기업'
_={
    #"지방소득세_법인세분 가산세": 지방소득세_법인세분,
    #"기업회계":기업회계,
    "법인세":법인세,
    #"조세특례제한법":조세특례제한법,
    #"증여세":증여세,
    #"상속세":상속세,
    #"양도소득세":양도소득세,
    #"농어촌특별세":{},
}
tax=_
import wx
class MyFrame(wx.Frame):
    def __init__(self):
        wx.Frame.__init__(self,parent=None,title=제목)
        self.SetSize(420,320*2)
        self.mainPanel=wx.Panel(self)
        self.expandButton=wx.Button(self.mainPanel,label='펼침')
        self.tree=wx.TreeCtrl(self.mainPanel)
        root=self.tree.AddRoot(제목)
        for i in tax:
            ii=self.tree.AppendItem(root,i)
            for j in tax[i]:
                jj=self.tree.AppendItem(ii,j)
                for k in tax[i][j]:
                    kk=self.tree.AppendItem(jj,k)
                    for m in tax[i][j][k]:
                        mm=self.tree.AppendItem(kk,m)
                        for n in tax[i][j][k][m]:
                            nn=self.tree.AppendItem(mm,n)
                            for p in tax[i][j][k][m][n]:
                                pp=self.tree.AppendItem(nn,p)
                                for q in tax[i][j][k][m][n][p]:
                                    qq=self.tree.AppendItem(pp,q)
                                    for r in tax[i][j][k][m][n][p][q]:
                                        rr=self.tree.AppendItem(qq,r)
        self.staticText =wx.TextCtrl(self.mainPanel,style=wx.TE_MULTILINE)

        self.vtBoxSizer=wx.BoxSizer(wx.VERTICAL)
        self.vtBoxSizer.Add(self.expandButton,0,wx.EXPAND|wx.ALL,5)
        self.vtBoxSizer.Add(self.tree        ,5,wx.EXPAND|wx.ALL,5)
        self.vtBoxSizer.Add(self.staticText  ,0,wx.EXPAND|wx.ALL,5)
        self.mainPanel.SetSizer(self.vtBoxSizer)
        self.Bind(wx.EVT_BUTTON          ,self.OnExpandButton,self.expandButton)
        self.Bind(wx.EVT_TREE_SEL_CHANGED,self.OnNodeSelected,self.tree)
    def OnExpandButton(self,e):
        self.tree.ExpandAll()
    def OnNodeSelected(self,e):
        selected=self.tree.GetSelection()
        self.staticText.SetLabel(self.tree.GetItemText(selected))
        #self.
        self.mainPanel.Layout()
if __name__=='__main__':
    app=wx.App()
    frame=MyFrame()
    frame.Show()
    app.MainLoop()
#___________________________________________________