# -*- coding: utf-8 -*-
#Created on 2019년 @author: 권달현
조={};서문={};조문={};부칙 = {};bubname='증권거래세법'
편=장=절=관=항=조={} 
서문['']={}
서문['증권거래세']={}
서문['[시행 2018. 12. 31] [법률 제16111호, 2018. 12. 31, 일부개정']={}
서문['기획재정부(금융세제과) 044-215-423']={}
제1조_=' 제1조 (목적) '
제1조={}
제1조['증권거래세법 제1조 (목적)']={}
조문['제1조 (목적)']=제1조
조['제1조 (목적)']=제1조
제1조1항_='이 법은 주권(株券) 또는 지분(持分)의 양도에 대하여 적정하게 과세함으로써 재정 수입의 원활한 조달에 이바지함을 목적으로 한다.'
제1조1항={}
제1조[제1조1항_]=제1조1항
제1조['[본조신설 2015. 12. 29.]']={}
제1조['[종전 제1조는 제2조로 이동 <2015. 12. 29.>]']={}
제1_02조_=' 제1조의2(정의) '
제1_02조={}
제1_02조['증권거래세법 제1조의2(정의)']={}
조문['제1조의2(정의)']=제1_02조
조['제1조의2(정의)']=제1_02조
제1_02조1항_='① 이 법에서 "주권"이란 다음 각 호의 어느 하나에 해당하는 것을 말한다.'
제1_02조1항={}
제1_02조[제1_02조1항_]=제1_02조1항
제1_02조1항1호_='1. 「상법」 또는 특별한 법률에 따라 설립된 법인의 주권'
제1_02조1항1호={}
제1_02조1항[제1_02조1항1호_]=제1_02조1항1호
제1_02조1항2호_='2. 외국법인이 발행한 주권으로서 「자본시장과 금융투자업에 관한 법률」 제8조의2제4항제1호에 따른 증권시장(이하 "증권시장"이라 한다)에 상장된 것'
제1_02조1항2호={}
제1_02조1항[제1_02조1항2호_]=제1_02조1항2호
제1_02조2항_='② 이 법에서 "지분"이란 「상법」에 따라 설립된 합명회사ㆍ합자회사ㆍ유한책임회사 및 유한회사의 사원 지분을 말한다.'
제1_02조2항={}
제1_02조[제1_02조2항_]=제1_02조2항
제1_02조3항_='③ 이 법에서 "양도"(讓渡)란 계약상 또는 법률상의 원인에 의하여 유상(有償)으로 소유권이 이전되는 것을 말한다.'
제1_02조3항={}
제1_02조[제1_02조3항_]=제1_02조3항
제1_02조4항_='④ 주권 발행 전의 주식, 주식 인수로 인한 권리, 신주인수권(新株引受權)과 특별한 법률에 따라 설립된 법인이 발행하는 출자증권 및 「자본시장과 금융투자업에 관한 법률」 제4조제8항에 따른 증권예탁증권(같은 법 제4조제2항제2호의 지분증권을 예탁받은 자가 발행한 것만 해당한다)은 이 법을 적용할 때 주권으로 본다.'
제1_02조4항={}
제1_02조[제1_02조4항_]=제1_02조4항
제1_02조5항_='⑤ 이 법을 적용할 때 거주자, 비거주자, 내국법인, 외국법인, 비거주자의 국내사업장 및 외국법인의 국내사업장은 「소득세법」과 「법인세법」에서 사용하는 용어의 예에 따른다.'
제1_02조5항={}
제1_02조[제1_02조5항_]=제1_02조5항
제1_02조['[전문개정 2015. 12. 29.]']={}
제1_02조['[제2조에서 이동 <2015. 12. 29.>]']={}
제1_02조_=' 제1조의2(정의) '
제1_02조={}
제1_02조['증권거래세법 제1조의2(정의)']={}
조문['제1조의2(정의)']=제1_02조
조['제1조의2(정의)']=제1_02조
제1_02조1항_='① 이 법에서 "주권"이란 다음 각 호의 어느 하나에 해당하는 것을 말한다.'
제1_02조1항={}
제1_02조[제1_02조1항_]=제1_02조1항
제1_02조1항1호_='1. 「상법」 또는 특별한 법률에 따라 설립된 법인의 주권'
제1_02조1항1호={}
제1_02조1항[제1_02조1항1호_]=제1_02조1항1호
제1_02조1항2호_='2. 외국법인이 발행한 주권으로서 「자본시장과 금융투자업에 관한 법률」 제8조의2제4항제1호에 따른 증권시장(이하 "증권시장"이라 한다)에 상장된 것'
제1_02조1항2호={}
제1_02조1항[제1_02조1항2호_]=제1_02조1항2호
제1_02조2항_='② 이 법에서 "지분"이란 「상법」에 따라 설립된 합명회사ㆍ합자회사ㆍ유한책임회사 및 유한회사의 사원 지분을 말한다.'
제1_02조2항={}
제1_02조[제1_02조2항_]=제1_02조2항
제1_02조3항_='③ 이 법에서 "양도"(讓渡)란 계약상 또는 법률상의 원인에 의하여 유상(有償)으로 소유권이 이전되는 것을 말한다.'
제1_02조3항={}
제1_02조[제1_02조3항_]=제1_02조3항
제1_02조4항_='④ 「주식ㆍ사채 등의 전자등록에 관한 법률」에 따라 전자등록된 주식, 주권 발행 전의 주식, 주식 인수로 인한 권리, 신주인수권(新株引受權)과 특별한 법률에 따라 설립된 법인이 발행하는 출자증권 및 「자본시장과 금융투자업에 관한 법률」 제4조제8항에 따른 증권예탁증권(같은 법 제4조제2항제2호의 지분증권을 예탁받은 자가 발행한 것만 해당한다)은 이 법을 적용할 때 주권으로 본다. <개정 2016. 3. 22.>'
제1_02조4항={}
제1_02조[제1_02조4항_]=제1_02조4항
제1_02조5항_='⑤ 이 법을 적용할 때 거주자, 비거주자, 내국법인, 외국법인, 비거주자의 국내사업장 및 외국법인의 국내사업장은 「소득세법」과 「법인세법」에서 사용하는 용어의 예에 따른다.'
제1_02조5항={}
제1_02조[제1_02조5항_]=제1_02조5항
제1_02조['[전문개정 2015. 12. 29.]']={}
제1_02조['[제2조에서 이동 <2015. 12. 29.>]']={}
제1_02조['[시행일 미지정] 제1조의2']={}
제2조_=' 제2조 (과세대상) '
제2조={}
제2조['증권거래세법 제2조 (과세대상)']={}
조문['제2조 (과세대상)']=제2조
조['제2조 (과세대상)']=제2조
제2조1항_='주권 또는 지분(이하 "주권등"이라 한다)의 양도에 대해서는 이 법에 따라 증권거래세를 부과한다. 다만, 다음 각 호의 어느 하나에 해당하는 양도에 대해서는 증권거래세를 부과하지 아니한다.'
제2조1항={}
제2조[제2조1항_]=제2조1항
제2조1항1호_='1. 증권시장과 비슷한 시장으로서 외국에 있는 시장(대통령령으로 정하는 시장만 해당하며, 이하 이 조에서 "외국증권시장"이라 한다)에 상장된 주권등을 양도하는 경우'
제2조1항1호={}
제2조1항[제2조1항1호_]=제2조1항1호
제2조1항2호_='2. 외국증권시장에 주권등을 상장하기 위하여 인수인(「자본시장과 금융투자업에 관한 법률」 제9조제12항에 따른 인수인을 말한다. 이하 같다)에게 주권등을 양도하는 경우'
제2조1항2호={}
제2조1항[제2조1항2호_]=제2조1항2호
제2조1항3호_='3. 「자본시장과 금융투자업에 관한 법률」에 따라 거래소허가를 받은 거래소로서 금융위원회가 지정하는 거래소(이하 "지정거래소"라 한다)가 같은 법 제377조제1항제3호에 따라 채무인수를 하면서 주권등을 양도하는 경우'
제2조1항3호={}
제2조1항[제2조1항3호_]=제2조1항3호
제2조['[전문개정 2015. 12. 29.]']={}
제2조['[제1조에서 이동, 종전 제2조는 제1조의2로 이동 <2015. 12. 29.>]']={}
제3조_=' 제3조 (납세의무자) '
제3조={}
제3조['증권거래세법 제3조 (납세의무자)']={}
조문['제3조 (납세의무자)']=제3조
조['제3조 (납세의무자)']=제3조
제3조1항_='증권거래세의 납세의무자는 다음 각 호의 어느 하나에 해당하는 자로 한다.'
제3조1항={}
제3조[제3조1항_]=제3조1항
제3조1항1호_='1. 다음 각 목의 어느 하나에 해당하는 주권을 계좌 간 대체(對替)로 매매결제하는 경우에는 「자본시장과 금융투자업에 관한 법률」 제294조에 따라 설립된 한국예탁결제원(이하 "예탁결제원"이라 한다)'
제3조1항1호={}
제3조1항[제3조1항1호_]=제3조1항1호
제3조1항1호가목_='가. 증권시장에서 양도되는 주권'
제3조1항1호가목={}
제3조1항1호[제3조1항1호가목_]=제3조1항1호가목
제3조1항1호나목_='나. 증권시장 밖에서 대통령령으로 정하는 방법에 따라 양도되는 주권'
제3조1항1호나목={}
제3조1항1호[제3조1항1호나목_]=제3조1항1호나목
제3조1항2호_='2. 제1호 외에 「자본시장과 금융투자업에 관한 법률」 제8조제1항에 따른 금융투자업자(이하 "금융투자업자"라 한다)를 통하여 주권등을 양도하는 경우에는 해당 금융투자업자'
제3조1항2호={}
제3조1항[제3조1항2호_]=제3조1항2호
제3조1항3호_='3. 제1호 및 제2호 외의 방법으로 주권등을 양도하는 경우에는 그 주권등의 양도자. 다만, 국내사업장을 가지고 있지 아니한 비거주자 또는 국내사업장을 가지고 있지 아니한 외국법인이 주권등을 금융투자업자를 통하지 아니하고 양도하는 경우에는 그 주권등의 양수인을 증권거래세 납세의무자로 한다.'
제3조1항3호={}
제3조1항[제3조1항3호_]=제3조1항3호
제3조['[전문개정 2015. 12. 29.]']={}
제3조_=' 제3조 (납세의무자) '
제3조={}
제3조['증권거래세법 제3조 (납세의무자)']={}
조문['제3조 (납세의무자)']=제3조
조['제3조 (납세의무자)']=제3조
제3조1항_='증권거래세의 납세의무자는 다음 각 호의 어느 하나에 해당하는 자로 한다. <개정 2016. 3. 22.>'
제3조1항={}
제3조[제3조1항_]=제3조1항
제3조1항1호_='1. 다음 각 목의 어느 하나에 해당하는 주권을 계좌 간 대체(對替)로 매매결제하는 경우에는 「주식ㆍ사채 등의 전자등록에 관한 법률」 제2조제6호에 따른 전자등록기관(이하 "전자등록기관"이라 한다) 또는 「자본시장과 금융투자업에 관한 법률」 제294조에 따라 설립된 한국예탁결제원'
제3조1항1호={}
제3조1항[제3조1항1호_]=제3조1항1호
제3조1항1호가목_='가. 증권시장에서 양도되는 주권'
제3조1항1호가목={}
제3조1항1호[제3조1항1호가목_]=제3조1항1호가목
제3조1항1호나목_='나. 증권시장 밖에서 대통령령으로 정하는 방법에 따라 양도되는 주권'
제3조1항1호나목={}
제3조1항1호[제3조1항1호나목_]=제3조1항1호나목
제3조1항2호_='2. 제1호 외에 「자본시장과 금융투자업에 관한 법률」 제8조제1항에 따른 금융투자업자(이하 "금융투자업자"라 한다)를 통하여 주권등을 양도하는 경우에는 해당 금융투자업자'
제3조1항2호={}
제3조1항[제3조1항2호_]=제3조1항2호
제3조1항3호_='3. 제1호 및 제2호 외의 방법으로 주권등을 양도하는 경우에는 그 주권등의 양도자. 다만, 국내사업장을 가지고 있지 아니한 비거주자 또는 국내사업장을 가지고 있지 아니한 외국법인이 주권등을 금융투자업자를 통하지 아니하고 양도하는 경우에는 그 주권등의 양수인을 증권거래세 납세의무자로 한다.'
제3조1항3호={}
제3조1항[제3조1항3호_]=제3조1항3호
제3조['[전문개정 2015. 12. 29.]']={}
제3조['[시행일 미지정] 제3조']={}
제4조_=' 제4조 (납세지) '
제4조={}
제4조['증권거래세법 제4조 (납세지)']={}
조문['제4조 (납세지)']=제4조
조['제4조 (납세지)']=제4조
제4조1항_='① 증권거래세의 납세지는 다음 각 호의 구분에 따른다.'
제4조1항={}
제4조[제4조1항_]=제4조1항
제4조1항1호_='1. 제3조제1호 및 제2호의 경우에는 해당 납세의무자의 각 사업장소재지. 다만, 대통령령으로 정하는 경우에는 본점 또는 주사무소의 소재지를 증권거래세의 납세지로 할 수 있다.'
제4조1항1호={}
제4조1항[제4조1항1호_]=제4조1항1호
제4조1항2호_='2. 제3조제3호의 경우에는 다음 각 목의 구분에 따른 것'
제4조1항2호={}
제4조1항[제4조1항2호_]=제4조1항2호
제4조1항2호가목_='가. 납세의무자가 거주자인 경우에는 그 주소지. 다만, 주소지가 없는 경우에는 그 거소지로 한다.'
제4조1항2호가목={}
제4조1항2호[제4조1항2호가목_]=제4조1항2호가목
제4조1항2호나목_='나. 납세의무자가 내국법인인 경우에는 등기부에 적힌 본점 또는 주사무소의 소재지'
제4조1항2호나목={}
제4조1항2호[제4조1항2호나목_]=제4조1항2호나목
제4조1항2호다목_='다. 납세의무자가 비거주자 또는 외국법인으로서 국내사업장을 가지고 있는 경우에는 그 국내사업장(국내사업장이 둘 이상인 경우에는 주된 국내사업장)의 소재지'
제4조1항2호다목={}
제4조1항2호[제4조1항2호다목_]=제4조1항2호다목
제4조1항2호라목_='라. 납세의무자가 비거주자 또는 외국법인으로서 국내사업장을 가지고 있지 아니한 경우에는 증권거래세의 과세대상이 되는 주권등을 발행한 법인의 본점 또는 주사무소의 소재지'
제4조1항2호라목={}
제4조1항2호[제4조1항2호라목_]=제4조1항2호라목
제4조2항_='② 납세지가 불분명한 경우에는 대통령령으로 정하는 바에 따라 결정한다.'
제4조2항={}
제4조[제4조2항_]=제4조2항
제4조['[전문개정 2015. 12. 29.]']={}
제5조_=' 제5조 (양도의 시기) '
제5조={}
제5조['증권거래세법 제5조 (양도의 시기)']={}
조문['제5조 (양도의 시기)']=제5조
조['제5조 (양도의 시기)']=제5조
제5조1항_='① 이 법을 적용할 때 주권등의 양도 시기는 해당 매매거래가 확정되는 때로 한다.'
제5조1항={}
제5조[제5조1항_]=제5조1항
제5조2항_='② 제1항의 매매거래 확정에 필요한 사항은 대통령령으로 정한다.'
제5조2항={}
제5조[제5조2항_]=제5조2항
제5조['[전문개정 2015. 12. 29.]']={}
제6조_=' 제6조 (비과세양도) '
제6조={}
제6조['증권거래세법 제6조 (비과세양도)']={}
조문['제6조 (비과세양도)']=제6조
조['제6조 (비과세양도)']=제6조
제6조1항_='다음 각 호의 어느 하나에 해당하는 경우에는 증권거래세를 부과하지 아니한다.'
제6조1항={}
제6조[제6조1항_]=제6조1항
제6조1항1호_='1. 국가나 지방자치단체가 주권등을 양도하는 경우. 다만, 「국가재정법」 별표 2에서 규정하는 법률에 따라 설치된 기금으로서 기금관리주체가 중앙행정기관의 장인 기금에서 취득한 주권등을 양도하는 경우 및 「우정사업 운영에 관한 특례법」 제2조제2호에 따른 우정사업총괄기관이 주권등을 양도하는 경우는 제외한다.'
제6조1항1호={}
제6조1항[제6조1항1호_]=제6조1항1호
제6조1항2호_='2. 「자본시장과 금융투자업에 관한 법률」 제119조에 따라 주권을 매출하는 경우[청약된 주권의 총수(總數)가 매출하려는 주권 총수에 미달된 경우, 그 청약되지 아니한 주권을 인수인이 인수하는 경우를 포함한다]'
제6조1항2호={}
제6조1항[제6조1항2호_]=제6조1항2호
제6조1항3호_='3. 제1호 및 제2호 외에 대통령령으로 정하는 주권등을 양도하는 경우'
제6조1항3호={}
제6조1항[제6조1항3호_]=제6조1항3호
제6조['[전문개정 2015. 12. 29.]']={}
제7조_=' 제7조 (과세표준) '
제7조={}
제7조['증권거래세법 제7조 (과세표준)']={}
조문['제7조 (과세표준)']=제7조
조['제7조 (과세표준)']=제7조
제7조1항_='① 증권거래세의 과세표준은 다음 각 호의 구분에 따른다.'
제7조1항={}
제7조[제7조1항_]=제7조1항
제7조1항1호_='1. 제3조제1호 각 목에 따른 주권을 양도하는 경우에는 그 주권의 양도가액'
제7조1항1호={}
제7조1항[제7조1항1호_]=제7조1항1호
제7조1항2호_='2. 제1호 외의 주권등을 양도하는 경우에는 다음 각 목의 구분에 따른 가액'
제7조1항2호={}
제7조1항[제7조1항2호_]=제7조1항2호
제7조1항2호가목_='가. 주권등의 양도가액을 알 수 있는 경우: 해당 주권등의 양도가액. 다만, 다음의 어느 하나에 해당하는 경우에는 다음에 규정하는 가액으로 한다.'
제7조1항2호가목={}
제7조1항2호[제7조1항2호가목_]=제7조1항2호가목
제7조1항2호가목1반_='1) 「소득세법」 제101조, 「법인세법」 제52조 또는 「상속세 및 증여세법」 제35조에 따라 주권등이 시가(時價)보다 낮은 가액으로 양도된 것으로 인정되는 경우(「국제조세조정에 관한 법률」 제4조가 적용되는 경우는 제외한다)에는 그 시가액'
제7조1항2호가목1반={}
제7조1항2호가목[제7조1항2호가목1반_]=제7조1항2호가목1반
제7조1항2호가목2반_='2) 「소득세법」 제126조, 「법인세법」 제92조 또는 「국제조세조정에 관한 법률」 제4조에 따라 주권등이 정상가격보다 낮은 가액으로 양도된 것으로 인정되는 경우에는 그 정상가격'
제7조1항2호가목2반={}
제7조1항2호가목[제7조1항2호가목2반_]=제7조1항2호가목2반
제7조1항2호나목_='나. 주권등의 양도가액을 알 수 없는 경우: 대통령령으로 정하는 양도가액 평가방법에 따라 평가한 가액'
제7조1항2호나목={}
제7조1항2호[제7조1항2호나목_]=제7조1항2호나목
제7조2항_='② 제1항을 적용할 때 시가 및 정상가격의 산정 등에 필요한 사항은 대통령령으로 정한다.'
제7조2항={}
제7조[제7조2항_]=제7조2항
제7조['[전문개정 2015. 12. 29.]']={}
제8조_=' 제8조 (세율) '
제8조={}
제8조['증권거래세법 제8조 (세율)']={}
조문['제8조 (세율)']=제8조
조['제8조 (세율)']=제8조
제8조1항_='① 증권거래세의 세율은 1천분의 5로 한다.'
제8조1항={}
제8조[제8조1항_]=제8조1항
제8조2항_='② 제1항의 세율은 자본시장 육성을 위하여 긴급히 필요하다고 인정될 때에는 증권시장에서 거래되는 주권에 한정하여 종목별로 대통령령으로 정하는 바에 따라 낮추거나 영(零)으로 할 수 있다.'
제8조2항={}
제8조[제8조2항_]=제8조2항
제8조['[전문개정 2015. 12. 29.]']={}
제9조_=' 제9조 (거래징수) '
제9조={}
제9조['증권거래세법 제9조 (거래징수)']={}
조문['제9조 (거래징수)']=제9조
조['제9조 (거래징수)']=제9조
제9조1항_='① 제3조제1호ㆍ제2호 및 같은 조 제3호 단서에 따른 납세의무자는 주권등을 양도하는 자로부터 제7조에 따른 과세표준에 제8조에 따른 세율을 적용하여 계산한 증권거래세를 주권등의 매매결제 또는 양도를 할 때에 징수하여야 한다.'
제9조1항={}
제9조[제9조1항_]=제9조1항
제9조2항_='② 지정거래소는 증권시장에서 주권등의 매매거래가 체결되었을 때에는 예탁결제원이 제1항에 따른 과세표준을 확정할 수 있도록 주권의 종목ㆍ수량 등 대통령령으로 정하는 사항을 매매일 다음 날까지 예탁결제원에 알려야 한다.'
제9조2항={}
제9조[제9조2항_]=제9조2항
제9조['[전문개정 2015. 12. 29.]']={}
제9조_=' 제9조 (거래징수) '
제9조={}
제9조['증권거래세법 제9조 (거래징수)']={}
조문['제9조 (거래징수)']=제9조
조['제9조 (거래징수)']=제9조
제9조1항_='① 제3조제1호ㆍ제2호 및 같은 조 제3호 단서에 따른 납세의무자는 주권등을 양도하는 자로부터 제7조에 따른 과세표준에 제8조에 따른 세율을 적용하여 계산한 증권거래세를 주권등의 매매결제 또는 양도를 할 때에 징수하여야 한다.'
제9조1항={}
제9조[제9조1항_]=제9조1항
제9조2항_='② 지정거래소는 증권시장에서 주권등의 매매거래가 체결되었을 때에는 전자등록기관이 제1항에 따른 과세표준을 확정할 수 있도록 주권의 종목ㆍ수량 등 대통령령으로 정하는 사항을 매매일 다음 날까지 전자등록기관에 알려야 한다. <개정 2016. 3. 22.>'
제9조2항={}
제9조[제9조2항_]=제9조2항
제9조['[전문개정 2015. 12. 29.]']={}
제9조['[시행일 미지정] 제9조']={}
제9_02조_=' 제9조의2(증권계좌 간 이체내용 등 제출) '
제9_02조={}
제9_02조['증권거래세법 제9조의2(증권계좌 간 이체내용 등 제출)']={}
조문['제9조의2(증권계좌 간 이체내용 등 제출)']=제9_02조
조['제9조의2(증권계좌 간 이체내용 등 제출)']=제9_02조
제9_02조1항_='금융투자업자는 그가 관리하는 증권계좌를 통하여 제3조제3호에 해당하는 납세의무자가 주권등을 양도한 경우에 해당 거래의 증권계좌 간 이체내용 등을 이체한 날이 속하는 분기의 말일부터 2개월 이내에 관할 세무서장에게 제출하여야 한다. 이 경우 이체내용 등 필요한 사항은 대통령령으로 정한다.'
제9_02조1항={}
제9_02조[제9_02조1항_]=제9_02조1항
제9_02조['[전문개정 2015. 12. 29.]']={}
제10조_=' 제10조 (신고ㆍ납부 및 환급) '
제10조={}
제10조['증권거래세법 제10조 (신고ㆍ납부 및 환급)']={}
조문['제10조 (신고ㆍ납부 및 환급)']=제10조
조['제10조 (신고ㆍ납부 및 환급)']=제10조
제10조1항_='① 증권거래세의 납세의무자는 다음 각 호의 구분에 따라 과세표준과 세액을 대통령령으로 정하는 바에 따라 관할 세무서장에게 신고하여야 한다. <개정 2017. 12. 19.>'
제10조1항={}
제10조[제10조1항_]=제10조1항
제10조1항1호_='1. 제3조제1호 및 제2호의 경우에는 매월분의 과세표준과 세액을 다음 달 10일까지 신고할 것'
제10조1항1호={}
제10조1항[제10조1항1호_]=제10조1항1호
제10조1항2호_='2. 제3조제3호의 경우에는 매 반기(半期)분의 과세표준과 세액을 양도일이 속하는 반기의 말일부터 2개월 이내에 신고할 것'
제10조1항2호={}
제10조1항[제10조1항2호_]=제10조1항2호
제10조2항_='② 납세의무자는 제1항 각 호에 따른 신고와 동시에 해당 월분 또는 반기분의 증권거래세를 대통령령으로 정하는 바에 따라 납세지 관할 세무서, 한국은행(그 대리점을 포함한다) 또는 체신관서에 내야 한다. <개정 2017. 12. 19.>'
제10조2항={}
제10조[제10조2항_]=제10조2항
제10조3항_='③ 제3조제1호에 따른 납세의무자가 제2항에 따라 낸 증권거래세액 중 잘못 내거나 초과하여 낸 금액이 있어 주권등을 양도한 자에게 환급할 때에는 그 납세의무자가 거래징수하여 낼 증권거래세액에서 조정하여 환급할 수 있다.'
제10조3항={}
제10조[제10조3항_]=제10조3항
제10조4항_='④ 제3항에 따른 환급의 요건 등에 관하여 필요한 사항은 대통령령으로 정한다.'
제10조4항={}
제10조[제10조4항_]=제10조4항
제10조['[전문개정 2015. 12. 29.]']={}
제10_02조_=' 제10조의2(본점 등의 총괄신고ㆍ납부) '
제10_02조={}
제10_02조['증권거래세법 제10조의2(본점 등의 총괄신고ㆍ납부)']={}
조문['제10조의2(본점 등의 총괄신고ㆍ납부)']=제10_02조
조['제10조의2(본점 등의 총괄신고ㆍ납부)']=제10_02조
제10_02조1항_='증권거래세의 납세의무자가 「부가가치세법」 제8조제3항 후단에 따른 사업자 단위 과세 사업자인 경우에는 제4조제1항제1호, 제10조제1항 및 제2항에도 불구하고 그 사업자의 본점 또는 주사무소에서 총괄하여 신고ㆍ납부할 수 있다.'
제10_02조1항={}
제10_02조[제10_02조1항_]=제10_02조1항
제10_02조['[전문개정 2015. 12. 29.]']={}
제11조_=' 제11조 (경정) '
제11조={}
제11조['증권거래세법 제11조 (경정)']={}
조문['제11조 (경정)']=제11조
조['제11조 (경정)']=제11조
제11조1항_='① 관할 세무서장은 제10조에 따른 과세표준과 세액의 신고가 없거나 그 신고내용에 잘못되었거나 빠진 부분이 있으면 그 과세표준과 세액을 조사하여 결정하거나 경정(更正)할 수 있다.'
제11조1항={}
제11조[제11조1항_]=제11조1항
제11조2항_='② 제1항에 따라 결정하거나 경정할 때에는 장부나 그 밖의 증명자료를 근거로 하여야 한다. 다만, 장부나 그 밖의 증명자료를 근거로 할 수 없는 경우로서 대통령령으로 정하는 경우에는 추계(推計)하여 결정하거나 경정할 수 있다.'
제11조2항={}
제11조[제11조2항_]=제11조2항
제11조3항_='③ 관할 세무서장은 제1항과 제2항에 따라 결정하거나 경정한 과세표준과 세액에 잘못되었거나 빠진 것이 발견되었을 때에는 즉시 재경정한다.'
제11조3항={}
제11조[제11조3항_]=제11조3항
제11조['[전문개정 2015. 12. 29.]']={}
제12조_=' 제12조 (수시부과) '
제12조={}
제12조['증권거래세법 제12조 (수시부과)']={}
조문['제12조 (수시부과)']=제12조
조['제12조 (수시부과)']=제12조
제12조1항_='관할 세무서장은 납세의무자가 휴업 또는 폐업하거나 그 밖에 증권거래세를 포탈할 우려가 있다고 인정될 때에는 제10조에도 불구하고 수시로 그 과세표준과 세액을 조사ㆍ결정할 수 있다. 이 경우에는 제11조제2항을 준용한다.'
제12조1항={}
제12조[제12조1항_]=제12조1항
제12조['[전문개정 2015. 12. 29.]']={}
제13조_=' 제13조 (징수) '
제13조={}
제13조['증권거래세법 제13조 (징수)']={}
조문['제13조 (징수)']=제13조
조['제13조 (징수)']=제13조
제13조1항_='관할 세무서장은 증권거래세의 납세의무자가 신고한 세액을 내지 아니하거나 덜 낸 경우에는 그 내지 아니한 세액 또는 덜 낸 세액을 징수하고, 제11조 또는 제12조에 따라 결정ㆍ경정 또는 수시부과를 한 경우에는 그 내야 할 세액을 징수한다.'
제13조1항={}
제13조[제13조1항_]=제13조1항
제13조['[전문개정 2015. 12. 29.]']={}
제14조_=' 제14조 삭제  '
제14조={}
제14조['증권거래세법 제14조 삭제 ']={}
조문['제14조 삭제 ']=제14조
조['제14조 삭제 ']=제14조
제15조_=' 제15조 (장부의 비치ㆍ기록) '
제15조={}
제15조['증권거래세법 제15조 (장부의 비치ㆍ기록)']={}
조문['제15조 (장부의 비치ㆍ기록)']=제15조
조['제15조 (장부의 비치ㆍ기록)']=제15조
제15조1항_='① 증권거래세의 납세의무자인 법인은 관계 장부를 갖추어 두고 주권등의 종류ㆍ수량ㆍ거래금액과 그 밖에 대통령령으로 정하는 사항을 적어야 한다.'
제15조1항={}
제15조[제15조1항_]=제15조1항
제15조2항_='② 제1항의 장부는 해당 신고일부터 5년간 보존하여야 한다.'
제15조2항={}
제15조[제15조2항_]=제15조2항
제15조['[전문개정 2015. 12. 29.]']={}
제16조_=' 제16조 (명령사항) '
제16조={}
제16조['증권거래세법 제16조 (명령사항)']={}
조문['제16조 (명령사항)']=제16조
조['제16조 (명령사항)']=제16조
제16조1항_='정부는 증권거래세의 납세 보전(保全)을 위하여 필요하다고 인정될 때에는 대통령령으로 정하는 바에 따라 그 납세의무자 및 금융투자업자에게 주권등의 매매거래(제9조의2에 해당하는 양도를 포함한다), 비과세양도 등에 관하여 단속에 필요한 사항을 명할 수 있다.'
제16조1항={}
제16조[제16조1항_]=제16조1항
제16조['[전문개정 2015. 12. 29.]']={}
제17조_=' 제17조 (질문ㆍ검사) '
제17조={}
제17조['증권거래세법 제17조 (질문ㆍ검사)']={}
조문['제17조 (질문ㆍ검사)']=제17조
조['제17조 (질문ㆍ검사)']=제17조
제17조1항_='증권거래세에 관한 사무에 종사하는 세무공무원은 증권거래세의 납세의무자와 그 거래상대방에 대하여 증권거래세와 관련되는 사항을 질문하거나 그 업무에 관한 장부ㆍ서류나 그 밖의 물건을 검사할 수 있다. 이 경우 직무상 필요한 범위 외에 다른 목적 등을 위하여 그 권한을 남용해서는 아니 된다. <개정 2018. 12. 31.>'
제17조1항={}
제17조[제17조1항_]=제17조1항
제17조['[전문개정 2015. 12. 29.]']={}
제18조_=' 제18조 삭제  '
제18조={}
제18조['증권거래세법 제18조 삭제 ']={}
조문['제18조 삭제 ']=제18조
조['제18조 삭제 ']=제18조
부칙['부칙  <제16111호, 2018. 12. 31.']={}
부칙['이 법은 공포한 날부터 시행한다']={}
bub={'서문':서문,'조문':조문,'조별':조,'부칙':부칙}
    
import wx
class MyFrame(wx.Frame):
    def __init__(self):
        wx.Frame.__init__(self, parent=None, title=bubname)
        self.SetSize(620, 520)
        self.mainPanel = wx.Panel(self)
        self.expandButton = wx.Button(self.mainPanel, label=bubname)
        self.tree = wx.TreeCtrl(self.mainPanel)
        root = self.tree.AddRoot(bubname)
        for i in bub:
            ii = self.tree.AppendItem(root, i)
            for j in bub[i]:
                jj = self.tree.AppendItem(ii, j)
                for k in bub[i][j]:
                    kk = self.tree.AppendItem(jj, k)
                    for m in bub[i][j][k]:
                        mm = self.tree.AppendItem(kk, m)
                        for n in bub[i][j][k][m]:
                            nn = self.tree.AppendItem(mm, n)
                            for p in bub[i][j][k][m][n]:
                                pp = self.tree.AppendItem(nn, p)
                                for q in bub[i][j][k][m][n][p]:
                                    qq=self.tree.AppendItem(pp,q)
                                    for r in bub[i][j][k][m][n][p][q]:
                                        rr=self.tree.AppendItem(qq,r)
                                        for s in bub[i][j][k][m][n][p][q][r]:
                                            ss = self.tree.AppendItem(rr, s)
                                            for t in bub[i][j][k][m][n][p][q][r][s]:
                                                tt = self.tree.AppendItem(ss, t)
                                                for u in bub[i][j][k][m][n][p][q][r][s][t]:
                                                    uu = self.tree.AppendItem(tt, u)
                                                    for v in bub[i][j][k][m][n][p][q][r][s][t][u]:
                                                        vv = self.tree.AppendItem(uu, v)
        self.staticText = wx.TextCtrl(self.mainPanel, style=wx.TE_MULTILINE)
        self.vtBoxSizer = wx.BoxSizer(wx.VERTICAL)
        self.vtBoxSizer.Add(self.expandButton, 0, wx.EXPAND | wx.ALL, 5)
        self.vtBoxSizer.Add(self.tree, 5, wx.EXPAND | wx.ALL, 5)
        self.vtBoxSizer.Add(self.staticText, 0, wx.EXPAND | wx.ALL, 5)
        self.mainPanel.SetSizer(self.vtBoxSizer)
        self.Bind(wx.EVT_BUTTON, self.OnExpandButton, self.expandButton)
        self.Bind(wx.EVT_TREE_SEL_CHANGED, self.OnNodeSelected, self.tree)
        self.Bind(wx.EVT_CLOSE, self.OnClose)

    def OnExpandButton(self, e):
        self.tree.ExpandAll()

    def __del__(self):
        print('소멸합니다.')

    def OnClose(self, event):
        frame.Destroy()

    def OnNodeSelected(self, e):
        selected = self.tree.GetSelection()
        self.staticText.SetLabel(self.tree.GetItemText(selected))
        self.mainPanel.Layout()
if __name__ == '__main__':
    app = wx.App(redirect=True)
    frame = MyFrame()
    wnd = wx.Frame(None, wx.ID_ANY, "")
    wnd.CenterOnScreen()
    app.SetTopWindow(wnd)
    frame.Show()
    app.MainLoop()
    