# -*- coding: utf-8 -*-
#Created on 2019년 @author: 권달현
조={};서문={};조문={};부칙 = {};bubname='증권거래세법시행령'
편=장=절=관=항=조={} 
서문['']={}
서문['증권거래세법 시행']={}
서문['[시행 2017. 4. 1] [대통령령 제27843호, 2017. 2. 7, 일부개정']={}
서문['기획재정부(금융세제과) 044-215-423']={}
제1조_=' 제1조 (외국의 유가증권시장) '
제1조={}
제1조['증권거래세법시행령 제1조 (외국의 유가증권시장)']={}
조문['제1조 (외국의 유가증권시장)']=제1조
조['제1조 (외국의 유가증권시장)']=제1조
제1조1항_='「증권거래세법」(이하 "법"이라 한다) 제1조제1호에서 "대통령령으로 정하는 시장"이란 다음 각 호의 어느 하나에 해당하는 시장을 말한다. <개정 2005. 2. 19., 2008. 2. 29., 2009. 2. 3.>'
제1조1항={}
제1조[제1조1항_]=제1조1항
제1조1항1호_='1. 뉴욕증권거래소'
제1조1항1호={}
제1조1항[제1조1항1호_]=제1조1항1호
제1조1항2호_='2. 전미증권업협회중개시장'
제1조1항2호={}
제1조1항[제1조1항2호_]=제1조1항2호
제1조1항3호_='3. 기타 제1호 또는 제2호의 시장과 유사한 시장으로서 기획재정부령이 정하는 시장'
제1조1항3호={}
제1조1항[제1조1항3호_]=제1조1항3호
제1조['[전문개정 2000. 12. 29.]']={}
제1_02조_=' 제1조의2(납세의무자) '
제1_02조={}
제1_02조['증권거래세법시행령 제1조의2(납세의무자)']={}
조문['제1조의2(납세의무자)']=제1_02조
조['제1조의2(납세의무자)']=제1_02조
제1_02조1항_='①법 제3조제1호 나목에서 "대통령령으로 정하는 방법"이란 「자본시장과 금융투자업에 관한 법률 시행령」 제78조 또는 제178조제1항에 따른 기준에 따라 주권을 매매하는 것을 말한다. <개정 2000. 12. 29., 2005. 2. 19., 2008. 2. 22., 2009. 2. 3., 2013. 8. 27.>'
제1_02조1항={}
제1_02조[제1_02조1항_]=제1_02조1항
제1_02조2항_='② 법 제3조제2호에서 "금융투자업자"란 「자본시장과 금융투자업에 관한 법률」에 따른 투자매매업자 또는 투자중개업자를 말한다. <개정 2009. 2. 3.>'
제1_02조2항={}
제1_02조[제1_02조2항_]=제1_02조2항
제1_02조3항_='③법 제3조제2호에서 "금융투자업자를 통하여 주권등을 양도하는 경우"란 금융투자업자가 주권 또는 지분(이하 "주권등"이라 한다)의 매매ㆍ위탁매매 또는 매매의 중개나 대리를 하는 경우를 말한다. <개정 2009. 2. 3.>'
제1_02조3항={}
제1_02조[제1_02조3항_]=제1_02조3항
제1_03조_=' 제1조의3(본점일괄납부) '
제1_03조={}
제1_03조['증권거래세법시행령 제1조의3(본점일괄납부)']={}
조문['제1조의3(본점일괄납부)']=제1_03조
조['제1조의3(본점일괄납부)']=제1_03조
제1_03조1항_='① 법 제4조제1항제1호 단서에서 "대통령령이 정하는 경우"란 법 제3조제2호에 따른 납세의무자가 본점 또는 주사무소 관할 세무서장에게 본점 또는 주사무소의 소재지를 그 납세의무자의 지점ㆍ영업소 또는 그 밖의 사업장(이하 "지점등"이라 한다)의 증권거래세액의 납세지로 제2항에 따라 신고하여 수리된 경우를 말한다.'
제1_03조1항={}
제1_03조[제1_03조1항_]=제1_03조1항
제1_03조2항_='② 법 제4조제1항제1호 단서에 따라 본점 또는 주사무소 소재지에서 해당 납세의무자의 지점등의 증권거래세액을 납부(이하 "본점일괄납부"라 한다)하려는 자는 본점일괄납부하려는 달의 전달 20일까지 다음 각 호의 사항을 적은 본점일괄납부 신고서를 본점 또는 주사무소 관할 세무서장에게 제출(국세정보통신망을 통한 제출을 포함한다)하여야 한다.'
제1_03조2항={}
제1_03조[제1_03조2항_]=제1_03조2항
제1_03조2항1호_='1. 납세의무자의 인적사항'
제1_03조2항1호={}
제1_03조2항[제1_03조2항1호_]=제1_03조2항1호
제1_03조2항2호_='2. 지점등의 현황'
제1_03조2항2호={}
제1_03조2항[제1_03조2항2호_]=제1_03조2항2호
제1_03조2항3호_='3. 본점 또는 주사무소 소재지'
제1_03조2항3호={}
제1_03조2항[제1_03조2항3호_]=제1_03조2항3호
제1_03조2항4호_='4. 「자본시장과 금융투자업에 관한 법률」 제13조에 따른 금융투자업 인가서'
제1_03조2항4호={}
제1_03조2항[제1_03조2항4호_]=제1_03조2항4호
제1_03조2항5호_='5. 지방세 완납증명서'
제1_03조2항5호={}
제1_03조2항[제1_03조2항5호_]=제1_03조2항5호
제1_03조3항_='③ 본점일괄납부하는 납세의무자는 다음 각 호의 사유가 발생한 경우에는 본점 또는 주사무소 관할 세무서장에게 납세의무자의 인적사항, 변경 사유 등을 적은 본점일괄납부 변경신고서를 제출(국세정보통신망을 통한 제출을 포함한다)하여야 한다.'
제1_03조3항={}
제1_03조[제1_03조3항_]=제1_03조3항
제1_03조3항1호_='1. 본점 또는 주사무소의 변경'
제1_03조3항1호={}
제1_03조3항[제1_03조3항1호_]=제1_03조3항1호
제1_03조3항2호_='2. 지점등의 신설ㆍ폐지'
제1_03조3항2호={}
제1_03조3항[제1_03조3항2호_]=제1_03조3항2호
제1_03조4항_='④ 본점 또는 주사무소 관할 세무서장은 제2항에 따라 본점일괄납부를 신고한 자가 다음 각 호의 어느 하나에 해당하는 경우를 제외하고는 본점일괄납부 신고를 수리하여야 한다.'
제1_03조4항={}
제1_03조[제1_03조4항_]=제1_03조4항
제1_03조4항1호_='1. 본점일괄납부를 신고한 자가 신고일부터 과거 2년 이내에 「조세범처벌법」에 따라 처벌받은 경우'
제1_03조4항1호={}
제1_03조4항[제1_03조4항1호_]=제1_03조4항1호
제1_03조4항2호_='2. 본점일괄납부를 신고한 자가 신고일 현재 국세 또는 지방세를 체납하고 있는 경우'
제1_03조4항2호={}
제1_03조4항[제1_03조4항2호_]=제1_03조4항2호
제1_03조4항3호_='3. 그 밖에 사정의 변경으로 인하여 본점일괄납부가 적당하지 아니한 경우'
제1_03조4항3호={}
제1_03조4항[제1_03조4항3호_]=제1_03조4항3호
제1_03조5항_='⑤ 본점 또는 주사무소 관할 세무서장은 제4항에 따라 본점일괄납부 신고를 수리하거나 거부하는 경우에는 본점일괄납부를 신고한 달의 말일까지 신고인에게 그 사실을 알려야 한다.'
제1_03조5항={}
제1_03조[제1_03조5항_]=제1_03조5항
제1_03조6항_='⑥ 본점일괄납부를 하는 납세의무자가 본점일괄납부를 포기하고 각 지점등에서 납부하려는 경우에는 그 납부하려는 달의 전달 20일까지 다음 각 호의 사항을 적은 본점일괄납부 포기신고서를 본점 또는 주사무소 관할 세무서장에게 제출(국세정보통신망을 통한 제출을 포함한다)하여야 한다.'
제1_03조6항={}
제1_03조[제1_03조6항_]=제1_03조6항
제1_03조6항1호_='1. 납세의무자의 인적사항'
제1_03조6항1호={}
제1_03조6항[제1_03조6항1호_]=제1_03조6항1호
제1_03조6항2호_='2. 본점일괄납부 포기 사유'
제1_03조6항2호={}
제1_03조6항[제1_03조6항2호_]=제1_03조6항2호
제1_03조['[전문개정 2013. 2. 15.]']={}
제1_04조_=' 제1조의4(납세지의 판정기준) '
제1_04조={}
제1_04조['증권거래세법시행령 제1조의4(납세지의 판정기준)']={}
조문['제1조의4(납세지의 판정기준)']=제1_04조
조['제1조의4(납세지의 판정기준)']=제1_04조
제1_04조1항_='①법 제4조제1항제2호 가목의 규정에 의한 주소 또는 거소는 「소득세법 시행령」 제2조에 규정된 바에 따른다. <개정 2005. 2. 19.>'
제1_04조1항={}
제1_04조[제1_04조1항_]=제1_04조1항
제1_04조2항_='②법 제4조제2항의 규정에 의한 납세지의 결정은 「소득세법 시행령」 제5조 또는 「법인세법 시행령」 제8조의 규정에 의한다. <개정 1995. 12. 30., 1998. 12. 31., 2005. 2. 19.>'
제1_04조2항={}
제1_04조[제1_04조2항_]=제1_04조2항
제1_04조['[본조신설 1993. 12. 31.]']={}
제1_04조['[제1조의3에서 이동<2000. 12. 29.>]']={}
제2조_=' 제2조 (양도의 시기) '
제2조={}
제2조['증권거래세법시행령 제2조 (양도의 시기)']={}
조문['제2조 (양도의 시기)']=제2조
조['제2조 (양도의 시기)']=제2조
제2조1항_='주권등의 법 제5조제2항에 따른 매매거래의 확정시기는 다음 각 호에 따른다. <개정 2000. 12. 29., 2005. 2. 19., 2008. 2. 22., 2009. 2. 3., 2013. 8. 27.>'
제2조1항={}
제2조[제2조1항_]=제2조1항
제2조1항1호_='1. 「자본시장과 금융투자업에 관한 법률」에 따른 증권시장에서 거래(다자간매매체결회사에서의 거래를 포함한다)된 주권에 대하여는 그 양도가액이 결제되는 때'
제2조1항1호={}
제2조1항[제2조1항1호_]=제2조1항1호
제2조1항2호_='2. 제1호에 따른 주권 외의 주권등을 금융투자업자가 매매ㆍ위탁매매 또는 매매의 중개나 대리를 하는 경우에는 그 대금의 전부를 결제하거나 결제받는 때'
제2조1항2호={}
제2조1항[제2조1항2호_]=제2조1항2호
제2조1항3호_='3. 제1호 및 제2호 이외의 경우에는 당해 주권등을 인도하거나 대가의 전부를 받는 때. 다만, 그 주권등을 인도하거나 대가의 전부를 받기 전에 권리가 이전되는 때에는 그 권리가 이전되는 때로 한다.'
제2조1항3호={}
제2조1항[제2조1항3호_]=제2조1항3호
제3조_=' 제3조 (비과세양도) '
제3조={}
제3조['증권거래세법시행령 제3조 (비과세양도)']={}
조문['제3조 (비과세양도)']=제3조
조['제3조 (비과세양도)']=제3조
제3조1항_='①다음 각호의 1에 해당하는 경우에는 법 제6조제4호의 규정에 의하여 증권거래세를 부과하지 아니한다. <개정 1983. 9. 6., 1984. 9. 17., 1993. 12. 31., 1994. 12. 23., 2000. 12. 29., 2005. 2. 19., 2008. 2. 29.>'
제3조1항={}
제3조[제3조1항_]=제3조1항
제3조1항1호_='1. 주권을 목적물로 하는 소비대차의 경우'
제3조1항1호={}
제3조1항[제3조1항1호_]=제3조1항1호
제3조1항2호_='2. 삭제 <1998. 12. 31.>'
제3조1항2호={}
제3조1항[제3조1항2호_]=제3조1항2호
제3조1항3호_='3. 삭제 <1998. 12. 31.>'
제3조1항3호={}
제3조1항[제3조1항3호_]=제3조1항3호
제3조1항4호_='4. 삭제 <1998. 12. 31.>'
제3조1항4호={}
제3조1항[제3조1항4호_]=제3조1항4호
제3조1항5호_='5. 삭제 <2000. 12. 29.>'
제3조1항5호={}
제3조1항[제3조1항5호_]=제3조1항5호
제3조1항6호_='6. 삭제 <1993. 12. 31.>'
제3조1항6호={}
제3조1항[제3조1항6호_]=제3조1항6호
제3조1항7호_='7. 삭제 <2000. 12. 29.>'
제3조1항7호={}
제3조1항[제3조1항7호_]=제3조1항7호
제3조1항8호_='8. 삭제 <1998. 12. 31.>'
제3조1항8호={}
제3조1항[제3조1항8호_]=제3조1항8호
제3조1항9호_='9. 삭제 <2009. 2. 3.>'
제3조1항9호={}
제3조1항[제3조1항9호_]=제3조1항9호
제3조2항_='② 삭제 <2000. 12. 29.>'
제3조2항={}
제3조[제3조2항_]=제3조2항
제4조_=' 제4조 (양도가액평가방법) '
제4조={}
제4조['증권거래세법시행령 제4조 (양도가액평가방법)']={}
조문['제4조 (양도가액평가방법)']=제4조
조['제4조 (양도가액평가방법)']=제4조
제4조1항_='① 법 제7조제1항제2호가목(1)에 따른 시가액 또는 같은 목 (2)에 따른 정상가격은 다음 각 호의 가액을 말한다. <개정 2008. 2. 22.>'
제4조1항={}
제4조[제4조1항_]=제4조1항
제4조1항1호_='1. 시가액 : 「소득세법 시행령」 제167조, 「법인세법 시행령」 제89조 또는 「상속세 및 증여세법 시행령」 제26조에 따라 시가로 인정된 해당 주권등의 가액'
제4조1항1호={}
제4조1항[제4조1항1호_]=제4조1항1호
제4조1항2호_='2. 정상가격 : 「소득세법 시행령」 제183조의2, 「법인세법 시행령」 제131조 또는 「국제조세조정에 관한 법률」 제5조 및 같은 법 시행령 제4조에 따라 정상가격으로 인정된 해당 주권등의 가액'
제4조1항2호={}
제4조1항[제4조1항2호_]=제4조1항2호
제4조2항_='②법 제7조제1항제2호 나목에서 "대통령령이 정하는 양도가액평가방법"이라 함은 다음 각 호의 가액에 양도된 당해 주권등의 거래수량을 곱하여 계산하는 것으로 한다. <개정 2005. 2. 19., 2008. 2. 22., 2009. 2. 3., 2013. 8. 27.>'
제4조2항={}
제4조[제4조2항_]=제4조2항
제4조2항1호_='1. 「자본시장과 금융투자업에 관한 법률」에 따른 상장법인의 주권등을 증권시장 및 다자간매매체결회사 밖에서 양도하는 경우: 「자본시장과 금융투자업에 관한 법률」에 따른 거래소가 공표하는 양도일의 매매거래 기준가액'
제4조2항1호={}
제4조2항[제4조2항1호_]=제4조2항1호
제4조2항2호_='2. 삭제 <2009. 2. 3.>'
제4조2항2호={}
제4조2항[제4조2항2호_]=제4조2항2호
제4조2항3호_='3. 「자본시장과 금융투자업에 관한 법률」 제283조에 따른 한국금융투자협회(이하 "금융투자협회"라 한다)가 같은 법 시행령 제178조제1항에 따른 기준에 따라 거래되는 종목으로 지정한 주권등을 같은 항에 따른 기준 외의 방법으로 양도하는 경우: 금융투자협회가 공표하는 양도일의 매매거래 기준가액'
제4조2항3호={}
제4조2항[제4조2항3호_]=제4조2항3호
제4조2항4호_='4. 제1호 및 제3호 외의 방식으로 주권등을 양도하는 경우 : 「소득세법 시행령」 제165조에 따라 계산한 가액'
제4조2항4호={}
제4조2항[제4조2항4호_]=제4조2항4호
제4조['[전문개정 2000. 12. 29.]']={}
제5조_=' 제5조 (탄력세율) '
제5조={}
제5조['증권거래세법시행령 제5조 (탄력세율)']={}
조문['제5조 (탄력세율)']=제5조
조['제5조 (탄력세율)']=제5조
제5조1항_='법 제8조제2항을 적용받는 주권과 그 세율은 다음 각 호와 같다. <개정 2013. 8. 27., 2017. 2. 7.>'
제5조1항={}
제5조[제5조1항_]=제5조1항
제5조1항1호_='1. 유가증권시장(「자본시장과 금융투자업에 관한 법률 시행령」 제176조의9제1항에 따른 유가증권시장을 말한다)에서 양도되는 주권: 1,000분의 1.5'
제5조1항1호={}
제5조1항[제5조1항1호_]=제5조1항1호
제5조1항2호_='2. 다음 각 목의 어느 하나에 해당하는 주권의 경우: 1,000분의 3'
제5조1항2호={}
제5조1항[제5조1항2호_]=제5조1항2호
제5조1항2호가목_='가. 코스닥시장(대통령령 제24697호 자본시장과 금융투자업에 관한 법률 시행령 일부개정령 부칙 제8조에 따른 코스닥시장을 말한다)에서 양도되는 주권'
제5조1항2호가목={}
제5조1항2호[제5조1항2호가목_]=제5조1항2호가목
제5조1항2호나목_='나. 코넥스시장(「자본시장과 금융투자업에 관한 법률 시행령」 제11조제2항에 따른 코넥스시장을 말한다)에서 양도되는 주권'
제5조1항2호나목={}
제5조1항2호[제5조1항2호나목_]=제5조1항2호나목
제5조1항2호다목_='다. 「자본시장과 금융투자업에 관한 법률 시행령」 제178조제1항에 따른 기준에 따라 금융투자협회를 통하여 양도되는 주권'
제5조1항2호다목={}
제5조1항2호[제5조1항2호다목_]=제5조1항2호다목
제5조['[전문개정 2013. 6. 28.]']={}
제6조_=' 제6조 (거래징수) '
제6조={}
제6조['증권거래세법시행령 제6조 (거래징수)']={}
조문['제6조 (거래징수)']=제6조
조['제6조 (거래징수)']=제6조
제6조1항_='법 제3조제1호의 납세의무자가 법 제9조에 따라 증권거래세를 징수하는 경우에 법 제6조제1호에 해당하는 부분에 대하여는 제6조의2에 따른 주권매매관련사항을 포함하여 기재한 비과세양도명세서를 금융투자업자로부터 제출받은 분에 대하여만 징수하지 아니한다.'
제6조1항={}
제6조[제6조1항_]=제6조1항
제6조['[전문개정 2009. 2. 3.]']={}
제6_02조_=' 제6조의2(주권매매 관련 사항의 통지) '
제6_02조={}
제6_02조['증권거래세법시행령 제6조의2(주권매매 관련 사항의 통지)']={}
조문['제6조의2(주권매매 관련 사항의 통지)']=제6_02조
조['제6조의2(주권매매 관련 사항의 통지)']=제6_02조
제6_02조1항_='법 제9조제2항에서 "주권의 종목ㆍ수량 등 대통령령으로 정하는 사항"이란 양도 건별 주권의 종목 명, 수량, 1주 당 가액, 매매금액, 매매연월일 및 양도자의 계좌번호(이하 "주권매매관련사항"이라 한다)를 말한다.'
제6_02조1항={}
제6_02조[제6_02조1항_]=제6_02조1항
제6_02조['[본조신설 2009. 2. 3.]']={}
제6_03조_=' 제6조의3(증권계좌간 이체내역 등 제출) '
제6_03조={}
제6_03조['증권거래세법시행령 제6조의3(증권계좌간 이체내역 등 제출)']={}
조문['제6조의3(증권계좌간 이체내역 등 제출)']=제6_03조
조['제6조의3(증권계좌간 이체내역 등 제출)']=제6_03조
제6_03조1항_='금융투자업자는 법 제9조의2에 따라 그가 관리하는 증권계좌를 통하여 법 제3조제3호에 해당하는 납세의무자가 주권등을 양도한 경우에 다음 각 호의 사항을 적은 주권등의 거래명세서를 관할 세무서장에게 제출하여야 한다.'
제6_03조1항={}
제6_03조[제6_03조1항_]=제6_03조1항
제6_03조1항1호_='1. 제출자의 인적사항'
제6_03조1항1호={}
제6_03조1항[제6_03조1항1호_]=제6_03조1항1호
제6_03조1항2호_='2. 거래자의 인적사항'
제6_03조1항2호={}
제6_03조1항[제6_03조1항2호_]=제6_03조1항2호
제6_03조1항3호_='3. 거래 연월일'
제6_03조1항3호={}
제6_03조1항[제6_03조1항3호_]=제6_03조1항3호
제6_03조1항4호_='4. 거래대상 주권등 종목명'
제6_03조1항4호={}
제6_03조1항[제6_03조1항4호_]=제6_03조1항4호
제6_03조1항5호_='5. 거래 수량'
제6_03조1항5호={}
제6_03조1항[제6_03조1항5호_]=제6_03조1항5호
제6_03조['[본조신설 2013. 2. 15.]']={}
제7조_=' 제7조 (신고ㆍ납부 및 환급) '
제7조={}
제7조['증권거래세법시행령 제7조 (신고ㆍ납부 및 환급)']={}
조문['제7조 (신고ㆍ납부 및 환급)']=제7조
조['제7조 (신고ㆍ납부 및 환급)']=제7조
제7조1항_='①법 제10조제1항의 규정에 의한 증권거래세의 과세표준신고에 있어서는 다음 각호의 사항을 기재한 증권거래세 과세표준신고서를 관할세무서장에게 제출하여야 한다. <개정 1993. 12. 31., 1996. 8. 22.>'
제7조1항={}
제7조[제7조1항_]=제7조1항
제7조1항1호_='1. 납세의무자의 인적사항'
제7조1항1호={}
제7조1항[제7조1항1호_]=제7조1항1호
제7조1항2호_='2. 세율별 과세표준ㆍ세율ㆍ세액'
제7조1항2호={}
제7조1항[제7조1항2호_]=제7조1항2호
제7조1항3호_='3. 거래자의 인적사항(법 제3조제3호의 규정에 의한 납세의무자에 한한다)'
제7조1항3호={}
제7조1항[제7조1항3호_]=제7조1항3호
제7조1항4호_='4. 주권등 매매계약서 사본(법 제3조제3호의 규정에 의한 납세의무자에 한한다)'
제7조1항4호={}
제7조1항[제7조1항4호_]=제7조1항4호
제7조1항5호_='5. 비과세양도명세서(법 제3조제1호의 규정에 의한 납세의무자에 한한다)'
제7조1항5호={}
제7조1항[제7조1항5호_]=제7조1항5호
제7조1항6호_='6. 기타 참고사항'
제7조1항6호={}
제7조1항[제7조1항6호_]=제7조1항6호
제7조2항_='②법 제10조제2항의 규정에 의한 증권거래세의 납부에 있어서는 증권거래세과세표준신고서와 함께 관할세무서장에게 납부하거나 「국세징수법」에 의한 납부서에 증권거래세과세표준신고서를 첨부하여 한국은행(그 대리점을 포함한다) 또는 체신관서에 납부하여야 한다. <개정 1996. 8. 22., 2005. 2. 19.>'
제7조2항={}
제7조[제7조2항_]=제7조2항
제7조3항_='③납세의무자가 사업장을 폐지한 때에는 그날부터 25일 이내에 폐지한 날이 속하는 달의 과세표준과 세액을 제1항 및 제2항의 규정에 의하여 신고하고 납부하여야 한다. <개정 2009. 2. 3.>'
제7조3항={}
제7조[제7조3항_]=제7조3항
제7조4항_='④법 제3조제1호의 규정에 의한 납세의무자는 증권거래세 신고ㆍ납부기한 종료일의 다음날부터 6월 이내에 한하여 법 제10조제3항의 규정에 의한 환급을 할 수 있다. <신설 2000. 12. 29.>'
제7조4항={}
제7조[제7조4항_]=제7조4항
제7조['[제목개정 2000. 12. 29.]']={}
제8조_=' 제8조 (경정) '
제8조={}
제8조['증권거래세법시행령 제8조 (경정)']={}
조문['제8조 (경정)']=제8조
조['제8조 (경정)']=제8조
제8조1항_='①법 제11조제2항 단서에서 "대통령령이 정하는 경우"라 함은 다음 각호의 1에 해당하는 경우를 말한다. <개정 2000. 12. 29.>'
제8조1항={}
제8조[제8조1항_]=제8조1항
제8조1항1호_='1. 과세표준을 계산함에 있어서 필요한 장부 기타 증빙서류가 없거나 중요한 부분이 미비 또는 허위인 때'
제8조1항1호={}
제8조1항[제8조1항1호_]=제8조1항1호
제8조1항2호_='2. 장부 기타의 증빙서류의 내용이 주권 등의 거래량에 비추어 신빙성이 없다고 인정될 때'
제8조1항2호={}
제8조1항[제8조1항2호_]=제8조1항2호
제8조2항_='②법 제11조제2항 단서의 규정에 의하여 추계에 의하여 결정 또는 경정하는 때에는 조사에 의하여 확인된 주권 등의 거래량에 제4조 각호의 규정에 의하여 계산한 주권 등의 단위당 금액을 곱하여 과세표준과 세액을 계산한다. <개정 1993. 12. 31., 2000. 12. 29.>'
제8조2항={}
제8조[제8조2항_]=제8조2항
제8조['[제목개정 2000. 12. 29.]']={}
제8_02조_=' 제8조의2 삭제  '
제8_02조={}
제8_02조['증권거래세법시행령 제8조의2 삭제 ']={}
조문['제8조의2 삭제 ']=제8_02조
조['제8조의2 삭제 ']=제8_02조
제9조_=' 제9조 (장부의 비치ㆍ기장) '
제9조={}
제9조['증권거래세법시행령 제9조 (장부의 비치ㆍ기장)']={}
조문['제9조 (장부의 비치ㆍ기장)']=제9조
조['제9조 (장부의 비치ㆍ기장)']=제9조
제9조1항_='법 제15조제1항에 규정하는 관계장부에는 다음 각호의 사항을 기재하여야 한다. <개정 2009. 2. 3.>'
제9조1항={}
제9조[제9조1항_]=제9조1항
제9조1항1호_='1. 과세 및 비과세양도의 구분'
제9조1항1호={}
제9조1항[제9조1항1호_]=제9조1항1호
제9조1항2호_='2. 주권매매관련사항 및 세액'
제9조1항2호={}
제9조1항[제9조1항2호_]=제9조1항2호
제9조1항3호_='3. 삭제 <2009. 2. 3.>'
제9조1항3호={}
제9조1항[제9조1항3호_]=제9조1항3호
제9조1항4호_='4. 기타 참고 사항'
제9조1항4호={}
제9조1항[제9조1항4호_]=제9조1항4호
제10조_=' 제10조 (명령사항) '
제10조={}
제10조['증권거래세법시행령 제10조 (명령사항)']={}
조문['제10조 (명령사항)']=제10조
조['제10조 (명령사항)']=제10조
제10조1항_='국세청장ㆍ관할지방국세청장 또는 관할세무서장은 법 제16조에 따라 납세의무자 및 금융투자업자에게 전자계산조직의 사용방법, 과세 및 비과세양도의 구분표시, 주권등의 매매거래(법 제9조의2에 해당하는 양도를 포함한다)상황보고, 그 밖에 납세보전상 필요한 한도내에서 단속상 필요한 사항을 명령할 수 있다. <개정 1996. 8. 22., 2013. 2. 15.>'
제10조1항={}
제10조[제10조1항_]=제10조1항
제11조_=' 제11조 (질문ㆍ검사) '
제11조={}
제11조['증권거래세법시행령 제11조 (질문ㆍ검사)']={}
조문['제11조 (질문ㆍ검사)']=제11조
조['제11조 (질문ㆍ검사)']=제11조
제11조1항_='증권거래세에 관한 사무에 종사하는 공무원이 법 제17조의 규정에 의하여 질문 또는 검사를 할 때에는 그 권한을 표시하는 증표를 휴대하여 이를 관계인에게 제시하여야 한다.'
제11조1항={}
제11조[제11조1항_]=제11조1항
제12조_=' 제12조 (서식) '
제12조={}
제12조['증권거래세법시행령 제12조 (서식)']={}
조문['제12조 (서식)']=제12조
조['제12조 (서식)']=제12조
제12조1항_='이 영의 규정에 의한 신고서 기타 필요한 서식은 기획재정부령으로 정한다. <개정 1994. 12. 23., 2000. 12. 29., 2008. 2. 29.>'
제12조1항={}
제12조[제12조1항_]=제12조1항
제13조_=' 제13조 삭제  '
제13조={}
제13조['증권거래세법시행령 제13조 삭제 ']={}
조문['제13조 삭제 ']=제13조
조['제13조 삭제 ']=제13조
부칙['부칙  <제27843호, 2017. 2. 7.']={}
부칙['제1조(시행일) 이 영은 2017년 4월 1일부터 시행한다']={}
부칙['제2조(탄력세율에 관한 적용례) 제5조제2호다목의 개정규정은 이 영 시행 이후 주권을 양도하는 분부터 적용한다']={}
bub={'서문':서문,'조문':조문,'조별':조,'부칙':부칙}
    
import wx
class MyFrame(wx.Frame):
    def __init__(self):
        wx.Frame.__init__(self, parent=None, title=bubname)
        self.SetSize(620, 520)
        self.mainPanel = wx.Panel(self)
        self.expandButton = wx.Button(self.mainPanel, label=bubname)
        self.tree = wx.TreeCtrl(self.mainPanel)
        root = self.tree.AddRoot(bubname)
        for i in bub:
            ii = self.tree.AppendItem(root, i)
            for j in bub[i]:
                jj = self.tree.AppendItem(ii, j)
                for k in bub[i][j]:
                    kk = self.tree.AppendItem(jj, k)
                    for m in bub[i][j][k]:
                        mm = self.tree.AppendItem(kk, m)
                        for n in bub[i][j][k][m]:
                            nn = self.tree.AppendItem(mm, n)
                            for p in bub[i][j][k][m][n]:
                                pp = self.tree.AppendItem(nn, p)
                                for q in bub[i][j][k][m][n][p]:
                                    qq=self.tree.AppendItem(pp,q)
                                    for r in bub[i][j][k][m][n][p][q]:
                                        rr=self.tree.AppendItem(qq,r)
                                        for s in bub[i][j][k][m][n][p][q][r]:
                                            ss = self.tree.AppendItem(rr, s)
                                            for t in bub[i][j][k][m][n][p][q][r][s]:
                                                tt = self.tree.AppendItem(ss, t)
                                                for u in bub[i][j][k][m][n][p][q][r][s][t]:
                                                    uu = self.tree.AppendItem(tt, u)
                                                    for v in bub[i][j][k][m][n][p][q][r][s][t][u]:
                                                        vv = self.tree.AppendItem(uu, v)
        self.staticText = wx.TextCtrl(self.mainPanel, style=wx.TE_MULTILINE)
        self.vtBoxSizer = wx.BoxSizer(wx.VERTICAL)
        self.vtBoxSizer.Add(self.expandButton, 0, wx.EXPAND | wx.ALL, 5)
        self.vtBoxSizer.Add(self.tree, 5, wx.EXPAND | wx.ALL, 5)
        self.vtBoxSizer.Add(self.staticText, 0, wx.EXPAND | wx.ALL, 5)
        self.mainPanel.SetSizer(self.vtBoxSizer)
        self.Bind(wx.EVT_BUTTON, self.OnExpandButton, self.expandButton)
        self.Bind(wx.EVT_TREE_SEL_CHANGED, self.OnNodeSelected, self.tree)
        self.Bind(wx.EVT_CLOSE, self.OnClose)

    def OnExpandButton(self, e):
        self.tree.ExpandAll()

    def __del__(self):
        print('소멸합니다.')

    def OnClose(self, event):
        frame.Destroy()

    def OnNodeSelected(self, e):
        selected = self.tree.GetSelection()
        self.staticText.SetLabel(self.tree.GetItemText(selected))
        self.mainPanel.Layout()
if __name__ == '__main__':
    app = wx.App(redirect=True)
    frame = MyFrame()
    wnd = wx.Frame(None, wx.ID_ANY, "")
    wnd.CenterOnScreen()
    app.SetTopWindow(wnd)
    frame.Show()
    app.MainLoop()
    