# -*- coding: utf-8 -*-
#Created on 2019년 @author: 권달현
조={};서문={};조문={};부칙 = {};bubname='지방세특례제한법시행규칙'
편=장=절=관=항=조={} 
서문['']={}
서문['지방세특례제한법 시행규']={}
서문['[시행 2019. 1. 1] [행정안전부령 제95호, 2018. 12. 31, 일부개정']={}
서문['행정안전부(지방세특례제도과) 02-2100-362']={}
제1조_=' 제1조 (목적) '
제1조={}
제1조['지방세특례제한법시행규칙 제1조 (목적)']={}
조문['제1조 (목적)']=제1조
조['제1조 (목적)']=제1조
제1조1항_='이 규칙은 「지방세특례제한법」 및 같은 법 시행령에서 위임된 사항과 그 시행에 필요한 사항을 규정함을 목적으로 한다.'
제1조1항={}
제1조[제1조1항_]=제1조1항
제2조_=' 제2조 (감면 신청) '
제2조={}
제2조['지방세특례제한법시행규칙 제2조 (감면 신청)']={}
조문['제2조 (감면 신청)']=제2조
조['제2조 (감면 신청)']=제2조
제2조1항_='① 「지방세특례제한법 시행령」(이하 "영"이라 한다) 제2조제5항에 따른 지방세 감면 신청은 별지 제1호서식에 따른다. <개정 2014. 12. 31.>'
제2조1항={}
제2조[제2조1항_]=제2조1항
제2조2항_='② 제1항에 따른 지방세 감면 신청을 받은 시장ㆍ군수ㆍ구청장(구청장은 자치구의 구청장을 말하며, 이하 "시장ㆍ군수ㆍ구청장"이라 한다)은 지방세 감면 여부를 결정하여야 하고, 지방세를 감면하기로 결정한 경우 그 통지는 별지 제2호서식에 따른다. <개정 2016. 12. 30.>'
제2조2항={}
제2조[제2조2항_]=제2조2항
제2_02조_=' 제2조의2(자경농민 농지 감면 및 자영어민 어업용 토지 감면 소득기준 등의 범위) '
제2_02조={}
제2_02조['지방세특례제한법시행규칙 제2조의2(자경농민 농지 감면 및 자영어민 어업용 토지 감면 소득기준 등의 범위)']={}
조문['제2조의2(자경농민 농지 감면 및 자영어민 어업용 토지 감면 소득기준 등의 범위)']=제2_02조
조['제2조의2(자경농민 농지 감면 및 자영어민 어업용 토지 감면 소득기준 등의 범위)']=제2_02조
제2_02조1항_='① 영 제3조제6항에서 "직전 연도 농업 외의 종합소득금액"이란 다음 각 호의 금액을 합산한 것을 말한다. <개정 2017. 12. 29., 2018. 12. 31.>'
제2_02조1항={}
제2_02조[제2_02조1항_]=제2_02조1항
제2_02조1항1호_='1. 「소득세법」 제19조에 따른 사업소득금액'
제2_02조1항1호={}
제2_02조1항[제2_02조1항1호_]=제2_02조1항1호
제2_02조1항2호_='2. 「소득세법」 제20조제1항에 따른 근로소득에서 같은 법 제12조에 따른 비과세소득을 차감한 금액'
제2_02조1항2호={}
제2_02조1항[제2_02조1항2호_]=제2_02조1항2호
제2_02조1항3호_='3. 「소득세법」 제16조, 제17조, 제20조의3 및 제21조에 따른 이자소득금액, 배당소득금액, 연금소득금액 및 기타소득금액'
제2_02조1항3호={}
제2_02조1항[제2_02조1항3호_]=제2_02조1항3호
제2_02조2항_='② 제1항에 따른 직전 연도 농업 외의 종합소득금액은 다음 각 호의 구분에 따른 연도의 소득금액으로 한다.'
제2_02조2항={}
제2_02조[제2_02조2항_]=제2_02조2항
제2_02조2항1호_='1. 「소득세법」 제70조에 따른 종합소득 과세표준이 확정된 경우: 「지방세특례제한법」(이하 "법"이라 한다) 제6조에 따른 농지 취득일이 속하는 연도의 직전 연도'
제2_02조2항1호={}
제2_02조2항[제2_02조2항1호_]=제2_02조2항1호
제2_02조2항2호_='2. 「소득세법」 제70조에 따른 종합소득 과세표준이 확정되지 아니한 경우: 법 제6조에 따른 농지 취득일이 속하는 연도의 전전 연도'
제2_02조2항2호={}
제2_02조2항[제2_02조2항2호_]=제2_02조2항2호
제2_02조3항_='③ 법 제6조에 따라 취득세를 경감받으려는 자(이하 이 항에서 "감면신청인"이라 한다)는 별지 제1호의2서식에 따른 감면신청서에 제2항에 따른 소득금액을 확인할 수 있는 다음 각 호의 서류를 첨부하여 관할 지방자치단체의 장에게 제출하여야 한다. 이 경우 감면신청인이 「전자정부법」 제36조제1항에 따른 행정정보의 공동이용을 통한 주민등록등본 등의 확인에 동의하는 경우에는 그 확인으로 주민등록등본 등의 제출을 갈음할 수 있다. <개정 2017. 12. 29.>'
제2_02조3항={}
제2_02조[제2_02조3항_]=제2_02조3항
제2_02조3항1호_='1. 주민등록등본'
제2_02조3항1호={}
제2_02조3항[제2_02조3항1호_]=제2_02조3항1호
제2_02조3항2호_='2. 소득금액증명원, 그 밖의 종합소득금액을 확인하는 서류로서 행정안전부장관이 정하여 고시하는 서류'
제2_02조3항2호={}
제2_02조3항[제2_02조3항2호_]=제2_02조3항2호
제2_02조3항3호_='3. 2년 이상 영농에 종사하고 있음을 확인하는 서류로서 행정안전부장관이 정하여 고시하는 서류'
제2_02조3항3호={}
제2_02조3항[제2_02조3항3호_]=제2_02조3항3호
제2_02조4항_='④ 영 제5조제4항에 따른 직전 연도 어업 외의 종합소득금액은 제1항 각 호의 금액을 합산한 것으로 한다. <신설 2017. 12. 29.>'
제2_02조4항={}
제2_02조[제2_02조4항_]=제2_02조4항
제2_02조5항_='⑤ 제4항에 따른 직전 연도 어업 외의 종합소득금액의 산정은 다음 각 호의 구분에 따른 연도의 소득금액을 기준으로 한다. <신설 2017. 12. 29.>'
제2_02조5항={}
제2_02조[제2_02조5항_]=제2_02조5항
제2_02조5항1호_='1. 「소득세법」 제70조에 따른 종합소득 과세표준이 확정된 경우: 법 제9조제1항에 따른 양어장인 토지 및 영 제5조3항에 따른 수조의 취득일이 속하는 연도의 직전 연도'
제2_02조5항1호={}
제2_02조5항[제2_02조5항1호_]=제2_02조5항1호
제2_02조5항2호_='2. 「소득세법」 제70조에 따른 종합소득 과세표준이 확정되지 아니한 경우: 법 제9조제1항에 따른 양어장인 토지 및 영 제5조3항에 따른 수조의 취득일이 속하는 연도의 전전 연도'
제2_02조5항2호={}
제2_02조5항[제2_02조5항2호_]=제2_02조5항2호
제2_02조6항_='⑥ 법 제9조에 따라 취득세를 경감받으려는 자(이하 이 항에서 "감면신청인"이라 한다)는 별지 제1호의3서식에 따른 감면신청서에 제4항에 따른 소득금액을 확인할 수 있는 다음 각 호의 서류를 첨부하여 관할 지방자치단체의 장에게 제출하여야 한다. 이 경우 감면신청인이 「전자정부법」 제36조제1항에 따른 행정정보의 공동이용을 통한 주민등록등본 등의 확인에 동의하는 경우에는 그 확인으로 주민등록등본 등의 제출을 갈음할 수 있다. <신설 2017. 12. 29.>'
제2_02조6항={}
제2_02조[제2_02조6항_]=제2_02조6항
제2_02조6항1호_='1. 주민등록등본'
제2_02조6항1호={}
제2_02조6항[제2_02조6항1호_]=제2_02조6항1호
제2_02조6항2호_='2. 소득금액증명원, 그 밖의 종합소득금액을 확인하는 서류로서 행정안전부장관이 정하여 고시하는 서류'
제2_02조6항2호={}
제2_02조6항[제2_02조6항2호_]=제2_02조6항2호
제2_02조6항3호_='3. 어업에 종사하고 있음을 확인하는 서류로서 행정안전부장관이 정하여 고시하는 서류'
제2_02조6항3호={}
제2_02조6항[제2_02조6항3호_]=제2_02조6항3호
제2_02조['[본조신설 2014. 12. 31.]']={}
제2_02조['[제목개정 2017. 12. 29.]']={}
제2_03조_=' 제2조의3(연평균 입소 인원의 계산) '
제2_03조={}
제2_03조['지방세특례제한법시행규칙 제2조의3(연평균 입소 인원의 계산)']={}
조문['제2조의3(연평균 입소 인원의 계산)']=제2_03조
조['제2조의3(연평균 입소 인원의 계산)']=제2_03조
제2_03조1항_='영 제8조의4제2호에서 "행정안전부령으로 정하는 기준"이란 다음의 계산식에 따라 계산한 연평균 입소 인원 비율이 100분의 80 이상인 경우를 말한다. <개정 2017. 7. 26.>'
제2_03조1항={}
제2_03조[제2_03조1항_]=제2_03조1항
제2_03조['']={}
제2_03조['[본조신설 2015. 12. 31.]']={}
제3조_=' 제3조 (외국인관광객 투숙 실적 신고서) '
제3조={}
제3조['지방세특례제한법시행규칙 제3조 (외국인관광객 투숙 실적 신고서)']={}
조문['제3조 (외국인관광객 투숙 실적 신고서)']=제3조
조['제3조 (외국인관광객 투숙 실적 신고서)']=제3조
제3조1항_='법 제54조제2항 및 영 제27조에 따라 재산세를 경감받으려는 자는 별지 제3호서식의 외국인관광객 투숙 실적 신고서에 다음 각 호의 서류를 첨부하여 관할 시장ㆍ군수ㆍ구청장에게 제출하여야 한다. <개정 2014. 12. 31., 2016. 12. 30.>'
제3조1항={}
제3조[제3조1항_]=제3조1항
제3조1항1호_='1. 부가가치세 확정신고서(부가가치세 확정신고를 하지 아니한 경우에는 부가가치세 예정신고서를 말한다) 1부'
제3조1항1호={}
제3조1항[제3조1항1호_]=제3조1항1호
제3조1항2호_='2. 영 제27조제1호가목에 따른 외국인관광객(이하 "외국인관광객"이 라 한다)에 대한 직전 연도 숙박용역 공급가액(객실요금만 해당한다) 1부'
제3조1항2호={}
제3조1항[제3조1항2호_]=제3조1항2호
제3조1항3호_='3. 별지 제4호서식의 외국인관광객 숙박 및 음식 매출기록표 1부'
제3조1항3호={}
제3조1항[제3조1항3호_]=제3조1항3호
제3조1항4호_='4. 외국인관광객에 대한 객실요금 인하율표(해당 지방자치단체에서 조례로 그 인하율을 정한 경우만 해당한다) 1부'
제3조1항4호={}
제3조1항[제3조1항4호_]=제3조1항4호
제3_02조_=' 제3조의2(창업중소기업 지방세 감면신청) '
제3_02조={}
제3_02조['지방세특례제한법시행규칙 제3조의2(창업중소기업 지방세 감면신청)']={}
조문['제3조의2(창업중소기업 지방세 감면신청)']=제3_02조
조['제3조의2(창업중소기업 지방세 감면신청)']=제3_02조
제3_02조1항_='법 제58조의3제9항에 따라 창업중소기업 및 창업벤처중소기업이 지방세를 경감받으려는 경우에는 별지 제1호의4서식의 창업중소기업 지방세 감면 신청서에 사업자등록증, 법인 등기부등본 및 벤처기업확인서 등 창업중소기업 및 창업벤처중소기업임을 확인할 수 있는 서류를 첨부하여 관할 지방자치단체의 장에게 제출하여야 한다. 이 경우 「전자정부법」 제36조제1항에 따른 행정정보의 공동이용을 통한 사업자등록증 등의 확인에 동의하는 경우에는 그 확인으로 사업자등록증 등의 제출을 갈음할 수 있다. <개정 2016. 12. 30., 2017. 12. 29.>'
제3_02조1항={}
제3_02조[제3_02조1항_]=제3_02조1항
제3_02조['[본조신설 2014. 12. 31.]']={}
제4조_=' 제4조 (전방조종자동차에 대한 과세특례) '
제4조={}
제4조['지방세특례제한법시행규칙 제4조 (전방조종자동차에 대한 과세특례)']={}
조문['제4조 (전방조종자동차에 대한 과세특례)']=제4조
조['제4조 (전방조종자동차에 대한 과세특례)']=제4조
제4조1항_='법 제67조제3항 전단에서 "행정안전부령으로 정하는 자동차"란 「자동차 및 자동차부품의 성능과 기준에 관한 규칙」 제2조제23호에 따른 전방조종자동차를 말한다. <개정 2013. 3. 23., 2014. 11. 19., 2014. 12. 31., 2017. 7. 26.>'
제4조1항={}
제4조[제4조1항_]=제4조1항
제5조_=' 제5조 (부동산등의 수용 등 확인서) '
제5조={}
제5조['지방세특례제한법시행규칙 제5조 (부동산등의 수용 등 확인서)']={}
조문['제5조 (부동산등의 수용 등 확인서)']=제5조
조['제5조 (부동산등의 수용 등 확인서)']=제5조
제5조1항_='법 제73조제1항에 따른 부동산등(이하 이 조에서 "부동산등"이라 한다)이 매수, 수용 또는 철거된 자가 종전의 부동산등을 대체할 부동산등을 취득함에 따라 취득세를 면제받으려는 경우에는 별지 제5호서식의 부동산등 매수, 수용 또는 철거 확인서를 관할 시장ㆍ군수ㆍ구청장에게 제출하여야 한다. <개정 2016. 12. 30.>'
제5조1항={}
제5조[제5조1항_]=제5조1항
제6조_=' 제6조 (산업단지 등 입주 공장의 범위) '
제6조={}
제6조['지방세특례제한법시행규칙 제6조 (산업단지 등 입주 공장의 범위)']={}
조문['제6조 (산업단지 등 입주 공장의 범위)']=제6조
조['제6조 (산업단지 등 입주 공장의 범위)']=제6조
제6조1항_='법 제78조제7항 및 영 제38조 단서에 따른 공장의 범위는 「지방세법 시행규칙」 별표 2에서 규정하는 업종의 공장으로서 생산설비를 갖춘 건축물의 연면적(옥외에 기계장치 또는 저장시설이 있는 경우에는 그 시설물의 수평투영면적을 포함한다)이 200제곱미터 이상인 것을 말한다. 이 경우 건축물의 연면적에는 그 제조시설을 지원하기 위하여 공장 경계구역 안에 설치되는 종업원의 후생복지시설 등 각종 부대시설(수익사업용으로 사용되는 부분은 제외한다)을 포함한다. <개정 2014. 12. 31., 2016. 12. 30.>'
제6조1항={}
제6조[제6조1항_]=제6조1항
제7조_=' 제7조 (대도시 외의 지역으로 이전하는 본점 또는 주사무소에 대한 감면 등의 적용기준) '
제7조={}
제7조['지방세특례제한법시행규칙 제7조 (대도시 외의 지역으로 이전하는 본점 또는 주사무소에 대한 감면 등의 적용기준)']={}
조문['제7조 (대도시 외의 지역으로 이전하는 본점 또는 주사무소에 대한 감면 등의 적용기준)']=제7조
조['제7조 (대도시 외의 지역으로 이전하는 본점 또는 주사무소에 대한 감면 등의 적용기준)']=제7조
제7조1항_='① 법 제79조제1항 본문에 따라 대도시(영 제39조에 따른 대도시를 말한다. 이하 같다) 외의 지역으로 본점 또는 주사무소를 이전(移轉)하여 해당 사업을 직접 하기 위하여 취득하는 부동산의 범위는 법인의 본점 또는 주사무소로 사용하는 부동산과 그 부대시설용 부동산으로서 다음 각 호의 요건을 모두 갖춘 것으로 한다. <개정 2016. 12. 30.>'
제7조1항={}
제7조[제7조1항_]=제7조1항
제7조1항1호_='1. 대도시 외의 지역으로 이전하기 위하여 취득한 본점 또는 주사무소용 부동산으로서 사업을 시작하기 이전에 취득한 것일 것'
제7조1항1호={}
제7조1항[제7조1항1호_]=제7조1항1호
제7조1항2호_='2. 과밀억제권역 내의 본점 또는 주사무소를 대도시 외의 지역으로 이전하기 위하여 사업을 중단한 날까지 6개월(임차한 경우에는 2년을 말한다) 이상 사업을 한 실적이 있을 것'
제7조1항2호={}
제7조1항[제7조1항2호_]=제7조1항2호
제7조1항3호_='3. 대도시 외의 지역에서 그 사업을 시작한 날부터 6개월 이내에 과밀억제권역 내에 있는 종전의 본점 또는 주사무소를 폐쇄할 것'
제7조1항3호={}
제7조1항[제7조1항3호_]=제7조1항3호
제7조1항4호_='4. 대도시 외의 지역에서 본점 또는 주사무소용 부동산을 취득한 날부터 6개월 이내에 건축공사를 시작하거나 직접 그 용도에 사용할 것. 다만, 정당한 사유가 있는 경우에는 6개월 이내에 건축공사를 시작하지 아니하거나 직접 그 용도에 사용하지 아니할 수 있다.'
제7조1항4호={}
제7조1항[제7조1항4호_]=제7조1항4호
제7조2항_='② 제1항에 따른 감면대상이 되는 본점 또는 주사무소용 부동산 가액의 합계액이 이전하기 전의 본점 또는 주사무소용 부동산 가액의 합계액을 초과하는 경우 그 초과액에 대해서는 취득세를 과세한다. 이 경우 그 초과액의 산정방법과 적용기준은 다음 각 호와 같다.'
제7조2항={}
제7조[제7조2항_]=제7조2항
제7조2항1호_='1. 이전한 본점 또는 주사무소용 부동산의 가액과 이전하기 전의 본점 또는 주사무소용 부동산의 가액이 각각 「지방세법」 제10조제5항에 따른 사실상의 취득가격 및 연부금액으로 증명되는 경우에는 그 차액'
제7조2항1호={}
제7조2항[제7조2항1호_]=제7조2항1호
제7조2항2호_='2. 제1호 외의 경우에는 이전한 본점 또는 주사무소용 부동산의 시가표준액(「지방세법」 제4조에 따른 시가표준액을 말한다. 이하 같다)과 이전하기 전의 본점 또는 주사무소용 부동산의 시가표준액의 차액'
제7조2항2호={}
제7조2항[제7조2항2호_]=제7조2항2호
제8조_=' 제8조 (대도시 외의 지역으로 이전하는 공장의 범위와 적용기준) '
제8조={}
제8조['지방세특례제한법시행규칙 제8조 (대도시 외의 지역으로 이전하는 공장의 범위와 적용기준)']={}
조문['제8조 (대도시 외의 지역으로 이전하는 공장의 범위와 적용기준)']=제8조
조['제8조 (대도시 외의 지역으로 이전하는 공장의 범위와 적용기준)']=제8조
제8조1항_='① 법 제80조제1항에 따른 공장의 범위는 「지방세법 시행규칙」 별표 2에서 규정하는 업종의 공장으로서 생산설비를 갖춘 건축물의 연면적(옥외에 기계장치 또는 저장시설이 있는 경우에는 그 시설물의 수평투영면적을 포함한다)이 200제곱미터 이상인 것을 말한다. 이 경우 건축물의 연면적에는 그 제조시설을 지원하기 위하여 공장 경계구역 안에 설치되는 종업원의 후생복지시설 등 각종 부대시설(수익사업용으로 사용되는 부분은 제외한다)을 포함한다. <개정 2018. 12. 31.>'
제8조1항={}
제8조[제8조1항_]=제8조1항
제8조2항_='② 법 제80조제1항에 따라 감면 대상이 되는 공장용 부동산은 다음 각 호의 요건을 모두 갖춘 것이어야 한다. <개정 2016. 12. 30.>'
제8조2항={}
제8조[제8조2항_]=제8조2항
제8조2항1호_='1. 이전한 공장의 사업을 시작하기 이전에 취득한 부동산일 것'
제8조2항1호={}
제8조2항[제8조2항1호_]=제8조2항1호
제8조2항2호_='2. 공장시설(제조장 단위별로 독립된 시설을 말한다. 이하 같다)을 이전하기 위하여 대도시 내에 있는 공장의 조업을 중단한 날까지 6개월(임차한 공장의 경우에는 2년을 말한다) 이상 계속하여 조업한 실적이 있을 것. 이 경우 「수질 및 수생태계 보전에 관한 법률」 또는 「대기환경보전법」에 따라 폐수배출시설 또는 대기오염물질배출시설 등의 개선명령ㆍ이전명령ㆍ조업정지나 그 밖의 처분을 받아 조업을 중단하였을 때의 그 조업 중지기간은 조업한 기간으로 본다.'
제8조2항2호={}
제8조2항[제8조2항2호_]=제8조2항2호
제8조2항3호_='3. 대도시 외에서 그 사업을 시작한 날부터 6개월(시운전 기간은 제외한다) 이내에 대도시 내에 있는 해당 공장시설을 완전히 철거하거나 폐쇄할 것'
제8조2항3호={}
제8조2항[제8조2항3호_]=제8조2항3호
제8조2항4호_='4. 토지를 취득하였을 때에는 그 취득일부터 6개월 이내에 공장용 건축물 공사를 시작하여야 하며, 건축물을 취득하거나 토지와 건축물을 동시에 취득하였을 때에는 그 취득일부터 6개월 이내에 사업을 시작할 것. 다만, 정당한 사유가 있을 때에는 6개월 이내에 공장용 건축물 공사를 시작하지 아니하거나 사업을 시작하지 아니할 수 있다.'
제8조2항4호={}
제8조2항[제8조2항4호_]=제8조2항4호
제8조3항_='③ 제2항에 따른 감면대상이 되는 공장용 부동산 가액의 합계액이 이전하기 전의 공장용 부동산 가액의 합계액을 초과하는 경우 그 초과액에 대해서는 취득세를 과세한다. 이 경우 초과액의 산정기준은 다음 각 호와 같다.'
제8조3항={}
제8조[제8조3항_]=제8조3항
제8조3항1호_='1. 이전한 공장용 부동산의 가액과 이전하기 전의 공장용 부동산의 가액이 각각 「지방세법」 제10조제5항에 따른 사실상의 취득가격 및 연부금액으로 증명되는 경우에는 그 차액'
제8조3항1호={}
제8조3항[제8조3항1호_]=제8조3항1호
제8조3항2호_='2. 제1호 외의 경우에는 이전한 공장용 부동산의 시가표준액과 이전하기 전의 공장용 부동산의 시가표준액의 차액'
제8조3항2호={}
제8조3항[제8조3항2호_]=제8조3항2호
제8조4항_='④ 제3항에 따른 부동산의 초과액에 대하여 과세하는 경우에는 이전한 공장용 토지와 건축물 가액의 비율로 나누어 계산한 후 각각 과세한다.'
제8조4항={}
제8조[제8조4항_]=제8조4항
제9조_=' 제9조 (감면 신청) '
제9조={}
제9조['지방세특례제한법시행규칙 제9조 (감면 신청)']={}
조문['제9조 (감면 신청)']=제9조
조['제9조 (감면 신청)']=제9조
제9조1항_='① 영 제126조에 따른 지방세 감면 신청은 별지 제1호서식에 따른다. <개정 2014. 12. 31.>'
제9조1항={}
제9조[제9조1항_]=제9조1항
제9조2항_='② 법 제80조에 따라 공장의 지방 이전에 따른 지방세 감면을 신청하려는 자는 제1항에도 불구하고 별지 제6호서식에 다음 각 호의 서류를 첨부하여 시장ㆍ군수ㆍ구청장에게 제출하여야 한다. <개정 2016. 12. 30.>'
제9조2항={}
제9조[제9조2항_]=제9조2항
제9조2항1호_='1. 이전하기 전의 공장 규모와 조업실적을 증명할 수 있는 서류'
제9조2항1호={}
제9조2항[제9조2항1호_]=제9조2항1호
제9조2항2호_='2. 이전하기 전의 공장용 토지의 지목이 둘 이상이거나 그 토지가 두 필지 이상인 경우 또는 건물이 여러 동일 경우에는 그 명세서'
제9조2항2호={}
제9조2항[제9조2항2호_]=제9조2항2호
제9조2항3호_='3. 이전한 공장용 토지의 지목이 둘 이상이거나 그 토지가 두 필지 이상인 경우 또는 건물이 여러 동일 경우에는 그 명세서'
제9조2항3호={}
제9조2항[제9조2항3호_]=제9조2항3호
제9조3항_='③ 법 제183조제2항에 따른 통지는 별지 제2호서식에 따른다. <개정 2011. 12. 31., 2014. 12. 31.>'
제9조3항={}
제9조[제9조3항_]=제9조3항
제10조_=' 제10조 (지방세 감면자료의 제출) '
제10조={}
제10조['지방세특례제한법시행규칙 제10조 (지방세 감면자료의 제출)']={}
조문['제10조 (지방세 감면자료의 제출)']=제10조
조['제10조 (지방세 감면자료의 제출)']=제10조
제10조1항_='영 제127조에 따라 지방세의 감면자료를 제출하려는 자는 세목별로 각각 별지 제7호서식에 감면받은 세액 등을 확인할 수 있는 서류를 첨부하여 제출하여야 한다. <개정 2014. 12. 31.>'
제10조1항={}
제10조[제10조1항_]=제10조1항
부칙['부칙  <제95호, 2018. 12. 31.']={}
부칙['이 규칙은 2019년 1월 1일부터 시행한다']={}
bub={'서문':서문,'조문':조문,'조별':조,'부칙':부칙}
    
import wx
class MyFrame(wx.Frame):
    def __init__(self):
        wx.Frame.__init__(self, parent=None, title=bubname)
        self.SetSize(620, 520)
        self.mainPanel = wx.Panel(self)
        self.expandButton = wx.Button(self.mainPanel, label=bubname)
        self.tree = wx.TreeCtrl(self.mainPanel)
        root = self.tree.AddRoot(bubname)
        for i in bub:
            ii = self.tree.AppendItem(root, i)
            for j in bub[i]:
                jj = self.tree.AppendItem(ii, j)
                for k in bub[i][j]:
                    kk = self.tree.AppendItem(jj, k)
                    for m in bub[i][j][k]:
                        mm = self.tree.AppendItem(kk, m)
                        for n in bub[i][j][k][m]:
                            nn = self.tree.AppendItem(mm, n)
                            for p in bub[i][j][k][m][n]:
                                pp = self.tree.AppendItem(nn, p)
                                for q in bub[i][j][k][m][n][p]:
                                    qq=self.tree.AppendItem(pp,q)
                                    for r in bub[i][j][k][m][n][p][q]:
                                        rr=self.tree.AppendItem(qq,r)
                                        for s in bub[i][j][k][m][n][p][q][r]:
                                            ss = self.tree.AppendItem(rr, s)
                                            for t in bub[i][j][k][m][n][p][q][r][s]:
                                                tt = self.tree.AppendItem(ss, t)
                                                for u in bub[i][j][k][m][n][p][q][r][s][t]:
                                                    uu = self.tree.AppendItem(tt, u)
                                                    for v in bub[i][j][k][m][n][p][q][r][s][t][u]:
                                                        vv = self.tree.AppendItem(uu, v)
        self.staticText = wx.TextCtrl(self.mainPanel, style=wx.TE_MULTILINE)
        self.vtBoxSizer = wx.BoxSizer(wx.VERTICAL)
        self.vtBoxSizer.Add(self.expandButton, 0, wx.EXPAND | wx.ALL, 5)
        self.vtBoxSizer.Add(self.tree, 5, wx.EXPAND | wx.ALL, 5)
        self.vtBoxSizer.Add(self.staticText, 0, wx.EXPAND | wx.ALL, 5)
        self.mainPanel.SetSizer(self.vtBoxSizer)
        self.Bind(wx.EVT_BUTTON, self.OnExpandButton, self.expandButton)
        self.Bind(wx.EVT_TREE_SEL_CHANGED, self.OnNodeSelected, self.tree)
        self.Bind(wx.EVT_CLOSE, self.OnClose)

    def OnExpandButton(self, e):
        self.tree.ExpandAll()

    def __del__(self):
        print('소멸합니다.')

    def OnClose(self, event):
        frame.Destroy()

    def OnNodeSelected(self, e):
        selected = self.tree.GetSelection()
        self.staticText.SetLabel(self.tree.GetItemText(selected))
        self.mainPanel.Layout()
if __name__ == '__main__':
    app = wx.App(redirect=True)
    frame = MyFrame()
    wnd = wx.Frame(None, wx.ID_ANY, "")
    wnd.CenterOnScreen()
    app.SetTopWindow(wnd)
    frame.Show()
    app.MainLoop()
    