# -*- coding: utf-8 -*-
#Created on 2018-12-24 @author: 권달현
법인세={#To: 결정세액
    "적용대상과 그 범위":{
        '중소기업':{
            '2017년':{
                "유예기간 4년 포함:7%":{},
            },
        },
        '일반기업':{
            '2017년':{
                "유예기간 이후 1~3년차:8%":{},
                "유예기간 이후 4~5년차:9%":{},
                "과세표준100억원 이하:10%":{},
                "과세표준1천억원 이하:12%":{},
                "과세표준1천억원 초과:17%":{},
            },
        },
    },
    "최저한세의 계산구조":{},
    "최저한세에 따른 납부세액의 계산":{},
    "최저한세 적용으로 인한 각종 감면 등의 적용 배제 순서":{},
    "적용 배제된 최저한세 미달세액의 처리":{},
    "세무조정서식":{},
}