# -*- coding: utf-8 -*-
#Created on 2018-12-24 @author: 권달현
기업의미환류소득에대한법인세추가납부={
        '개요':{},
        '과세대상 법인':{},
        '신고방법과 과세방식':{},
        '계산흐름도':{},
        '과세대상 소득':{
            '가산항목':(),
            '차감항목':(),
            },
        '투자금액':{},
        '임금증가 금액':{},
        '배당금액':{},
        '기 타':{},
}
법인세={ # 결정세액
    "준비금의 미사용분 및 임의환입시 이자상당액의 가산징수":{},
    "공제,감면세액의 추가납부 또는 추징":{
        "투자세액공제 적용 자산의 조기처분 및 용도변경":{},
        "세액의 공제,감면요건 위반 등":{},
        "이자상다아산액의 계산":{},
    },
    "기업의미환류소득에대한법인세추가납부":기업의미환류소득에대한법인세추가납부,
}