# -*- coding: utf-8 -*-
"""
Created on Mon Sep 17 15:31:39 2018

@author: SAMSUNG 11
"""


법인세_취득가액={
               "자산의 취득가액":{
                       "매입자산의 경우":{},
                       "자기가 제조 생산 건설한 자산의 경우":{},
                       "합병 분할합병 또는 현물출자에 따라 합병법인 등이 취득한 자산":{},
                       "물적분할에 따라 분할법인이 취득하는 주식등":{},
                       "채무의 출자전환으로 취득하는 주식의 가액":{},
                       "합병 분할(분할합병을 포함,물적붐ㄴ할은 제외)에 따라 피합병법인 등의 주주 등이 취득하는 주식" :{},
                       "공익법인 등이 기부받은 주식":{},
                       "기타":{},
                       },
               "취득가액에 포함되는 것":{},
               "취득가액에서 제외되는 것":{},
               "취득가액의 수정(자산부채의 평가)":{},               
               }