# -*- coding: utf-8 -*-
#Created on 2019-1-1 @author: 권달현
import 지방세법,지방세법시행령,지방세법시행규칙
_={
    '취득세 중과세 실무연구':{},
    '취득세 중과세 개요 및 공통사항 검토':{
        '취득세 중과세 개요':{
            '지방세 중과세제도 현황':{

                "지방세법상 중과제도의 전체적인 개요는 아래와 같다. ":{},
                " 다만, 본서에서는 취득세 중과세 분야만 다루기로 한다. ":{},
                " 다만, 과밀억제권역 내 산업단지로 인하여 실무적으로 사례가 빈번하지 않은 대도 시 공장취득 중과세 및 사치성 재산중 고급선박에 대한 내용은 본서에서 다루지 않는다. ":{},

                '1.취득세':{
                    "1.법인의 대도시내 법인설립,지점설치,본점이전의 경우 대도시내 부동산 취득 중과":{

                        "아래와 같은 대도시 내 법인의 대도시 내 부동산 취득에 대하여 “표준세율×3 -2%×2”의 세율을 적용((구)취득세+(구)등록세 3배 중과 상당액)하여 중과한다.":{},
                        "지방세법 시행령 제27조 제3항":지방세법시행령.제27조,
                        "① 지방세법 시행령 제27조 제3항 전단: ":{
                            " 대도시 내 부동산을 취득한 날부터 5년 이내에 법인 또 는 사무소등이 대도시에서의 법인 설립(휴면법인 인수 포함), 지점･분사무소 설치 및 법인의 본점･주사무소･지점･분사무소의 대도시 전입을 하는 경우 법인의 본점･주사무소･지점 또는 분사무소의 용도로 직접 사용하기 위한 대도시의 부동산 취득(지방세법 제16조 제4항에서 부 동산 취득일 이후 5년간 중과 사후관리함) ":{},
                        },
                        "② 지방세법 시행령 제27조 제3항 후단: ":{
                            "법인 또는 사무소등이 대도시에서의 법인 설립, 지점･분 사무소 설치 및 법인의 본점･주사무소･지점･분사무소의 대도시 전입 이후 5년 이내에 하는 업무용･비업무용 또는 사업용･비사업용의 모든 대도시의 부동산 취득":{},
                        },
                    },
                    "2.과밀억제권역내 본점 또는 주사무소의 사업용 부동산 취득 중과":{
                                                     "과밀억제권역에서 본점이나 주사무소의 사업용부동산을 취득하는 것에 대하여 '표준세율+2%*2'의 세율을 적용((구)취득세 3배중과 +(구)등록세)하여 중과한다.": {},
                                             },
                    "3.사치성 재산의 취득에 대한 중과":{
                                                     "별장,고급주택,고급오락장,고급선박 등의 사업용부동산을 취득하는 것에 대하여 '표준세율+2%*4'의 세율을 적용((구)취득세 5배중과)하여 중과한다.": {},
                                             },
                },
                '2.등록분 등록면허세':{
                                             "지방세법 제28조 제2항":지방세법.제28조2항,
                                     },
                '3.재산세':{
                                             "지방세법 제111조 제1항":지방세법.제111조1항,
                                     },
                '4.특정 부동산분 지역자원시설세':{
                                             "지방세법 제146조 제2항": 지방세법.제111조1항,
                                     },
                '주민세(재산분)':{},
            },
            '취득세 중과세 입법취지':{
                                     '법인의 대도시 내 법인설립 지점설치 본점이전의 경우 대도시 내 부동산 취득 중과':{},
                                     '과밀억제[권역 내 본점 또는 주사무소의 시ㅏ업용부동산 취득 중과':{},
                                     '사치성 재산 취득에 대한 중과':{},
                                     },
        },
        '취득세 중과분 적용요령':{
            '현행 지방세법에서 규정하고 있는 취득세율의 종류':{},
            '취득세 중과 상세 계산구조':{
                                     '부동산 취득시 취득세율: 일반세율 적용시':{},
                                     '부동산 취득시 취득세율: 중과세율 적용시':{},
                                     '지방세법 제13조의 취득세 중과세율 체계':{},
                                     },
            '취득세 과세시 지방교육세 과세표준 산정요령':{
                                     '지방세법 제15조 제2항에 해당하지 않는 경우':{},
                                     '지방세법 제15조 제2항에 해당하여 (구)취득세만 과세되는 경우':{},
                                     },
            '취득세 과세시 농어촌특별세(부과분) 과세표준 산정요령':{
                                     '지방세법 제15조 제2항에 해당하지 않는 경우':{},
                                     '지방세법 제15조 제2항에 해당하여 (구)취득세만 과세되는 경우':{},
                                     },
        },
        '취득세 중과세 배제 및 취득세 중과분 감면특례':{
                             '취득세 중과세율 적용배제 특례':{
                                     '지방세특례제한법에 따른 취득세 중과세율 적용 배제 특례':{},
                                     '지방세특례제한법 및 감면조례에 따른 중과세율 적용시 배제 특례':{},
                                     },
                             '지방세 감면 축소 조정에 따른 중과세율 적용시기 유예 특례':{},
                             '취득세가 100% 감면되어, 사실살 취득세 중과가 적용되지 않는 경우':{},
                             },
    },
    '과밀억제권역 내에서 취득하는 부동산등에 대한 취득세중과세':{
        '법인의 대도시내 법인설립 지점설치 본점이전의 경우 대도시내 부동산 취득 중과':{
                             '의의':{
                                     '중과의 취지':{},
                                     '중과내용 요약':{},
                                     '최근 5년간 개정내용':{},
                                     },
                             '중과 적용요건':{
                                     '법령상의 중과 적용요건':{},
                                     '전체 공통 중과 적용요건':{},
                                     '각 행별 공통 중과 적용요건':{},
                                     '각 열별 공통 중과 적용요건':{},
                                     },
                             '법령상 중과적용 제외 대상':{
                                     '법인이 사원에 대한 분양 또는 임대용으로 직접 사용할 목적으로 "사원주거용 목적 부동산"을 취득':{},
                                     '채권을 보전하거나 행사할 목적으로 부동산을 취득':{},
                                     '대도시 중과 제외 업종에 직접 사용할 목적으로 부동산을 취득':{},
                                     },
                             '중과요건 성립시점과 취득세 신고기한(사원주거용 목적 부동산 제외':{
                                     '법인 또는 사무소등이 대도시에서의 법인설립,지점 분사무소 설치 및 법인의 본점 주사무소 지;점 분사무소의 대도시전입이후 5년이내에 하는 모든 대도시의 부동산 취득:단,단 대도시 중과배제 업종을 영위하지 않는 경우':{},
                                     '대도시내 부동산을 취득한 날로부터 5년이내에 법인 또는 사무소등이 대도시에서의 법인설립,지점 분사무소 설치 및 법인의 본점 등의 대도시 전입을 하는 경우 그 용도로 사용하기 위해 대도시의 부동산 취득: 단...':{},
                                     '대도시 중과배제 업종을 영위하는 경우 중과요건 성립시점과 취득세 신고기한':{},
                                     },
                             '과세대상 물건 중 일부만 중과되는 경우 안분방법':{
                                     '중과대사상 업종에서만 사용하는 부동산 안분방법':{},
                                     '대도시의 중괴제외 업종과 중과대상 업종이 겸용하는 부동산안분방법':{},
                                     },
                             '사후관리 유의사항':{
                                     '부동산을 취득한 후에 중과요건이 설립되는 경우':{},
                                     '부동산을 취득한 후에 중과요건이 성립되는 경우의 취득세 신고기한':{},
                                     },
                             '중과분 취득세 신고 사례':{
                                     '취득당시 취득세 신고사례':{},
                                     '취득이후 추징사유가 발생한 경우 취득세 신고사례':{},
                                     },
                             },
        '과밀억제권역내에서 법인의 본점 또는 주사무소의 사업용부동산을 신축 또는 증축하여 취득하는 경우의 중과':{
                             '의의':{
                                     '중과의 취지':{},
                                     '중과내용 요약':{},
                                     '최근 5년간 개정내용':{},
                                     },
                             '중과 적용요건':{
                                     '법령상의 중과 적용요건':{},
                                     '중과 적용요건 관련 기타 쟁점 사항':{},
                                     },
                             '법령상 중과적용 제외 대상':{},
                             '과세대상 물건 중 일부만 중과되는 경우 안분방법':{
                                     '과밀억제권역내에서 법인의 본점 또는 주사무소의 사업용부동산 신축또는 증축 관련 중과대상과 중과대상이 아닌 부분의 식별':{},
                                     '개별 용도가 구체적으로 구분되는 부분과 공통부분의 식별':{},
                                     '안분의 실행':{},
                                     },
                             '사후관리 유의사항':{},
                             '기타 쟁점 사항':{
                                     '과밀억제권역내에서 기업부설연구소용 부동산을 신축하여 취득하는 경우 지방세법 제13조1항에 따라 취득세가 중과되는지 여부':{},
                                     '산업단지내 본점용 또는 공장용 부동산 취득시 취득세 중과여부':{},
                                     },
                             '중과분 취득세 신고 사례':{
                                     '본점 사무실을 이전하기 전 취득당시 취득세 신고사례':{},
                                     '취득이후 추징사유가 발생한 경우 취득세 신고사례':{},
                                     },
                             '중과분 취득세 신고사례(취득세 중과가 동시에 적용되는 경우)':{
                                     '취득세 중과가 동시에 적용되는 사유':{},
                                     '법인의 대도시내 법인설립 지점설치 본점이전의 경우 대도시내 부동산 추딕중과와 과밀억제권역내 본점 또는 주사무소의 사업용 부동산 취득 중과의 차이점':{},
                                     '부동산 취득당시 지방세법 제13조2항1호가 적용되었다가 부동산취득이후 지방세법1조1항1호가 적용되는 경우의 중과분 취득세 신고사례':{},
                                     '부동산 취득이후 지방세법16조1항1호 및 제4항이 동시에 적용되는 경우의 중과분 취득세 신고사례':{},
                                    },
                             },
    },
    '사치성 재산 취득에 대한 취득세 중과세':{
        '고급주택에 대한 취득세 중과세':{
                             '의의':{
                                     '중과의 취지':{},
                                     '중과내용 요약':{},
                                     '최근 5년간 개정내용':{},
                                     },
                             '중과 적용요건':{
                                     '법령상의 중과 적용요건':{},
                                     '중과 적용요건 관련 기타 쟁점 사항':{},
                                     },
                             '법령상 중과적용 제외 대상':{},
                             '중과요건 성립시점과 취득세 신고기한':{
                                     '취득한 토지나 건축물이 취득당시 고급주택에 해당되어 지방세법13조5항에 따라 고급주택으로 중과되는 경우':{},
                                     '취득한 토지 나 건축물이 취득후 5년이내에 지방세법 제16조 제1항에 따라 고급주택으로 중과되어 취득세가 추징되는 경우':{},
                                     '고급주택에 해당하는 건축물을 증개축 또는 개수한 경우와 일반건축물을 증개축 도는 개수하여 고급주택이 된 경우에 증가되는 건축물의 가액에 대하여 취득세가 중과되는 경우':{},
                                     '중과되는 상황 및 중과범위 종합비교':{},
                                     },
                             '과세대상 물건 중 일부만 중과되는 경우 안분방법':{},
                             '사후관리 유의사항':{
                                     '일반주택에 해당하는 1구의 주거용 건축물과 부속토지를 취득한 후 건축물을 신축.증축.개축.개수하여 1구의 주거용 건축물과 부속토지가 고급주택이 되는 경우':{},
                                     '주택을 취득하여 주거 이외의 용도로 사용하다가 주가용으로 용도를 변경함에 따라 고급주택이 되는 경우':{},
                                     '일반주택에 해당하는 2구의 주거용건축물과 부속토지를 취득한 후 내부계단을 설치하는 등 건축물을 개수(대수선)함에 따라...331제곱미터를 초과핟게 되어 고급주택이 되는 경우':{},
                                     '고급주택에 해당하는 1구의 주거용 건축물과 부속토지를 취득한 후 건축물을 증축 개축 개수하는 경우':{},
                                     '고급주택에 해당하는 1구의 주거용 건축물과 부속토지를 취득한 후 건축물을 신축하는 경우':{},
                                     },
                             '기타 쟁점 사항':{
                                     '고급주택 유형에 따른 취득세 중과세율 차이':{},
                                     '토지의 지목을 사실상 변경함으로써 그 가액이 증가한 경우의 취득세 납세의무':{},
                                     '법인이 고급주택을 사택으로 이용할 경우의 세무이슈':{},
                                     },
                             '중과분 취득세 신고 사례':{
                                     '사실관계':{},
                                     '일반주택 승계취득시 취득세 등 산정':{},
                                     '개수(대수선) 완료시 취득세등 산정':{},
                                     },

                             },
        '별장에 대한 취득세 중과세':{
                             '의의':{
                                     '중과의 취지':{},
                                     '중과내용 요약':{},
                                     '최근 5년간 개정내용':{},
                                     },
                             '중과 적용요건':{
                                     '주거용 건축물일 것':{},
                                     '건축물을 늘 주거용으로 사용하지 아니하고, 휴양 피서 놀이 등의 용도(=별장 용도)로 사용하는 경우일 것':{},
                                     '건축물과 그 부속토지일 것':{},
                                     '법정 농어촌주택과 그 부속토지가 아닐 것':{},
                                     },
                             '법령상 중과적용 제외 대상':{},
                             '중과요건 성립시점과 취득세 신고기한':{
                                     '취득한 토지나 건축물이 취득당시 별장에 해당되어 지방세법13조5항에 따라 별장으로 중과되는 경우':{},
                                     '취득한 토지 나 건축물이 취득후 5년이내에 지방세법 제16조 제1항에 따라 별장으로 중과되어 취득세가 추징되는 경우':{},
                                     '별장에 해당하는 건축물을 증개축 또는 개수한 경우와 일반건축물을 증개축 도는 개수하여 별장이 된 경우에 증가되는 건축물의 가액에 대하여 취득세가 중과되는 경우':{},
                                     '중과되는 상황 및 중과범위 종합비교':{},
                                     },
                             '과세대상 물건 중 일부만 중과되는 경우 안분방법':{},
                             '사후관리 유의사항':{
                                     '부동산 임대사업자의 유의사항':{},
                                     '주거용으로 사용이 가능한 구조인 연수원을 취득한 경우 유의사항':{},
                                     },
                             '기타 쟁점 사항':{
                                     '관광진흥법상 휴양 콘도미니엄 등 건축법상 관광숙박시설이 별장에 해당하는지 여부':{},
                                     '호텔식 주거시스템방식으로 운용되는 부동산이 별장에 해당하는지 여부':{},
                                     '교육연수시설(연수원)이 별장에 해당하는지 여부':{},
                                     '별장 유형에 /다른 취득세 중과세율 차이':{},
                                     },
                             '중과분 취득세 신고 사례':{
                                     '별장을 유상 승계취득하는 경우':{},
                                     '나대지를 유상승계취득한 후 5년 이내 별장을 신축하여 취득하는 경우':{},
                                     },
                             },
        '고급오락장에 대한 취득세 중과세':{
                             '의의':{
                                     '중과의 취지':{},
                                     '중과내용 요약':{},
                                     '최근 5년간 개정내용':{},
                                     },
                             '중과 적용요건':{
                                     '카지노장':{},
                                     '투전기를 설치한 장소':{},
                                     '고급미용실':{},
                                     '유흥주점영업장':{},
                                     },
                             '법령상 중과적용 제외 대상':{},
                             '중과요건 성립시점과 취득세 신고기한':{
                                     '취득한 토지나 건축물이 취득당시 고급오락장에 해당되어 지방세법13조5항에 따라 고급오락장으로 중과되는 경우':{},
                                     '취득한 토지 나 건축물이 취득후 5년이내에 지방세법 제16조 제1항에 따라 고급오락장으로 중과되어 취득세가 추징되는 경우':{},
                                     '고급오락장에 해당하는 건축물을 증개축 또는 개수한 경우와 일반건축물을 증개축 도는 개수하여 고급오락장이 된 경우에 증가되는 건축물의 가액에 대하여 취득세가 중과되는 경우':{},
                                     '중과되는 상황 및 중과범위 종합비교':{},
                                     },
                             '과세대상 물건 중 일부만 중과되는 경우 안분방법':{
                                     '취득가격을 안분하는 단계별 요령':{},
                                     '건축물과 부속토지의 면적 안분사례':{},
                                     },
                             '기타 쟁점 사항':{
                                     '부동산 취득후 5년이내의 임대차기간중 임차인이 임대인의 동의 없이 임대부동산을 개조하여 고급오락장에 해당된 경우 임대인에게 중과세율로 취득세를 부과할 수 있는지 여부':{},
                                     '임차인이 건축물 소유자의 승인없이 고급오락장을 개수(대수선공사)하는 경우 건축물의 취득세 납세의무자':{},
                                     '구분소유되지않는 건물내 유흥주점영업장에 대해 취득세를 중과세한후 5년이내에 동일 건물내 다른 층으로 면적증가없이 이전한 경우 다시 유흥주점영업장(고급오락장)설치로 보아 취득세 중과세대상에  해당하는지 여부':{},
                                     '부동산 취득당시 고급오락장으로 토지와 건물부분에 대해 중과세되었으나,추후 일반유흥주점으로 영업변경후 다시 중과세대상인 고급오락장으로 영업허가를 받아 사용할 경우 취득세 중과여부':{},
                                     },
                             '사후관리 유의사항':{
                                     '임차인이 고급오락장 용도로 사용하고 있는 경우 건축물을 취득하여 건축물을 신축하고자 하는 경우':{},
                                     '건물을 임차받은 자가 취득자의 의사에 기하지 아니하고 고급오락장을 설치한 경우 고급오락장용도로 부동산을 임대할 의삭 없었다는 사실을 입증하기 위해 고려해야 할 사항':{},
                                     },
                             '중과분 취득세 신고 사례':{
                                     '고급오락장을 유상 승계취득하는 경우':{},
                                     '나대지를 유상승계취득한 후 5년 이내 고급오락장을 신축하여 취득하는 경우':{},
                                     },
                             },
        '골프장에 대한 취득세 중과세':{
                             '의의':{
                                     '중과의 취지':{},
                                     '중과내용 요약':{},
                                     },
                             '중과 적용요건':{
                                     '회원제 골프장용 부동산일 것':{},
                                     '구분대상이 되는 토지와 건축물 및 그 토지상의 입목일 것':{},
                                     },
                             '법령상 중과적용 제외 대상':{},
                             '중과요건 성립시점과 취득세 신고기한':{
                                     '최초로 취득한 토지나 건축물이 지방세법13조5항에 따라 골프장으로 중과되는 경우':{},
                                     '취득한 토지 나 건축물이 취득후 5년이내에 지방세법 제16조 제1항에 따라 골프장으로 중과되어 취득세가 추징되는 경우':{},
                                     '골프장에 해당하는 건축물을 증개축 또는 개수한 경우와 일반건축물을 증개축 도는 개수하여골프장이 된 경우에 증가되는 건축물의 가액에 대하여 취득세가 중과되는 경우':{}                                     },
                             '과세대상 물건 중 일부만 중과되는 경우 안분방법':{ },
                             '사후관리 유의사항':{},
                             '기타 쟁점 사항':{
                                     '구분등록대상인 골프장용 부동산에 해당하지 않는 사례':{},
                                     '사실상 사용일 이후 추가공사비의 과세표준 포함 여부':{},
                                     '사실상 사용일의 판단':{},
                                     '토지거래허가 구역 내 토지 취득시 취득시기':{},
                                     },
                             '중과분 취득세 신고 사례':{
                                     '사실관계':{},
                                     '취득시기별 취득세 산정':{},
                                     },
                             },
    },
    '부동산신탁제도 활용시 취득세 과세체계 및 취득세 중과이슈 검토':{
        '신탁의 개요':{
                             '신탁법상 신탁의 개요':{},
                             '부동산신탁의 유형별 분류':{
                                     '관리신탁':{},
                                     '처분신탁':{},
                                     '토지신탁(개발신탁)':{},
                                     '담보신탁':{},
                                     },
                             },
        '부동산신탁제도 활용시 신탁재산에대한 취득세 과세체계':{
                             '부동산신탁제도 활용시 신탁재산에대한 일반적인 취득세 과세체계':{
                                     '신탁의 설정':{},
                                     '신탁의 이해관계자의 변경':{},
                                     '신탁의 운용':{},
                                     '신탁의 종료':{},
                                     },
                             '부동산신탁제도 활용시 위탁법인의 과점주주에대한 간주취득세':{},
                             },
        '부동산신탁제도 활용시 신탁재산에 대한 취득세 중과':{
                             '과밀억제권역내에서 법인의 본점 또는 주사무소의 사업용 부동산을 신축또는 증축하여 취득하는 경우의 중과':{},
                             '법인의 대도시내 법인설립 지점설치 본점이전의 경우 대도시내 부동산 취득 중과':{},
                             '토지나 건축물을 취득한 후 5년이내에 해당 토지나 건축물이 지방세법 제13조 제5항에 따른 별장,골프장,고급주택 또는 고급오락장이 되는 경우':{},
                             },
    },
    '합병 분할로 취득세 과세물건 취득시 취득세 중과 유의사항':{
        '합병으로 취득세 과세물건 취득시 취득세 중과 유의사항':{},
        '분할로   취득세 과세물건 취득시 취득세 중과 유의사항':{},
    },
    '기타 취득세 중과 유의사항':{
        '과점주주의 간주취득세 중과세':{
                             '과점주주의 간주취득세 개요':{},
                             '과점주주에 대한 납세의무 성립시점':{},
                             '과점주주 간주추ㅡ득세가 중과되는 경우':{},
                             '과점주주 간주취득세 중과분 산정 사례':{},                             },
        '특정 업종별 취득세 유의사항':{
                             '부동산임대업':{},
                             '부동산 개발 및 공급업':{},
                             },
    },
}
#___________________________________________________
제목='취득세중과세'
tax=_
import wx
class MyFrame(wx.Frame):
    def __init__(self):
        wx.Frame.__init__(self,parent=None,title=제목)
        self.SetSize(420,320*2)
        self.mainPanel=wx.Panel(self)
        self.expandButton=wx.Button(self.mainPanel,label='펼침')
        self.tree=wx.TreeCtrl(self.mainPanel)
        root=self.tree.AddRoot(제목)
        for i in tax:
            ii=self.tree.AppendItem(root,i)
            for j in tax[i]:
                jj=self.tree.AppendItem(ii,j)
                for k in tax[i][j]:
                    kk=self.tree.AppendItem(jj,k)
                    for m in tax[i][j][k]:
                        mm=self.tree.AppendItem(kk,m)
                        for n in tax[i][j][k][m]:
                            nn=self.tree.AppendItem(mm,n)
                            for p in tax[i][j][k][m][n]:
                                pp=self.tree.AppendItem(nn,p)
                                for q in tax[i][j][k][m][n][p]:
                                    qq=self.tree.AppendItem(pp,q)
                                    for r in tax[i][j][k][m][n][p][q]:
                                        rr=self.tree.AppendItem(qq,r)
                                        for s in tax[i][j][k][m][n][p][q][r]:
                                            ss = self.tree.AppendItem(rr, s)
                                            for t in tax[i][j][k][m][n][p][q][r][s]:
                                                tt = self.tree.AppendItem(ss, s)

        self.staticText =wx.TextCtrl(self.mainPanel,style=wx.TE_MULTILINE)


        self.vtBoxSizer=wx.BoxSizer(wx.VERTICAL)
        self.vtBoxSizer.Add(self.expandButton,0,wx.EXPAND|wx.ALL,5)
        self.vtBoxSizer.Add(self.tree        ,5,wx.EXPAND|wx.ALL,5)
        self.vtBoxSizer.Add(self.staticText  ,0,wx.EXPAND|wx.ALL,5)


        self.mainPanel.SetSizer(self.vtBoxSizer)

        self.Bind(wx.EVT_BUTTON          ,self.OnExpandButton,self.expandButton)
        self.Bind(wx.EVT_TREE_SEL_CHANGED,self.OnNodeSelected,self.tree)
    def OnExpandButton(self,e):
        self.tree.ExpandAll()
    def OnNodeSelected(self,e):
        selected=self.tree.GetSelection()
        self.staticText.SetLabel(self.tree.GetItemText(selected))

        self.mainPanel.Layout()
if __name__=='__main__':
    app=wx.App()
    frame=MyFrame()
    frame.Show()
    app.MainLoop()
#___________________________________________________