# -*- coding: utf-8 -*-
"""
Created on Tue Sep 18 12:43:44 2018

@author: SAMSUNG 11
"""

법인세={
    "손금":{

                    "조정에 필요한 내용 ": {

                        "  내국법인이 임원 또는 사용인의 퇴직을 퇴직급여의 지급사유로 하고 임원 또는 사용인을 수익자로 하는 연금으로서 법칙§23 각호에 따른 보험회사 등이 취급하는 퇴직연금(이하 “퇴직연금 등”이라 한다)의 부담금으로 지출하는 금액은": {},
                        "- 당해 사업연도의 소득금액 계산에 있어서 일정 한도 내에서 이를 손금에 산입할수 있습니다(법령§44의2②)": {},
                        "  퇴직연금 등의 부담금 중 확정기여형 퇴직연금 등[근로자퇴직급여보장법 제19조에 따른 확정기여형 퇴직연금, 동법 제24조에 따른 개인형퇴직 연금제도, 과학기술인공제회법에 따른 퇴직연금 중 확정기여형 퇴직연금]은 전액 손금에 산입하고,": {},
                        "- 그 외 퇴직연금 등의 부담금은 일정한도 내에서 손금에 산입하며, 2이상의 부담금이 있는 경우에는 먼저 계약이 체결된 퇴직연금 등의 부담금부터 손금에 산입합니다(법령§44의2④) ": {},

                    },
                    "① 퇴직연금 등의 범위(법칙§23) ": {

                        "  손금산입 하는 퇴직연금 등은 다음 어느 하나에 해당하는 기관이 취급하는 퇴직연금을 말합니다.": {},
                        "-  보험업법 에 따른 보험회사 -  자본시장과 금융투자업에 관한 법률 에 따른 신탁업자 집합투자업자  투자매매 업자 또는 투자중개업자 -  은행법 에 따른 은행 -  산업재해보상보험법  제10조에 따른 근로복지공단 ": {},
                        "☞ 퇴직보험 신탁 폐지에 따라 2011.1.1. 이후 납입하는 퇴직보험 신탁 보험료 등은 손금산입 되지 않습니다(법영§44의2②, 2010.12.30. 개정).": {},
                        "다만, 종전 규정에 따라 손금에 산입한 보험료 등은 익금에 환입하지 아니하며, 보험료 등을 운용함에 따라 발생하는 수익은 손금에 산입할 수 있습니다(2010.12.30. 영 부칙§19). ": {},

                    },
                    "② 손금산입 범위액 계산 ": {

                        "사업연도 종료일 현재 퇴직급여추계액(1)과 보험수리기준추계액(2) 중큰 금액 ": {},
                        "퇴직연금부담금 등손금산입누적 한도액(A) ": {},
                        "사업연도 종료일 현재 퇴직 연금예치금 등 합계액(4) ": {},
                        "－ ": {},
                        "사업연도 종료일 현재 퇴직급여충당금(3) ": {},
                        "－ ": {},
                        "이미 손금산입한 부담금 등(B)(5) ": {},
                        "－ ": {},
                        "이미 손금산입한 부담금 등(B)(5) ": {},
                        "＝ ": {},
                        "퇴직연금부담금 등 손금산입 누적 한도액(A) ": {},
                        "＝ 손금산입 한도액(C) ": {},
                        "= 손금산입대상 부담금 등(D) ": {},

                        "손금산입 범위액 ＝(C)와 (D)중 적은 금액 ": {},
                        "  해당 사업연도 종료일 현재 재직하는 임원 또는 사용인의 전원이 퇴직할 경우에 퇴직급여로 지급되어야 할 금액의 추계액(법령§44에 따른 손금불산입액과 법령 §44의2③에 따른 손금 산입액 제외)을 말합니다.": {},
                        "  다음 ㉠, ㉡의 합계액(법령§44에 따른 손금불산입액과 법령§44의2③에 따른 손금 산입액 제외)": {},
                        "㉠ 매 사업연도 말일 현재를 기준으로 산정한 가입자의 예상 퇴직시점까지의 가입기간에 대한 급여에 드는 비용 예상액의 현재가치에서 장래 근무기간분에 대하여 발생하는 부담금 수입 예상액의 현재가치를 뺀 금액으로서, 고용노동부령으로 정하는 방법에 따라 산정한 금액( 근로자퇴직급여보장법  제16조 제1항 제1호)": {},
                        "㉡ 해당 사업연도종료일 현재 재직하는 임원 또는 사용인 중 확정급여형 퇴직연금제도에 가입하지 아니한 사람 전원이 퇴직할 경우에 퇴직급여로 지급되어야 할 금액의 추계액과 확정급여형퇴직연금제도에 가입한 사람으로서 그 재직기간 중 가입하지 아니한 기간이 있는 사람 전원이 퇴직할 경우에 그 가입하지 아니한 기간에 대하여 퇴직급여로 지급되어야 할 금액의 추계액을 더한 금액": {},
                        "  사업연도 종료일 현재 퇴직급여충당금 = 장부상 기말잔액 - 확정기여형 퇴직연금설정자의 설정전 계상된 퇴직급여충당금 - 당기말 부인누계액 ": {},

                        "  사업연도 종료일 현재 퇴직연금예치금 등 합계액 = 기초 퇴직연금예치금 등 - 기중 퇴직연금예치금 등 수령 및 해약액 + 당기 퇴직연금예치금 등의 납입액": {},
                        "  이미 손금산입한 부담금 등 = 기초퇴직연금충당금 등 및 전기말 신고조정에 의한 손금산입액 - 퇴직연금충당금 등 손금부인누계액 - 기중 퇴직연금 등 수령 및 해약액 ": {},
                    },
                    "③ 회계처리 및 세무조정방법 ": {
                        "  퇴직연금부담금 등을 납입하고 퇴직연금예치금 등으로 자산 계상한 경우에는 결산조정에 의해 법인의 손금으로 계상하지 아니하였더라도 - 세무계산상(신고조정) 손금에 산입할 수 있습니다.": {},
                        "  임원에 대한 확정기여형 퇴직연금 부담금은 법인이 퇴직 시까지 부담한 부담금의 합계액을 퇴직급여로 보아 법령§44④을 적용하되, - 손금산입한도 초과금액이 있는 경우에는 퇴직일이 속하는 사업연도의 부담금 중손금산입 한도 초과금액 상당액을 손금에 산입하지 아니하고, - 손금산입 한도 초과금액이 퇴직일이 속하는 사업연도의 부담금을 초과하는 경우그 초과금액은 퇴직일이 속하는 사업연도의 익금에 산입합니다(법령§44의2③단서). ": {},
                    },
                    "참고：예규 ": {

                        " 임원 퇴직금 중간정산 후 퇴직연금 세무조정 ": {},
                        "내국법인이 임원에 대한 급여를 연봉제로 전환하면서 향후 퇴직금을 지급하지 아니하는 조건으로 그 때까지의 퇴직금을 정산하여 지급하고 추후 주주총회에서 임원의 급여를 연봉제 이전의 방식으로 전환하되 그 전환일로부터 기산하여 퇴직금을 지급하기로 결의한 경우 퇴직연금 손금산입 가능함(법인세과-1626, 2017.06.22) ": {},
                        " 확정기여형퇴직연금제도 설정법인이 상여금을 임직원의 퇴직연금으로 추가납입시 손금 해당됨 ": {},
                        "근로자퇴직급여보장법 제19조에 따른 확정기여형퇴직연금제도를 설정한 내국법 인이 근로자와 합의한 퇴직연금규약에 따라 임원 및 사용인의 상여금(법인세법 시행령 제43조제1항 내지 제3항에 따른 상여금은 제외) 중 일부 또는 전부를 사용자 부담금 으로 확정기여형퇴직연금에 추가하여 지출하는 경우 해당 부담금은 법인세법 시행령 제44조의2제3항에 따라 전액 손금에 산입하는 것임 ": {},
                        "256 2018 법인세 신고안내 ": {},
                        "다만, 임원에 대한 부담금은 법인이 퇴직시까지 부담한 부담금의 합계액을 퇴직급여로 보아 법인세법 시행령 제44조제4항을 적용하되 손금산입한도 초과액이 있는 경우에는 퇴직일이 속하는 사업연도의 부담금 중 손금산입한도 초과액 상당액을 손금에 산입하지 아니하고 손금산입한도 초과금액이 퇴직일이 속하는 사업연도의 부담금을 초과하는 경우그 초과금액은 퇴직일이 속하는 사업연도의 익금에 산입하는 것임(서면법규과-883, 2014.8.14) ": {},
                        " 확정급여형퇴직연금과 확정기여형퇴직연금을 함께 설정하는 경우 퇴직연금 부담금의 세무처리 방법 ": {},
                        "내국법인이 확정기여형퇴직연금이 설정된 임원 또는 사용인에 대해 확정급여형퇴직 연금 부담금으로서 지출하는 금액은 「법인세법 시행령」 제44조의2에 따라 손금에 산입하지 아니하는 것임(서면-2014-법령해석법인-20651, 2015.7.16) ": {},
                        " 퇴직보험 해약과 동시에 퇴직연금에 가입하는 경우 세무조정 ": {},
                        "내국법인이 법인세법 시행령(2010.12.30. 대통령령 제22577호로 개정되기 전의 것) 제44조의2 제2항에 따른 퇴직보험을 해지하는 동시에 퇴직연금에 가입 하면서 퇴직보험의 해지로 수령한 금액을 새로 가입한 퇴직연금에 불입하는 경우": {},
                        "퇴직보험의 해지로 수령한 금액 중 신고조정 또는 결산조정으로 손금에 산입한 보험료에 상당하는 금액은 익금에 산입하고, 퇴직연금에 불입한 금액은 퇴직연금부담금의 손금산입한도 내에서 손금에 산입하는 것임(서면법규과-895, 2013.8.19.) ": {},
                        " 종신복지플랜변액연금 부담금의 손금 해당 여부 ": {},
                        "내국법인(이하 “해당법인”)이 근로자의 퇴직금을 지급할 목적으로 근로자를 피보험자로 하고, 해당법인을 계약자와 수익자로 하여 가입한 변액연금은  법인세법 시행령  제44조의2 제2항에서 규정하는 퇴직연금 등에 해당하지 아니하는 것으로, 해당법인이 불입한 부담금은 각 사업연도 소득금액 계산에 있어서 손금에 산입하지 아니하는 것임(법인세과-462, 2012.7.18.  법규과-678, 2012.6.18.) ": {},
                        " 퇴직보험료의 손금산입 방법(법인세과-152, 2011.2.25.) ": {},
                        "내국법인이 퇴직보험료를 납입한 사업연도에 손금에 산입하지 아니한 경우 세무처리에 대해서는 기존회신사례(서이46012-10897, 2002.4.29.) 참고": {},
                        "◈ 서이46012-10897, 2002.4.29.": {},
                        "법인이 퇴직보험료를 납입하고 퇴직보험예치금으로 자산계상한 금액을 결산조정에 의하여 비용계상하지 아니한 경우 각 사업연도 소득금액 계산상 이를 납입한 사업연도에 법인세법시행령 제44조의2 제3항의 손금산입한도 내에서 신고조정으로 손금에 산입하는 것임 ": {},

                        " 임원에 대한 확정기여형 퇴직연금 부담금의 세무처리 ": {},
                        "법인의 확정기여형퇴직연금 부담금은  근로자퇴직급여보장법  제13조에 따라 매년 1회이상 정기적으로 납부하여야 하는 것으로, 퇴직연금규약상 납입기일이 도래하기 전에선 불입한 금액은 손금에 산입하지 아니하는 것임(법인세과-1020, 2010.10.29.) ": {},
                        " 확정기여형 퇴직연금의 손익귀속시기 ": {},
                        "내국법인이 퇴직급여지급 규정에 따라 계속 근로기간이 1년 미만인 근로자에게 퇴직급여를 지급하지 않음에도 확정기여형 퇴직연금에 가입하고 부담하는 보험료 등은 지출한 사업연도의 손금에 산입하는 것이며, 이 경우 법인이 계속 근로기간이 1년 미만인 근로자가 퇴직함에 따라 퇴직연금사업자로부터 퇴직연금 불입금을 반환받는 경우에는 반환받은 날이 속하는 사업연도의 익금에 산입하는 것임(법인세과-1186, 2009.10.26.) ": {},
                        " 퇴직연금 설정전 근무기간을 포함하여 확정기여형 퇴직연금을 설정시 세무처리 ": {},
                        "법인이 임직원의 퇴직급여제도를  근로자퇴직급여 보장법  제13조에 따른 확정기여형 퇴직연금으로 전환하면서 전환일 이전 근무기간에 대하여 같은 법 제8조제2항에 의하여 퇴직급여를 중간정산하여 지급하는 경우,  근로기준법 상 근로자에게 지급한 중간정산 퇴직급여는 이를 현실적인 퇴직으로 보아 그 중간정산 퇴직급여 지급액을 손금산입하나,  근로기준법 상 근로자에 해당하지 아니하는 임원에게 지급한 중간정산 퇴직급여는 현실적으로 퇴직할 때까지 이를 업무무관 가지급금으로 보는 것임": {},
                        "법인이 임직원의 퇴직을 연금의 지급사유로 하고 임원 또는 사용인을 수급자로 하는  근로자퇴직급여 보장법  제13조에 따른 확정기여형 퇴직연금을 설정하면서 퇴직연금 설정 전 근무기간분에 대한 부담금을 지출한 경우 그 지출금액은 퇴직급여충당금의 누적액에서 차감된 퇴직급여충당금에서 먼저 지출된 것으로 보는 것이며, 차감된 퇴직급여충당금을 초과하여 지출한 금액은 이를 손금에 산입하는 것임": {},
                        "법인이  근로기준법  상 근로자에 대하여 근무기간 중 일정기간은  근로자 퇴직급여 보장법  제8조제2항에 따라 퇴직급여를 중간정산하여 지급하고 일정기간은 확정기여형 퇴직연금을 설정하여 당해 기간에 대한 부담금을 지출한 경우 퇴직급여 중간정산에 따른 지급은 현실적인 퇴직으로 보는 것이며, 확정기여형 퇴직연금을 설정하면서 퇴직연금 설정 전 근무기간분에 대한 부담금으로 지출한 금액은 퇴직급여충당금의 누적액에서 차감된 퇴직급여 충당금에서 먼저 지출된 것으로 보는 것이며, 차감된 퇴직급여충당금을 초과하여 지출한 금액은 이를 손금에 산입하는 것임(법인세과-1032, 2009.9.21.) ": {},

                    },
                    "④ 퇴직연금부담금 조정명세서 작성사례 ": {

                        "  사업연도말 현재 전사용인(확정기여형 퇴직연금 설정자 제외) 퇴직급여추계액 (정관 규정에 따른 추계액)：100,000,000원": {},
                        "  사업연도말 현재 전사용인(확정기여형 퇴직연금 설정자 제외) 퇴직급여추계액 (근로자퇴직급여보장법에 따른 추계액)：50,000,000원": {},
                        "  퇴직급여충당금 전기이월액：20,000,000원 당기설정액：10,000,000원(한도초과액 없음)": {},
                        "  직전 사업연도말 현재 손금산입한 퇴직연금부담금：60,000,000원": {},
                        "  전사업연도 종료일까지 불입한 퇴직연금부담금：70,000,000원 → 이중 당해사업연도에 퇴직자에게 지급한 퇴직연금은 15,000,000원임.": {},
                        "  당기회사불입액：25,000,000원": {},
                        "  당기에 회사가 손금산입한 퇴직연금부담금：35,000,000원 ": {},
                    },
                    "세무조정계산 ": {

                        "① 퇴직급여 추계액：100,000,000원[MAX(100,000,000원, 50,000,000원)]": {},
                        "② 당기말 퇴직급여충당금：30,000,000원 (20,000,000＋10,000,000)": {},
                        "③ 퇴직연금부담금 등 손금산입누적 한도액(①－②)：70,000,000원": {},
                        "④ 이미 손금산입한 퇴직연금부담금：45,000,000 (60,000,000－15,000,000)": {},
                        "⑤ 손금산입 한도액(③－④)：25,000,000 ⑥ 기말현재 퇴직연금예치금등：80,000,000 (70,000,000 - 15,000,000 + 25,000,000)": {},
                        "⑦ 손금산입대상 퇴직연금부담금 등：35,000,000 (⑥－④)": {},
                        "⑧ 한도액：25,000,000 (⑤와 ⑦ 중 작은 금액)": {},
                        "⑨ 한도초과액：10,000,000(35,000,000－25,000,000) ": {},

                        "사 업 연 도 ": {},
                        "퇴직연금부담금 조정명세서 ": {},
                        "1. 퇴직연금 등의 부담금 조정 ": {},
                        "① 퇴직급여추계액 ": {},
                        "② 장부상 기말잔액 ": {},
                        "당기말 현재 퇴직급여충당금": {},
                        "⑥ 퇴직부담금 등손금산입 누적 한도액 (①－⑤) ": {},
                        "⑨ 손금산입대상 부담금 등( ) ": {},
                        "⑬ 퇴직연금 예치금 등 계(    ) ": {},
                        "⑮퇴직연금 충당금 등손금부인 누계액 ": {},
                        "    기중 ": {},
                        "퇴직연금등 수령 및 해약액 ": {},
                        "나. 기말 퇴직연금 예치금 등의 계산 ": {},
                        "     기초퇴직연금예치금 등 ": {},
                    },
                    "■ 법인세법 시행규칙 [별지 제33호서식] <개정 2014.3.14> ": {

                        "2017.1.1. ": {},
                        "법 인 명 ㈜가나": {},
                        "~ 사업자등록번호 101-81-12345 2017.12.31. ": {},
                        "③ 확정기여형 퇴직연금자의 퇴직연금 설정 전기계상된 퇴직급여충당금 ": {},
                        "④ 당기말 부인 누계액 ": {},
                        "⑤ 차감액 (②－③－④) ": {},
                        "100,000,000 30,000,000 30,000,000 70,000,000 ": {},
                        "⑦ 이미 손금 산입한 부담금 등(    ) ": {},
                        "⑧ 손금산입 한도액 (⑥－⑦) ": {},
                        "⑩ 손금산입범위액 (⑧과 ⑨ 중작은 금액) ": {},
                        "⑪ 회사손금 계상액 ": {},
                        "⑫ 조정금액 (⑩－⑪) ": {},
                        "45,000,000 25,000,000 35,000,000 25,000,000 35,000,000 △10,000,000 ": {},
                        "2. 이미 손금산입한 부담금 등의 계산 ": {},
                        "가. 손금산입대상 부담금 등 계산 ": {},
                        "⑭ 기초퇴직 연금 충당금등 및 전기말 신고조정에 의한 손금 산입액 ": {},
                        "     이미 손금산입한 부담금 등 (⑭－⑮－    ) ": {},
                        "  손금산입대상 부담금 등 (⑬－    ) ": {},
                        "80,000,000 60,000,000 15,000,000 45,000,000 35,000,000 ": {},
                        "     기중 퇴직연금예치금등 수령 및 해약액 ": {},
                        "     당기 퇴직연금예치금 등의 납입액 ": {},
                        "     퇴직연금예치금 등 계 (    －    ＋    )": {},
                        "70,000,000 15,000,000 25,000,000 80,000,000 ": {},
                        "210×297㎜(신문용지 54g/㎥(재활용품)) ": {},
                        "260 2018 법인세 신고안내 ": {},
                    },
                    "(뒤 쪽)작 성 방 법 ": {

                        "1. ① 퇴직급여추계액란은  법인세법 시행령  제44조의2제4항제1호와 제1호의2의 금액 중 큰 금액인 '퇴직급여충당금조정명세서(별지 제32호서식)'의      세법상 추계액란의 금액을 적습니다. ": {},
                        "※ 2011.1.1. 전에 납부한 퇴직보험 신탁의 금액과 2011.1.1. 전에 납부한 퇴직보험 신탁으로 인해 2011.1.1. 이후 발생한 운용수익으로 퇴직보험 신탁을 납부한 금액이 있는 경우에는 퇴직 연금예치금에 포함하여 이 서식을 작성합니다. ": {},
                        "2. ③ 확정기여형 퇴직연금자의 퇴직연금 설정 전 기계상된 퇴직급여충당금란에는  법인세법 시행규칙  제31조제2항에 따라 계산한 '확정기여형 퇴직연금등 설정자의 설정 전 기 계상된 퇴직급여충당금'을 적습니다. ": {},
                        "3. ④ 당기말 부인 누계액란에는 ② 장부상 기말잔액 중에 세무상 부인액이 포함되어 있는 경우에그 부인액(확정기여형 퇴직연금등 설정자의 설정 전 기 계상된 퇴직급여충당금과 관련된 부인액은 제외합니다)을 적습니다. ": {},
                        "4. ⑧ 손금산입한도액란에는 ⑥란의 퇴직부담금 등 손금산입 누적한도액에서 ⑦란의 이미 손금산입한 부담금 등을 뺀 금액을 적되, 조세특례제한법 시행규칙  제29조제1항을 적용받는 법인의 경우그 금액이 음수(－)이면 '0'을 적습니다. ": {},
                        "5. ⑪ 회사손금계상액란에는 당기의 퇴직연금충당금 등 전입액을 적습니다. ": {},
                        "6. ⑫ 조정금액란이 양수(+)인 경우에는 손금에 더하고, 음수(-)인 경우에는 익금에 더합니다. ": {},
                        "7. ⑭ 기초퇴직연금충당금등 및 전기말 신고조정에 의한 손금산입액란에는 재무상태표상 기초퇴직 연금충당금 등 잔액과 직전 사업연도 세무조정계산서상 퇴직연금부담금 등의 손금산입누계액을 적습니다. ": {},
                        "8.      기중퇴직부담금 등 수령 및 해약액란에는 확정기여형 퇴직연금등으로 전환된 금액과 퇴직 보험 신탁의 해약금액을 포함하여 적습니다. ": {},
                        "9.      기중 퇴직연금예치금 등 수령 및 해약액란에는 확정기여형 퇴직연금등으로 전환된 금액과 퇴직 보험 신탁의 해약금액을 포함하여 적습니다. ": {},
                        "210mm×297mm[백상지 80g/㎡ 또는 중질지 80g/㎡] ": {},
                    },
                },
}


#___________________________________________________
제목='퇴직연금부담금'
_={
    #"지방소득세_법인세분 가산세": 지방소득세_법인세분,
    #"기업회계":기업회계,
    "법인세":법인세,
    #"조세특례제한법":조세특례제한법,
    #"증여세":증여세,
    #"상속세":상속세,
    #"양도소득세":양도소득세,
    #"농어촌특별세":{},
}
tax=_
import wx
class MyFrame(wx.Frame):
    def __init__(self):
        wx.Frame.__init__(self,parent=None,title=제목)
        self.SetSize(420,320*2)
        self.mainPanel=wx.Panel(self)
        self.expandButton=wx.Button(self.mainPanel,label='펼침')
        self.tree=wx.TreeCtrl(self.mainPanel)
        root=self.tree.AddRoot(제목)
        for i in tax:
            ii=self.tree.AppendItem(root,i)
            for j in tax[i]:
                jj=self.tree.AppendItem(ii,j)
                for k in tax[i][j]:
                    kk=self.tree.AppendItem(jj,k)
                    for m in tax[i][j][k]:
                        mm=self.tree.AppendItem(kk,m)
                        for n in tax[i][j][k][m]:
                            nn=self.tree.AppendItem(mm,n)
                            for p in tax[i][j][k][m][n]:
                                pp=self.tree.AppendItem(nn,p)
                                for q in tax[i][j][k][m][n][p]:
                                    qq=self.tree.AppendItem(pp,q)
                                    for r in tax[i][j][k][m][n][p][q]:
                                        rr=self.tree.AppendItem(qq,r)
        self.staticText =wx.TextCtrl(self.mainPanel,style=wx.TE_MULTILINE)

        self.vtBoxSizer=wx.BoxSizer(wx.VERTICAL)
        self.vtBoxSizer.Add(self.expandButton,0,wx.EXPAND|wx.ALL,5)
        self.vtBoxSizer.Add(self.tree        ,5,wx.EXPAND|wx.ALL,5)
        self.vtBoxSizer.Add(self.staticText  ,0,wx.EXPAND|wx.ALL,5)
        self.mainPanel.SetSizer(self.vtBoxSizer)
        self.Bind(wx.EVT_BUTTON          ,self.OnExpandButton,self.expandButton)
        self.Bind(wx.EVT_TREE_SEL_CHANGED,self.OnNodeSelected,self.tree)
    def OnExpandButton(self,e):
        self.tree.ExpandAll()
    def OnNodeSelected(self,e):
        selected=self.tree.GetSelection()
        self.staticText.SetLabel(self.tree.GetItemText(selected))
        #self.
        self.mainPanel.Layout()
if __name__=='__main__':
    app=wx.App()
    frame=MyFrame()
    frame.Show()
    app.MainLoop()
#___________________________________________________